struct __va_list_tag {
	unsigned int               gp_offset;            /*     0     4 */
	unsigned int               fp_offset;            /*     4     4 */
	void *                     overflow_arg_area;    /*     8     8 */
	void *                     reg_save_area;        /*    16     8 */

	/* size: 24, cachelines: 1, members: 4 */
	/* last cacheline: 24 bytes */
};
struct __pthread_internal_list {
	struct __pthread_internal_list * __prev;         /*     0     8 */
	struct __pthread_internal_list * __next;         /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct __pthread_mutex_s {
	int                        __lock;               /*     0     4 */
	unsigned int               __count;              /*     4     4 */
	int                        __owner;              /*     8     4 */
	unsigned int               __nusers;             /*    12     4 */
	int                        __kind;               /*    16     4 */
	short int                  __spins;              /*    20     2 */
	short int                  __elision;            /*    22     2 */
	__pthread_list_t           __list;               /*    24    16 */

	/* size: 40, cachelines: 1, members: 8 */
	/* last cacheline: 40 bytes */
};
struct _IO_FILE {
	int                        _flags;               /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	char *                     _IO_read_ptr;         /*     8     8 */
	char *                     _IO_read_end;         /*    16     8 */
	char *                     _IO_read_base;        /*    24     8 */
	char *                     _IO_write_base;       /*    32     8 */
	char *                     _IO_write_ptr;        /*    40     8 */
	char *                     _IO_write_end;        /*    48     8 */
	char *                     _IO_buf_base;         /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	char *                     _IO_buf_end;          /*    64     8 */
	char *                     _IO_save_base;        /*    72     8 */
	char *                     _IO_backup_base;      /*    80     8 */
	char *                     _IO_save_end;         /*    88     8 */
	struct _IO_marker *        _markers;             /*    96     8 */
	struct _IO_FILE *          _chain;               /*   104     8 */
	int                        _fileno;              /*   112     4 */
	int                        _flags2;              /*   116     4 */
	__off_t                    _old_offset;          /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	short unsigned int         _cur_column;          /*   128     2 */
	signed char                _vtable_offset;       /*   130     1 */
	char                       _shortbuf[1];         /*   131     1 */

	/* XXX 4 bytes hole, try to pack */

	_IO_lock_t *               _lock;                /*   136     8 */
	__off64_t                  _offset;              /*   144     8 */
	void *                     __pad1;               /*   152     8 */
	void *                     __pad2;               /*   160     8 */
	void *                     __pad3;               /*   168     8 */
	void *                     __pad4;               /*   176     8 */
	size_t                     __pad5;               /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	int                        _mode;                /*   192     4 */
	char                       _unused2[20];         /*   196    20 */

	/* size: 216, cachelines: 4, members: 29 */
	/* sum members: 208, holes: 2, sum holes: 8 */
	/* last cacheline: 24 bytes */
};
struct _IO_marker {
	struct _IO_marker *        _next;                /*     0     8 */
	struct _IO_FILE *          _sbuf;                /*     8     8 */
	int                        _pos;                 /*    16     4 */

	/* size: 24, cachelines: 1, members: 3 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct __jmp_buf_tag {
	__jmp_buf                  __jmpbuf;             /*     0    64 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	int                        __mask_was_saved;     /*    64     4 */

	/* XXX 4 bytes hole, try to pack */

	__sigset_t                 __saved_mask;         /*    72   128 */

	/* size: 200, cachelines: 4, members: 3 */
	/* sum members: 196, holes: 1, sum holes: 4 */
	/* last cacheline: 8 bytes */
};
struct _GSList {
	gpointer                   data;                 /*     0     8 */
	GSList *                   next;                 /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct AddressSpace {
	struct rcu_head            rcu;                  /*     0    16 */
	char *                     name;                 /*    16     8 */
	MemoryRegion *             root;                 /*    24     8 */
	int                        ref_count;            /*    32     4 */
	_Bool                      malloced;             /*    36     1 */

	/* XXX 3 bytes hole, try to pack */

	struct FlatView *          current_map;          /*    40     8 */
	int                        ioeventfd_nb;         /*    48     4 */

	/* XXX 4 bytes hole, try to pack */

	struct MemoryRegionIoeventfd * ioeventfds;       /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	struct AddressSpaceDispatch * dispatch;          /*    64     8 */
	struct AddressSpaceDispatch * next_dispatch;     /*    72     8 */
	MemoryListener             dispatch_listener;    /*    80   160 */
	/* --- cacheline 3 boundary (192 bytes) was 48 bytes ago --- */
	struct memory_listeners_as listeners;            /*   240    16 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	struct {
		struct AddressSpace * tqe_next;          /*   256     8 */
		struct AddressSpace * * tqe_prev;        /*   264     8 */
	} address_spaces_link;                           /*   256    16 */

	/* size: 272, cachelines: 5, members: 13 */
	/* sum members: 265, holes: 2, sum holes: 7 */
	/* last cacheline: 16 bytes */
};
struct BusState {
	Object                     obj;                  /*     0    40 */
	DeviceState *              parent;               /*    40     8 */
	char *                     name;                 /*    48     8 */
	HotplugHandler *           hotplug_handler;      /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	int                        max_index;            /*    64     4 */
	_Bool                      realized;             /*    68     1 */

	/* XXX 3 bytes hole, try to pack */

	struct ChildrenHead        children;             /*    72    16 */
	struct {
		struct BusState *  le_next;              /*    88     8 */
		struct BusState * * le_prev;             /*    96     8 */
	} sibling;                                       /*    88    16 */

	/* size: 104, cachelines: 2, members: 8 */
	/* sum members: 101, holes: 1, sum holes: 3 */
	/* last cacheline: 40 bytes */
};
struct CPUAddressSpace {
	CPUState *                 cpu;                  /*     0     8 */
	AddressSpace *             as;                   /*     8     8 */
	struct AddressSpaceDispatch * memory_dispatch;   /*    16     8 */
	MemoryListener             tcg_as_listener;      /*    24   160 */

	/* size: 184, cachelines: 3, members: 4 */
	/* last cacheline: 56 bytes */
};
struct CPUState {
	DeviceState                parent_obj;           /*     0   112 */
	/* --- cacheline 1 boundary (64 bytes) was 48 bytes ago --- */
	int                        nr_cores;             /*   112     4 */
	int                        nr_threads;           /*   116     4 */
	int                        numa_node;            /*   120     4 */

	/* XXX 4 bytes hole, try to pack */

	/* --- cacheline 2 boundary (128 bytes) --- */
	struct QemuThread *        thread;               /*   128     8 */
	int                        thread_id;            /*   136     4 */
	uint32_t                   host_tid;             /*   140     4 */
	_Bool                      running;              /*   144     1 */
	_Bool                      has_waiter;           /*   145     1 */

	/* XXX 6 bytes hole, try to pack */

	struct QemuCond *          halt_cond;            /*   152     8 */
	_Bool                      thread_kicked;        /*   160     1 */
	_Bool                      created;              /*   161     1 */
	_Bool                      stop;                 /*   162     1 */
	_Bool                      stopped;              /*   163     1 */
	_Bool                      unplug;               /*   164     1 */
	_Bool                      crash_occurred;       /*   165     1 */
	_Bool                      exit_request;         /*   166     1 */

	/* XXX 1 byte hole, try to pack */

	uint32_t                   interrupt_request;    /*   168     4 */
	int                        singlestep_enabled;   /*   172     4 */
	int64_t                    icount_extra;         /*   176     8 */
	sigjmp_buf                 jmp_env;              /*   184   200 */
	/* --- cacheline 6 boundary (384 bytes) --- */
	QemuMutex                  work_mutex;           /*   384    40 */
	struct qemu_work_item *    queued_work_first;    /*   424     8 */
	struct qemu_work_item *    queued_work_last;     /*   432     8 */
	CPUAddressSpace *          cpu_ases;             /*   440     8 */
	/* --- cacheline 7 boundary (448 bytes) --- */
	int                        num_ases;             /*   448     4 */

	/* XXX 4 bytes hole, try to pack */

	AddressSpace *             as;                   /*   456     8 */
	MemoryRegion *             memory;               /*   464     8 */
	void *                     env_ptr;              /*   472     8 */
	struct TranslationBlock *  tb_jmp_cache[4096];   /*   480 32768 */
	/* --- cacheline 519 boundary (33216 bytes) was 32 bytes ago --- */
	struct GDBRegisterState *  gdb_regs;             /* 33248     8 */
	int                        gdb_num_regs;         /* 33256     4 */
	int                        gdb_num_g_regs;       /* 33260     4 */
	struct {
		struct CPUState *  tqe_next;             /* 33264     8 */
		struct CPUState * * tqe_prev;            /* 33272     8 */
	} node;                                          /* 33264    16 */
	/* --- cacheline 520 boundary (33280 bytes) --- */
	struct breakpoints_head    breakpoints;          /* 33280    16 */
	struct watchpoints_head    watchpoints;          /* 33296    16 */
	CPUWatchpoint *            watchpoint_hit;       /* 33312     8 */
	void *                     opaque;               /* 33320     8 */
	uintptr_t                  mem_io_pc;            /* 33328     8 */
	vaddr                      mem_io_vaddr;         /* 33336     8 */
	/* --- cacheline 521 boundary (33344 bytes) --- */
	int                        kvm_fd;               /* 33344     4 */
	_Bool                      kvm_vcpu_dirty;       /* 33348     1 */

	/* XXX 3 bytes hole, try to pack */

	struct KVMState *          kvm_state;            /* 33352     8 */
	struct kvm_run *           kvm_run;              /* 33360     8 */
	long unsigned int *        trace_dstate;         /* 33368     8 */
	int                        cpu_index;            /* 33376     4 */
	uint32_t                   halted;               /* 33380     4 */
	union {
		uint32_t           u32;                  /* 33384     4 */
		icount_decr_u16    u16;                  /* 33384     4 */
	} icount_decr;                                   /* 33384     4 */
	uint32_t                   can_do_io;            /* 33388     4 */
	int32_t                    exception_index;      /* 33392     4 */
	_Bool                      throttle_thread_scheduled; /* 33396     1 */

	/* XXX 3 bytes hole, try to pack */

	uint32_t                   tcg_exit_req;         /* 33400     4 */

	/* size: 33408, cachelines: 522, members: 52 */
	/* sum members: 33383, holes: 6, sum holes: 21 */
	/* padding: 4 */
};
struct DeviceState {
	Object                     parent_obj;           /*     0    40 */
	const char  *              id;                   /*    40     8 */
	_Bool                      realized;             /*    48     1 */
	_Bool                      pending_deleted_event; /*    49     1 */

	/* XXX 6 bytes hole, try to pack */

	QemuOpts *                 opts;                 /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	int                        hotplugged;           /*    64     4 */

	/* XXX 4 bytes hole, try to pack */

	BusState *                 parent_bus;           /*    72     8 */
	struct {
		struct NamedGPIOList * lh_first;         /*    80     8 */
	} gpios;                                         /*    80     8 */
	struct {
		struct BusState *  lh_first;             /*    88     8 */
	} child_bus;                                     /*    88     8 */
	int                        num_child_bus;        /*    96     4 */
	int                        instance_id_alias;    /*   100     4 */
	int                        alias_required_for_version; /*   104     4 */

	/* size: 112, cachelines: 2, members: 12 */
	/* sum members: 98, holes: 2, sum holes: 10 */
	/* padding: 4 */
	/* last cacheline: 48 bytes */
};
struct EventNotifier {
	int                        rfd;                  /*     0     4 */
	int                        wfd;                  /*     4     4 */

	/* size: 8, cachelines: 1, members: 2 */
	/* last cacheline: 8 bytes */
};
struct MachineState {
	Object                     parent_obj;           /*     0    40 */
	Notifier                   sysbus_notifier;      /*    40    24 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	char *                     accel;                /*    64     8 */
	_Bool                      kernel_irqchip_allowed; /*    72     1 */
	_Bool                      kernel_irqchip_required; /*    73     1 */
	_Bool                      kernel_irqchip_split; /*    74     1 */

	/* XXX 1 byte hole, try to pack */

	int                        kvm_shadow_mem;       /*    76     4 */
	char *                     dtb;                  /*    80     8 */
	char *                     dumpdtb;              /*    88     8 */
	int                        phandle_start;        /*    96     4 */

	/* XXX 4 bytes hole, try to pack */

	char *                     dt_compatible;        /*   104     8 */
	_Bool                      dump_guest_core;      /*   112     1 */
	_Bool                      mem_merge;            /*   113     1 */
	_Bool                      usb;                  /*   114     1 */
	_Bool                      usb_disabled;         /*   115     1 */
	_Bool                      igd_gfx_passthru;     /*   116     1 */

	/* XXX 3 bytes hole, try to pack */

	char *                     firmware;             /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	_Bool                      iommu;                /*   128     1 */
	_Bool                      suppress_vmdesc;      /*   129     1 */
	_Bool                      enforce_config_section; /*   130     1 */
	_Bool                      enable_graphics;      /*   131     1 */

	/* XXX 4 bytes hole, try to pack */

	ram_addr_t                 ram_size;             /*   136     8 */
	ram_addr_t                 maxram_size;          /*   144     8 */
	uint64_t                   ram_slots;            /*   152     8 */
	const char  *              boot_order;           /*   160     8 */
	char *                     kernel_filename;      /*   168     8 */
	char *                     kernel_cmdline;       /*   176     8 */
	char *                     initrd_filename;      /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	const char  *              cpu_model;            /*   192     8 */
	AccelState *               accelerator;          /*   200     8 */

	/* size: 208, cachelines: 4, members: 30 */
	/* sum members: 196, holes: 4, sum holes: 12 */
	/* last cacheline: 16 bytes */
};
struct MemoryListener {
	void                       (*begin)(MemoryListener *); /*     0     8 */
	void                       (*commit)(MemoryListener *); /*     8     8 */
	void                       (*region_add)(MemoryListener *, MemoryRegionSection *); /*    16     8 */
	void                       (*region_del)(MemoryListener *, MemoryRegionSection *); /*    24     8 */
	void                       (*region_nop)(MemoryListener *, MemoryRegionSection *); /*    32     8 */
	void                       (*log_start)(MemoryListener *, MemoryRegionSection *, int, int); /*    40     8 */
	void                       (*log_stop)(MemoryListener *, MemoryRegionSection *, int, int); /*    48     8 */
	void                       (*log_sync)(MemoryListener *, MemoryRegionSection *); /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	void                       (*log_global_start)(MemoryListener *); /*    64     8 */
	void                       (*log_global_stop)(MemoryListener *); /*    72     8 */
	void                       (*eventfd_add)(MemoryListener *, MemoryRegionSection *, _Bool, uint64_t, EventNotifier *); /*    80     8 */
	void                       (*eventfd_del)(MemoryListener *, MemoryRegionSection *, _Bool, uint64_t, EventNotifier *); /*    88     8 */
	void                       (*coalesced_mmio_add)(MemoryListener *, MemoryRegionSection *, hwaddr, hwaddr); /*    96     8 */
	void                       (*coalesced_mmio_del)(MemoryListener *, MemoryRegionSection *, hwaddr, hwaddr); /*   104     8 */
	unsigned int               priority;             /*   112     4 */

	/* XXX 4 bytes hole, try to pack */

	AddressSpace *             address_space;        /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	struct {
		struct MemoryListener * tqe_next;        /*   128     8 */
		struct MemoryListener * * tqe_prev;      /*   136     8 */
	} link;                                          /*   128    16 */
	struct {
		struct MemoryListener * tqe_next;        /*   144     8 */
		struct MemoryListener * * tqe_prev;      /*   152     8 */
	} link_as;                                       /*   144    16 */

	/* size: 160, cachelines: 3, members: 18 */
	/* sum members: 156, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct MemoryRegion {
	Object                     parent_obj;           /*     0    40 */
	_Bool                      romd_mode;            /*    40     1 */
	_Bool                      ram;                  /*    41     1 */
	_Bool                      subpage;              /*    42     1 */
	_Bool                      readonly;             /*    43     1 */
	_Bool                      rom_device;           /*    44     1 */
	_Bool                      flush_coalesced_mmio; /*    45     1 */
	_Bool                      global_locking;       /*    46     1 */
	uint8_t                    dirty_log_mask;       /*    47     1 */
	RAMBlock *                 ram_block;            /*    48     8 */
	Object *                   owner;                /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	const MemoryRegionIOMMUOps  * iommu_ops;         /*    64     8 */
	const MemoryRegionOps  *   ops;                  /*    72     8 */
	void *                     opaque;               /*    80     8 */
	MemoryRegion *             container;            /*    88     8 */
	Int128                     size;                 /*    96    16 */
	hwaddr                     addr;                 /*   112     8 */
	void                       (*destructor)(MemoryRegion *); /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	uint64_t                   align;                /*   128     8 */
	_Bool                      terminates;           /*   136     1 */
	_Bool                      ram_device;           /*   137     1 */
	_Bool                      enabled;              /*   138     1 */
	_Bool                      warning_printed;      /*   139     1 */
	uint8_t                    vga_logging_count;    /*   140     1 */

	/* XXX 3 bytes hole, try to pack */

	MemoryRegion *             alias;                /*   144     8 */
	hwaddr                     alias_offset;         /*   152     8 */
	int32_t                    priority;             /*   160     4 */

	/* XXX 4 bytes hole, try to pack */

	struct subregions          subregions;           /*   168    16 */
	struct {
		struct MemoryRegion * tqe_next;          /*   184     8 */
		/* --- cacheline 3 boundary (192 bytes) --- */
		struct MemoryRegion * * tqe_prev;        /*   192     8 */
	} subregions_link;                               /*   184    16 */
	struct coalesced_ranges    coalesced;            /*   200    16 */
	const char  *              name;                 /*   216     8 */
	unsigned int               ioeventfd_nb;         /*   224     4 */

	/* XXX 4 bytes hole, try to pack */

	MemoryRegionIoeventfd *    ioeventfds;           /*   232     8 */
	struct {
		struct IOMMUNotifier * lh_first;         /*   240     8 */
	} iommu_notify;                                  /*   240     8 */
	IOMMUNotifierFlag          iommu_notify_flags;   /*   248     4 */

	/* size: 256, cachelines: 4, members: 35 */
	/* sum members: 241, holes: 3, sum holes: 11 */
	/* padding: 4 */
};
struct MemoryRegionSection {
	MemoryRegion *             mr;                   /*     0     8 */
	AddressSpace *             address_space;        /*     8     8 */
	hwaddr                     offset_within_region; /*    16     8 */

	/* XXX 8 bytes hole, try to pack */

	Int128                     size;                 /*    32    16 */
	hwaddr                     offset_within_address_space; /*    48     8 */
	_Bool                      readonly;             /*    56     1 */

	/* size: 64, cachelines: 1, members: 6 */
	/* sum members: 49, holes: 1, sum holes: 8 */
	/* padding: 7 */
};
struct Property {
	const char  *              name;                 /*     0     8 */
	PropertyInfo *             info;                 /*     8     8 */
	ptrdiff_t                  offset;               /*    16     8 */
	uint8_t                    bitnr;                /*    24     1 */

	/* XXX 3 bytes hole, try to pack */

	QType                      qtype;                /*    28     4 */
	int64_t                    defval;               /*    32     8 */
	int                        arrayoffset;          /*    40     4 */

	/* XXX 4 bytes hole, try to pack */

	PropertyInfo *             arrayinfo;            /*    48     8 */
	int                        arrayfieldsize;       /*    56     4 */

	/* size: 64, cachelines: 1, members: 9 */
	/* sum members: 53, holes: 2, sum holes: 7 */
	/* padding: 4 */
};
struct PropertyInfo {
	const char  *              name;                 /*     0     8 */
	const char  *              description;          /*     8     8 */
	const char  * const *      enum_table;           /*    16     8 */
	int                        (*print)(DeviceState *, Property *, char *, size_t); /*    24     8 */
	ObjectPropertyAccessor *   get;                  /*    32     8 */
	ObjectPropertyAccessor *   set;                  /*    40     8 */
	ObjectPropertyRelease *    release;              /*    48     8 */

	/* size: 56, cachelines: 1, members: 7 */
	/* last cacheline: 56 bytes */
};
struct QEMUTimerListGroup {
	QEMUTimerList *            tl[4];                /*     0    32 */

	/* size: 32, cachelines: 1, members: 1 */
	/* last cacheline: 32 bytes */
};
struct QObject {
	QType                      type;                 /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	size_t                     refcnt;               /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* sum members: 12, holes: 1, sum holes: 4 */
	/* last cacheline: 16 bytes */
};
struct RAMBlock {
	struct rcu_head            rcu;                  /*     0    16 */
	struct MemoryRegion *      mr;                   /*    16     8 */
	uint8_t *                  host;                 /*    24     8 */
	ram_addr_t                 offset;               /*    32     8 */
	ram_addr_t                 used_length;          /*    40     8 */
	ram_addr_t                 max_length;           /*    48     8 */
	void                       (*resized)(const char  *, uint64_t, void *); /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	uint32_t                   flags;                /*    64     4 */
	char                       idstr[256];           /*    68   256 */

	/* XXX 4 bytes hole, try to pack */

	/* --- cacheline 5 boundary (320 bytes) was 8 bytes ago --- */
	struct {
		struct RAMBlock *  le_next;              /*   328     8 */
		struct RAMBlock * * le_prev;             /*   336     8 */
	} next;                                          /*   328    16 */
	int                        fd;                   /*   344     4 */

	/* XXX 4 bytes hole, try to pack */

	size_t                     page_size;            /*   352     8 */

	/* size: 360, cachelines: 6, members: 12 */
	/* sum members: 352, holes: 2, sum holes: 8 */
	/* last cacheline: 40 bytes */
};
struct float_status {
	signed char                float_detect_tininess; /*     0     1 */
	signed char                float_rounding_mode;  /*     1     1 */
	uint8_t                    float_exception_flags; /*     2     1 */
	signed char                floatx80_rounding_precision; /*     3     1 */
	flag                       flush_to_zero;        /*     4     1 */
	flag                       flush_inputs_to_zero; /*     5     1 */
	flag                       default_nan_mode;     /*     6     1 */
	flag                       snan_bit_is_one;      /*     7     1 */

	/* size: 8, cachelines: 1, members: 8 */
	/* last cacheline: 8 bytes */
};
struct ObjectClass {
	Type                       type;                 /*     0     8 */
	GSList *                   interfaces;           /*     8     8 */
	const char  *              object_cast_cache[4]; /*    16    32 */
	const char  *              class_cast_cache[4];  /*    48    32 */
	/* --- cacheline 1 boundary (64 bytes) was 16 bytes ago --- */
	ObjectUnparent *           unparent;             /*    80     8 */
	GHashTable *               properties;           /*    88     8 */

	/* size: 96, cachelines: 2, members: 6 */
	/* last cacheline: 32 bytes */
};
struct Object {
	ObjectClass *              class;                /*     0     8 */
	ObjectFree *               free;                 /*     8     8 */
	GHashTable *               properties;           /*    16     8 */
	uint32_t                   ref;                  /*    24     4 */

	/* XXX 4 bytes hole, try to pack */

	Object *                   parent;               /*    32     8 */

	/* size: 40, cachelines: 1, members: 5 */
	/* sum members: 36, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct HotplugHandler {
	Object                     Parent;               /*     0    40 */

	/* size: 40, cachelines: 1, members: 1 */
	/* last cacheline: 40 bytes */
};
struct DeviceClass {
	ObjectClass                parent_class;         /*     0    96 */
	/* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */
	long unsigned int          categories[1];        /*    96     8 */
	const char  *              fw_name;              /*   104     8 */
	const char  *              desc;                 /*   112     8 */
	Property *                 props;                /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	_Bool                      cannot_instantiate_with_device_add_yet; /*   128     1 */
	_Bool                      cannot_destroy_with_object_finalize_yet; /*   129     1 */
	_Bool                      hotpluggable;         /*   130     1 */

	/* XXX 5 bytes hole, try to pack */

	void                       (*reset)(DeviceState *); /*   136     8 */
	DeviceRealize              realize;              /*   144     8 */
	DeviceUnrealize            unrealize;            /*   152     8 */
	const struct VMStateDescription  * vmsd;         /*   160     8 */
	qdev_initfn                init;                 /*   168     8 */
	qdev_event                 exit;                 /*   176     8 */
	const char  *              bus_type;             /*   184     8 */

	/* size: 192, cachelines: 3, members: 15 */
	/* sum members: 187, holes: 1, sum holes: 5 */
};
struct VMStateDescription {
	const char  *              name;                 /*     0     8 */
	int                        unmigratable;         /*     8     4 */
	int                        version_id;           /*    12     4 */
	int                        minimum_version_id;   /*    16     4 */
	int                        minimum_version_id_old; /*    20     4 */
	LoadStateHandler *         load_state_old;       /*    24     8 */
	int                        (*pre_load)(void *);  /*    32     8 */
	int                        (*post_load)(void *, int); /*    40     8 */
	void                       (*pre_save)(void *);  /*    48     8 */
	_Bool                      (*needed)(void *);    /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	VMStateField *             fields;               /*    64     8 */
	const VMStateDescription  * * subsections;       /*    72     8 */

	/* size: 80, cachelines: 2, members: 12 */
	/* last cacheline: 16 bytes */
};
struct NamedGPIOList {
	char *                     name;                 /*     0     8 */
	qemu_irq *                 in;                   /*     8     8 */
	int                        num_in;               /*    16     4 */
	int                        num_out;              /*    20     4 */
	struct {
		struct NamedGPIOList * le_next;          /*    24     8 */
		struct NamedGPIOList * * le_prev;        /*    32     8 */
	} node;                                          /*    24    16 */

	/* size: 40, cachelines: 1, members: 5 */
	/* last cacheline: 40 bytes */
};
struct BusChild {
	DeviceState *              child;                /*     0     8 */
	int                        index;                /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		struct BusChild *  tqe_next;             /*    16     8 */
		struct BusChild * * tqe_prev;            /*    24     8 */
	} sibling;                                       /*    16    16 */

	/* size: 32, cachelines: 1, members: 3 */
	/* sum members: 28, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct ChildrenHead {
	struct BusChild *          tqh_first;            /*     0     8 */
	struct BusChild * *        tqh_last;             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct symbol_cache_entry {
	const char  *              name;                 /*     0     8 */
	union {
		PTR                p;                    /*     8     8 */
		bfd_vma            i;                    /*     8     8 */
	} udata;                                         /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct disassemble_info {
	fprintf_function           fprintf_func;         /*     0     8 */
	FILE *                     stream;               /*     8     8 */
	PTR                        application_data;     /*    16     8 */
	enum bfd_flavour           flavour;              /*    24     4 */
	enum bfd_architecture      arch;                 /*    28     4 */
	long unsigned int          mach;                 /*    32     8 */
	enum bfd_endian            endian;               /*    40     4 */

	/* XXX 4 bytes hole, try to pack */

	asymbol * *                symbols;              /*    48     8 */
	int                        num_symbols;          /*    56     4 */

	/* XXX 4 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) --- */
	long unsigned int          flags;                /*    64     8 */
	PTR                        private_data;         /*    72     8 */
	int                        (*read_memory_func)(bfd_vma, bfd_byte *, int, struct disassemble_info *); /*    80     8 */
	void                       (*memory_error_func)(int, bfd_vma, struct disassemble_info *); /*    88     8 */
	void                       (*print_address_func)(bfd_vma, struct disassemble_info *); /*    96     8 */
	int                        (*print_insn)(bfd_vma, struct disassemble_info *); /*   104     8 */
	int                        (*symbol_at_address_func)(bfd_vma, struct disassemble_info *); /*   112     8 */
	bfd_byte *                 buffer;               /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	bfd_vma                    buffer_vma;           /*   128     8 */
	int                        buffer_length;        /*   136     4 */
	int                        bytes_per_line;       /*   140     4 */
	int                        bytes_per_chunk;      /*   144     4 */
	enum bfd_endian            display_endian;       /*   148     4 */
	char                       insn_info_valid;      /*   152     1 */
	char                       branch_delay_insns;   /*   153     1 */
	char                       data_size;            /*   154     1 */

	/* XXX 1 byte hole, try to pack */

	enum dis_insn_type         insn_type;            /*   156     4 */
	bfd_vma                    target;               /*   160     8 */
	bfd_vma                    target2;              /*   168     8 */
	char *                     disassembler_options; /*   176     8 */

	/* size: 184, cachelines: 3, members: 29 */
	/* sum members: 175, holes: 3, sum holes: 9 */
	/* last cacheline: 56 bytes */
};
struct MemTxAttrs {
	unsigned int               unspecified:1;        /*     0: 0  4 */
	unsigned int               secure:1;             /*     0: 1  4 */
	unsigned int               user:1;               /*     0: 2  4 */
	unsigned int               requester_id:16;      /*     0: 3  4 */

	/* size: 4, cachelines: 1, members: 4 */
	/* bit_padding: 13 bits */
	/* last cacheline: 4 bytes */
};
struct QemuMutex {
	pthread_mutex_t            lock;                 /*     0    40 */

	/* size: 40, cachelines: 1, members: 1 */
	/* last cacheline: 40 bytes */
};
struct QemuCond {
	pthread_cond_t             cond;                 /*     0    48 */

	/* size: 48, cachelines: 1, members: 1 */
	/* last cacheline: 48 bytes */
};
struct QemuEvent {
	unsigned int               value;                /*     0     4 */

	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
struct QemuThread {
	pthread_t                  thread;               /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct CPUWatchpoint {
	vaddr                      vaddr;                /*     0     8 */
	vaddr                      len;                  /*     8     8 */
	vaddr                      hitaddr;              /*    16     8 */
	MemTxAttrs                 hitattrs;             /*    24     4 */
	int                        flags;                /*    28     4 */
	struct {
		struct CPUWatchpoint * tqe_next;         /*    32     8 */
		struct CPUWatchpoint * * tqe_prev;       /*    40     8 */
	} entry;                                         /*    32    16 */

	/* size: 48, cachelines: 1, members: 6 */
	/* last cacheline: 48 bytes */
};
struct CPUClass {
	DeviceClass                parent_class;         /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	ObjectClass *              (*class_by_name)(const char  *); /*   192     8 */
	void                       (*parse_features)(const char  *, char *, Error * *); /*   200     8 */
	void                       (*reset)(CPUState *); /*   208     8 */
	int                        reset_dump_flags;     /*   216     4 */

	/* XXX 4 bytes hole, try to pack */

	_Bool                      (*has_work)(CPUState *); /*   224     8 */
	void                       (*do_interrupt)(CPUState *); /*   232     8 */
	CPUUnassignedAccess        do_unassigned_access; /*   240     8 */
	void                       (*do_unaligned_access)(CPUState *, vaddr, MMUAccessType, int, uintptr_t); /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	_Bool                      (*virtio_is_big_endian)(CPUState *); /*   256     8 */
	int                        (*memory_rw_debug)(CPUState *, vaddr, uint8_t *, int, _Bool); /*   264     8 */
	void                       (*dump_state)(CPUState *, FILE *, fprintf_function, int); /*   272     8 */
	void                       (*dump_statistics)(CPUState *, FILE *, fprintf_function, int); /*   280     8 */
	int64_t                    (*get_arch_id)(CPUState *); /*   288     8 */
	_Bool                      (*get_paging_enabled)(const CPUState  *); /*   296     8 */
	void                       (*get_memory_mapping)(CPUState *, MemoryMappingList *, Error * *); /*   304     8 */
	void                       (*set_pc)(CPUState *, vaddr); /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	void                       (*synchronize_from_tb)(CPUState *, struct TranslationBlock *); /*   320     8 */
	int                        (*handle_mmu_fault)(CPUState *, vaddr, int, int); /*   328     8 */
	hwaddr                     (*get_phys_page_debug)(CPUState *, vaddr); /*   336     8 */
	hwaddr                     (*get_phys_page_attrs_debug)(CPUState *, vaddr, MemTxAttrs *); /*   344     8 */
	int                        (*asidx_from_attrs)(CPUState *, MemTxAttrs); /*   352     8 */
	int                        (*gdb_read_register)(CPUState *, uint8_t *, int); /*   360     8 */
	int                        (*gdb_write_register)(CPUState *, uint8_t *, int); /*   368     8 */
	_Bool                      (*debug_check_watchpoint)(CPUState *, CPUWatchpoint *); /*   376     8 */
	/* --- cacheline 6 boundary (384 bytes) --- */
	void                       (*debug_excp_handler)(CPUState *); /*   384     8 */
	int                        (*write_elf64_note)(WriteCoreDumpFunction, CPUState *, int, void *); /*   392     8 */
	int                        (*write_elf64_qemunote)(WriteCoreDumpFunction, CPUState *, void *); /*   400     8 */
	int                        (*write_elf32_note)(WriteCoreDumpFunction, CPUState *, int, void *); /*   408     8 */
	int                        (*write_elf32_qemunote)(WriteCoreDumpFunction, CPUState *, void *); /*   416     8 */
	const struct VMStateDescription  * vmsd;         /*   424     8 */
	int                        gdb_num_core_regs;    /*   432     4 */

	/* XXX 4 bytes hole, try to pack */

	const char  *              gdb_core_xml_file;    /*   440     8 */
	/* --- cacheline 7 boundary (448 bytes) --- */
	gchar *                    (*gdb_arch_name)(CPUState *); /*   448     8 */
	_Bool                      gdb_stop_before_watchpoint; /*   456     1 */

	/* XXX 7 bytes hole, try to pack */

	void                       (*cpu_exec_enter)(CPUState *); /*   464     8 */
	void                       (*cpu_exec_exit)(CPUState *); /*   472     8 */
	_Bool                      (*cpu_exec_interrupt)(CPUState *, int); /*   480     8 */
	void                       (*disas_set_info)(CPUState *, disassemble_info *); /*   488     8 */

	/* size: 496, cachelines: 8, members: 39 */
	/* sum members: 481, holes: 3, sum holes: 15 */
	/* last cacheline: 48 bytes */
};
struct TranslationBlock {
	target_ulong               pc;                   /*     0     8 */
	target_ulong               cs_base;              /*     8     8 */
	uint32_t                   flags;                /*    16     4 */
	uint16_t                   size;                 /*    20     2 */
	uint16_t                   icount;               /*    22     2 */
	uint32_t                   cflags;               /*    24     4 */
	uint16_t                   invalid;              /*    28     2 */

	/* XXX 2 bytes hole, try to pack */

	void *                     tc_ptr;               /*    32     8 */
	uint8_t *                  tc_search;            /*    40     8 */
	struct TranslationBlock *  orig_tb;              /*    48     8 */
	struct TranslationBlock *  page_next[2];         /*    56    16 */
	/* --- cacheline 1 boundary (64 bytes) was 8 bytes ago --- */
	tb_page_addr_t             page_addr[2];         /*    72    16 */
	uint16_t                   jmp_reset_offset[2];  /*    88     4 */
	uint16_t                   jmp_insn_offset[2];   /*    92     4 */
	uintptr_t                  jmp_list_next[2];     /*    96    16 */
	uintptr_t                  jmp_list_first;       /*   112     8 */

	/* size: 120, cachelines: 2, members: 16 */
	/* sum members: 118, holes: 1, sum holes: 2 */
	/* last cacheline: 56 bytes */
};
struct icount_decr_u16 {
	uint16_t                   low;                  /*     0     2 */
	uint16_t                   high;                 /*     2     2 */

	/* size: 4, cachelines: 1, members: 2 */
	/* last cacheline: 4 bytes */
};
struct CPUBreakpoint {
	vaddr                      pc;                   /*     0     8 */
	int                        flags;                /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		struct CPUBreakpoint * tqe_next;         /*    16     8 */
		struct CPUBreakpoint * * tqe_prev;       /*    24     8 */
	} entry;                                         /*    16    16 */

	/* size: 32, cachelines: 1, members: 3 */
	/* sum members: 28, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct breakpoints_head {
	struct CPUBreakpoint *     tqh_first;            /*     0     8 */
	struct CPUBreakpoint * *   tqh_last;             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct watchpoints_head {
	struct CPUWatchpoint *     tqh_first;            /*     0     8 */
	struct CPUWatchpoint * *   tqh_last;             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct kvm_run {
	__u8                       request_interrupt_window; /*     0     1 */
	__u8                       padding1[7];          /*     1     7 */
	__u32                      exit_reason;          /*     8     4 */
	__u8                       ready_for_interrupt_injection; /*    12     1 */
	__u8                       if_flag;              /*    13     1 */
	__u16                      flags;                /*    14     2 */
	__u64                      cr8;                  /*    16     8 */
	__u64                      apic_base;            /*    24     8 */
	union {
		struct {
			__u64      hardware_exit_reason; /*    32     8 */
		} hw;                                    /*    32     8 */
		struct {
			__u64      hardware_entry_failure_reason; /*    32     8 */
		} fail_entry;                            /*    32     8 */
		struct {
			__u32      exception;            /*    32     4 */
			__u32      error_code;           /*    36     4 */
		} ex;                                    /*    32     8 */
		struct {
			__u8       direction;            /*    32     1 */
			__u8       size;                 /*    33     1 */
			__u16      port;                 /*    34     2 */
			__u32      count;                /*    36     4 */
			__u64      data_offset;          /*    40     8 */
		} io;                                    /*    32    16 */
		struct {
			struct kvm_debug_exit_arch arch; /*    32    32 */
		} debug;                                 /*    32    32 */
		struct {
			__u64      phys_addr;            /*    32     8 */
			__u8       data[8];              /*    40     8 */
			__u32      len;                  /*    48     4 */
			__u8       is_write;             /*    52     1 */
		} mmio;                                  /*    32    24 */
		struct {
			__u64      nr;                   /*    32     8 */
			__u64      args[6];              /*    40    48 */
			/* --- cacheline 1 boundary (64 bytes) was 24 bytes ago --- */
			__u64      ret;                  /*    88     8 */
			__u32      longmode;             /*    96     4 */
			__u32      pad;                  /*   100     4 */
		} hypercall;                             /*    32    72 */
		struct {
			__u64      rip;                  /*    32     8 */
			__u32      is_write;             /*    40     4 */
			__u32      pad;                  /*    44     4 */
		} tpr_access;                            /*    32    16 */
		struct {
			__u8       icptcode;             /*    32     1 */

			/* XXX 1 byte hole, try to pack */

			__u16      ipa;                  /*    34     2 */
			__u32      ipb;                  /*    36     4 */
		} s390_sieic;                            /*    32     8 */
		__u64              s390_reset_flags;     /*    32     8 */
		struct {
			__u64      trans_exc_code;       /*    32     8 */
			__u32      pgm_code;             /*    40     4 */
		} s390_ucontrol;                         /*    32    16 */
		struct {
			__u32      dcrn;                 /*    32     4 */
			__u32      data;                 /*    36     4 */
			__u8       is_write;             /*    40     1 */
		} dcr;                                   /*    32    12 */
		struct {
			__u32      suberror;             /*    32     4 */
			__u32      ndata;                /*    36     4 */
			__u64      data[16];             /*    40   128 */
		} internal;                              /*    32   136 */
		struct {
			__u64      gprs[32];             /*    32   256 */
		} osi;                                   /*    32   256 */
		struct {
			__u64      nr;                   /*    32     8 */
			__u64      ret;                  /*    40     8 */
			__u64      args[9];              /*    48    72 */
		} papr_hcall;                            /*    32    88 */
		struct {
			__u16      subchannel_id;        /*    32     2 */
			__u16      subchannel_nr;        /*    34     2 */
			__u32      io_int_parm;          /*    36     4 */
			__u32      io_int_word;          /*    40     4 */
			__u32      ipb;                  /*    44     4 */
			__u8       dequeued;             /*    48     1 */
		} s390_tsch;                             /*    32    20 */
		struct {
			__u32      epr;                  /*    32     4 */
		} epr;                                   /*    32     4 */
		struct {
			__u32      type;                 /*    32     4 */

			/* XXX 4 bytes hole, try to pack */

			__u64      flags;                /*    40     8 */
		} system_event;                          /*    32    16 */
		struct {
			__u64      addr;                 /*    32     8 */
			__u8       ar;                   /*    40     1 */
			__u8       reserved;             /*    41     1 */
			__u8       fc;                   /*    42     1 */
			__u8       sel1;                 /*    43     1 */
			__u16      sel2;                 /*    44     2 */
		} s390_stsi;                             /*    32    16 */
		struct {
			__u8       vector;               /*    32     1 */
		} eoi;                                   /*    32     1 */
		struct kvm_hyperv_exit hyperv;           /*    32    40 */
		char               padding[256];         /*    32   256 */
	};                                               /*    32   256 */
	/* --- cacheline 4 boundary (256 bytes) was 32 bytes ago --- */
	__u64                      kvm_valid_regs;       /*   288     8 */
	__u64                      kvm_dirty_regs;       /*   296     8 */
	union {
		struct kvm_sync_regs regs;               /*   304     0 */
		char               padding[2048];        /*   304  2048 */
	} s;                                             /*   304  2048 */

	/* size: 2352, cachelines: 37, members: 12 */
	/* last cacheline: 48 bytes */
};
struct CPUTailQ {
	struct CPUState *          tqh_first;            /*     0     8 */
	struct CPUState * *        tqh_last;             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct Notifier {
	void                       (*notify)(Notifier *, void *); /*     0     8 */
	struct {
		struct Notifier *  le_next;              /*     8     8 */
		struct Notifier * * le_prev;             /*    16     8 */
	} node;                                          /*     8    16 */

	/* size: 24, cachelines: 1, members: 2 */
	/* last cacheline: 24 bytes */
};
struct CPUTLBEntry {
	union {
		struct {
			target_ulong addr_read;          /*     0     8 */
			target_ulong addr_write;         /*     8     8 */
			target_ulong addr_code;          /*    16     8 */
			uintptr_t  addend;               /*    24     8 */
		};                                       /*     0    32 */
		uint8_t            dummy[32];            /*     0    32 */
	};                                               /*     0    32 */

	/* size: 32, cachelines: 1, members: 1 */
	/* last cacheline: 32 bytes */
};
struct CPUIOTLBEntry {
	hwaddr                     addr;                 /*     0     8 */
	MemTxAttrs                 attrs;                /*     8     4 */

	/* size: 16, cachelines: 1, members: 2 */
	/* padding: 4 */
	/* last cacheline: 16 bytes */
};
struct SegmentCache {
	uint32_t                   selector;             /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	target_ulong               base;                 /*     8     8 */
	uint32_t                   limit;                /*    16     4 */
	uint32_t                   flags;                /*    20     4 */

	/* size: 24, cachelines: 1, members: 4 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
union ZMMReg {
	uint8_t                    _b_ZMMReg[64];      /*     0    64 */
	uint16_t                   _w_ZMMReg[32];      /*     0    64 */
	uint32_t                   _l_ZMMReg[16];      /*     0    64 */
	uint64_t                   _q_ZMMReg[8];       /*     0    64 */
	float32                    _s_ZMMReg[16];      /*     0    64 */
	float64                    _d_ZMMReg[8];       /*     0    64 */
};
union MMXReg {
	uint8_t                    _b_MMXReg[8];       /*     0     8 */
	uint16_t                   _w_MMXReg[4];       /*     0     8 */
	uint32_t                   _l_MMXReg[2];       /*     0     8 */
	uint64_t                   _q_MMXReg[1];       /*     0     8 */
	float32                    _s_MMXReg[2];       /*     0     8 */
	float64                    _d_MMXReg[1];       /*     0     8 */
};
struct BNDReg {
	uint64_t                   lb;                   /*     0     8 */
	uint64_t                   ub;                   /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct BNDCSReg {
	uint64_t                   cfgu;                 /*     0     8 */
	uint64_t                   sts;                  /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct CPUX86State {
	target_ulong               regs[16];             /*     0   128 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	target_ulong               eip;                  /*   128     8 */
	target_ulong               eflags;               /*   136     8 */
	target_ulong               cc_dst;               /*   144     8 */
	target_ulong               cc_src;               /*   152     8 */
	target_ulong               cc_src2;              /*   160     8 */
	uint32_t                   cc_op;                /*   168     4 */
	int32_t                    df;                   /*   172     4 */
	uint32_t                   hflags;               /*   176     4 */
	uint32_t                   hflags2;              /*   180     4 */
	SegmentCache               segs[6];              /*   184   144 */
	/* --- cacheline 5 boundary (320 bytes) was 8 bytes ago --- */
	SegmentCache               ldt;                  /*   328    24 */
	SegmentCache               tr;                   /*   352    24 */
	SegmentCache               gdt;                  /*   376    24 */
	/* --- cacheline 6 boundary (384 bytes) was 16 bytes ago --- */
	SegmentCache               idt;                  /*   400    24 */
	target_ulong               cr[5];                /*   424    40 */
	/* --- cacheline 7 boundary (448 bytes) was 16 bytes ago --- */
	int32_t                    a20_mask;             /*   464     4 */

	/* XXX 4 bytes hole, try to pack */

	BNDReg                     bnd_regs[4];          /*   472    64 */
	/* --- cacheline 8 boundary (512 bytes) was 24 bytes ago --- */
	BNDCSReg                   bndcs_regs;           /*   536    16 */
	uint64_t                   msr_bndcfgs;          /*   552     8 */
	uint64_t                   efer;                 /*   560     8 */
	struct {
	} start_init_save;                               /*   568     0 */
	unsigned int               fpstt;                /*   568     4 */
	uint16_t                   fpus;                 /*   572     2 */
	uint16_t                   fpuc;                 /*   574     2 */
	/* --- cacheline 9 boundary (576 bytes) --- */
	uint8_t                    fptags[8];            /*   576     8 */

	/* XXX 8 bytes hole, try to pack */

	FPReg                      fpregs[8];            /*   592   128 */
	/* --- cacheline 11 boundary (704 bytes) was 16 bytes ago --- */
	uint16_t                   fpop;                 /*   720     2 */

	/* XXX 6 bytes hole, try to pack */

	uint64_t                   fpip;                 /*   728     8 */
	uint64_t                   fpdp;                 /*   736     8 */
	float_status               fp_status;            /*   744     8 */
	floatx80                   ft0;                  /*   752    16 */
	/* --- cacheline 12 boundary (768 bytes) --- */
	float_status               mmx_status;           /*   768     8 */
	float_status               sse_status;           /*   776     8 */
	uint32_t                   mxcsr;                /*   784     4 */

	/* XXX 4 bytes hole, try to pack */

	ZMMReg                     xmm_regs[32];         /*   792  2048 */
	/* --- cacheline 44 boundary (2816 bytes) was 24 bytes ago --- */
	ZMMReg                     xmm_t0;               /*  2840    64 */
	/* --- cacheline 45 boundary (2880 bytes) was 24 bytes ago --- */
	MMXReg                     mmx_t0;               /*  2904     8 */
	uint64_t                   opmask_regs[8];       /*  2912    64 */
	/* --- cacheline 46 boundary (2944 bytes) was 32 bytes ago --- */
	uint32_t                   sysenter_cs;          /*  2976     4 */

	/* XXX 4 bytes hole, try to pack */

	target_ulong               sysenter_esp;         /*  2984     8 */
	target_ulong               sysenter_eip;         /*  2992     8 */
	uint64_t                   star;                 /*  3000     8 */
	/* --- cacheline 47 boundary (3008 bytes) --- */
	uint64_t                   vm_hsave;             /*  3008     8 */
	target_ulong               lstar;                /*  3016     8 */
	target_ulong               cstar;                /*  3024     8 */
	target_ulong               fmask;                /*  3032     8 */
	target_ulong               kernelgsbase;         /*  3040     8 */
	uint64_t                   tsc;                  /*  3048     8 */
	uint64_t                   tsc_adjust;           /*  3056     8 */
	uint64_t                   tsc_deadline;         /*  3064     8 */
	/* --- cacheline 48 boundary (3072 bytes) --- */
	uint64_t                   tsc_aux;              /*  3072     8 */
	uint64_t                   xcr0;                 /*  3080     8 */
	uint64_t                   mcg_status;           /*  3088     8 */
	uint64_t                   msr_ia32_misc_enable; /*  3096     8 */
	uint64_t                   msr_ia32_feature_control; /*  3104     8 */
	uint64_t                   msr_fixed_ctr_ctrl;   /*  3112     8 */
	uint64_t                   msr_global_ctrl;      /*  3120     8 */
	uint64_t                   msr_global_status;    /*  3128     8 */
	/* --- cacheline 49 boundary (3136 bytes) --- */
	uint64_t                   msr_global_ovf_ctrl;  /*  3136     8 */
	uint64_t                   msr_fixed_counters[3]; /*  3144    24 */
	uint64_t                   msr_gp_counters[18];  /*  3168   144 */
	/* --- cacheline 51 boundary (3264 bytes) was 48 bytes ago --- */
	uint64_t                   msr_gp_evtsel[18];    /*  3312   144 */
	/* --- cacheline 54 boundary (3456 bytes) --- */
	uint64_t                   pat;                  /*  3456     8 */
	uint32_t                   smbase;               /*  3464     4 */
	uint32_t                   pkru;                 /*  3468     4 */
	struct {
	} end_init_save;                                 /*  3472     0 */
	uint64_t                   system_time_msr;      /*  3472     8 */
	uint64_t                   wall_clock_msr;       /*  3480     8 */
	uint64_t                   steal_time_msr;       /*  3488     8 */
	uint64_t                   async_pf_en_msr;      /*  3496     8 */
	uint64_t                   pv_eoi_en_msr;        /*  3504     8 */
	uint64_t                   msr_hv_hypercall;     /*  3512     8 */
	/* --- cacheline 55 boundary (3520 bytes) --- */
	uint64_t                   msr_hv_guest_os_id;   /*  3520     8 */
	uint64_t                   msr_hv_vapic;         /*  3528     8 */
	uint64_t                   msr_hv_tsc;           /*  3536     8 */
	uint64_t                   msr_hv_crash_params[5]; /*  3544    40 */
	/* --- cacheline 56 boundary (3584 bytes) --- */
	uint64_t                   msr_hv_runtime;       /*  3584     8 */
	uint64_t                   msr_hv_synic_control; /*  3592     8 */
	uint64_t                   msr_hv_synic_version; /*  3600     8 */
	uint64_t                   msr_hv_synic_evt_page; /*  3608     8 */
	uint64_t                   msr_hv_synic_msg_page; /*  3616     8 */
	uint64_t                   msr_hv_synic_sint[16]; /*  3624   128 */
	/* --- cacheline 58 boundary (3712 bytes) was 40 bytes ago --- */
	uint64_t                   msr_hv_stimer_config[4]; /*  3752    32 */
	/* --- cacheline 59 boundary (3776 bytes) was 8 bytes ago --- */
	uint64_t                   msr_hv_stimer_count[4]; /*  3784    32 */
	int                        error_code;           /*  3816     4 */
	int                        exception_is_int;     /*  3820     4 */
	target_ulong               exception_next_eip;   /*  3824     8 */
	target_ulong               dr[8];                /*  3832    64 */
	/* --- cacheline 60 boundary (3840 bytes) was 56 bytes ago --- */
	union {
		struct CPUBreakpoint * cpu_breakpoint[4]; /*  3896    32 */
		struct CPUWatchpoint * cpu_watchpoint[4]; /*  3896    32 */
	};                                               /*  3896    32 */
	/* --- cacheline 61 boundary (3904 bytes) was 24 bytes ago --- */
	int                        old_exception;        /*  3928     4 */

	/* XXX 4 bytes hole, try to pack */

	uint64_t                   vm_vmcb;              /*  3936     8 */
	uint64_t                   tsc_offset;           /*  3944     8 */
	uint64_t                   intercept;            /*  3952     8 */
	uint16_t                   intercept_cr_read;    /*  3960     2 */
	uint16_t                   intercept_cr_write;   /*  3962     2 */
	uint16_t                   intercept_dr_read;    /*  3964     2 */
	uint16_t                   intercept_dr_write;   /*  3966     2 */
	/* --- cacheline 62 boundary (3968 bytes) --- */
	uint32_t                   intercept_exceptions; /*  3968     4 */
	uint8_t                    v_tpr;                /*  3972     1 */
	uint8_t                    nmi_injected;         /*  3973     1 */
	uint8_t                    nmi_pending;          /*  3974     1 */

	/* XXX 1 byte hole, try to pack */

	CPUTLBEntry                tlb_table[3][256];    /*  3976 24576 */
	/* --- cacheline 446 boundary (28544 bytes) was 8 bytes ago --- */
	CPUTLBEntry                tlb_v_table[3][8];    /* 28552   768 */
	/* --- cacheline 458 boundary (29312 bytes) was 8 bytes ago --- */
	CPUIOTLBEntry              iotlb[3][256];        /* 29320 12288 */
	/* --- cacheline 650 boundary (41600 bytes) was 8 bytes ago --- */
	CPUIOTLBEntry              iotlb_v[3][8];        /* 41608   384 */
	/* --- cacheline 656 boundary (41984 bytes) was 8 bytes ago --- */
	target_ulong               tlb_flush_addr;       /* 41992     8 */
	target_ulong               tlb_flush_mask;       /* 42000     8 */
	target_ulong               vtlb_index;           /* 42008     8 */
	struct {
	} end_reset_fields;                              /* 42016     0 */
	uint32_t                   cpuid_min_level;      /* 42016     4 */
	uint32_t                   cpuid_min_xlevel;     /* 42020     4 */
	uint32_t                   cpuid_min_xlevel2;    /* 42024     4 */
	uint32_t                   cpuid_max_level;      /* 42028     4 */
	uint32_t                   cpuid_max_xlevel;     /* 42032     4 */
	uint32_t                   cpuid_max_xlevel2;    /* 42036     4 */
	uint32_t                   cpuid_level;          /* 42040     4 */
	uint32_t                   cpuid_xlevel;         /* 42044     4 */
	/* --- cacheline 657 boundary (42048 bytes) --- */
	uint32_t                   cpuid_xlevel2;        /* 42048     4 */
	uint32_t                   cpuid_vendor1;        /* 42052     4 */
	uint32_t                   cpuid_vendor2;        /* 42056     4 */
	uint32_t                   cpuid_vendor3;        /* 42060     4 */
	uint32_t                   cpuid_version;        /* 42064     4 */
	FeatureWordArray           features;             /* 42068    72 */
	/* --- cacheline 658 boundary (42112 bytes) was 28 bytes ago --- */
	uint32_t                   cpuid_model[12];      /* 42140    48 */

	/* XXX 4 bytes hole, try to pack */

	/* --- cacheline 659 boundary (42176 bytes) was 16 bytes ago --- */
	uint64_t                   mtrr_fixed[11];       /* 42192    88 */
	/* --- cacheline 660 boundary (42240 bytes) was 40 bytes ago --- */
	uint64_t                   mtrr_deftype;         /* 42280     8 */
	MTRRVar                    mtrr_var[8];          /* 42288   128 */
	/* --- cacheline 662 boundary (42368 bytes) was 48 bytes ago --- */
	uint32_t                   mp_state;             /* 42416     4 */
	int32_t                    exception_injected;   /* 42420     4 */
	int32_t                    interrupt_injected;   /* 42424     4 */
	uint8_t                    soft_interrupt;       /* 42428     1 */
	uint8_t                    has_error_code;       /* 42429     1 */

	/* XXX 2 bytes hole, try to pack */

	/* --- cacheline 663 boundary (42432 bytes) --- */
	uint32_t                   sipi_vector;          /* 42432     4 */
	_Bool                      tsc_valid;            /* 42436     1 */

	/* XXX 3 bytes hole, try to pack */

	int64_t                    tsc_khz;              /* 42440     8 */
	int64_t                    user_tsc_khz;         /* 42448     8 */
	void *                     kvm_xsave_buf;        /* 42456     8 */
	uint64_t                   mcg_cap;              /* 42464     8 */
	uint64_t                   mcg_ctl;              /* 42472     8 */
	uint64_t                   mcg_ext_ctl;          /* 42480     8 */
	uint64_t                   mce_banks[40];        /* 42488   320 */
	/* --- cacheline 668 boundary (42752 bytes) was 56 bytes ago --- */
	uint64_t                   xstate_bv;            /* 42808     8 */
	/* --- cacheline 669 boundary (42816 bytes) --- */
	uint16_t                   fpus_vmstate;         /* 42816     2 */
	uint16_t                   fptag_vmstate;        /* 42818     2 */
	uint16_t                   fpregs_format_vmstate; /* 42820     2 */

	/* XXX 2 bytes hole, try to pack */

	uint64_t                   xss;                  /* 42824     8 */
	TPRAccess                  tpr_access_type;      /* 42832     4 */

	/* Force padding: */
	TPRAccess                  :32;
	TPRAccess                  :32;
	TPRAccess                  :32;

	/* size: 42848, cachelines: 670, members: 148 */
	/* sum members: 42794, holes: 11, sum holes: 42 */
	/* padding: 12 */
	/* last cacheline: 32 bytes */
};
struct rcu_reader_data {
	long unsigned int          ctr;                  /*     0     8 */
	_Bool                      waiting;              /*     8     1 */

	/* XXX 3 bytes hole, try to pack */

	unsigned int               depth;                /*    12     4 */
	struct {
		struct rcu_reader_data * le_next;        /*    16     8 */
		struct rcu_reader_data * * le_prev;      /*    24     8 */
	} node;                                          /*    16    16 */

	/* size: 32, cachelines: 1, members: 4 */
	/* sum members: 29, holes: 1, sum holes: 3 */
	/* last cacheline: 32 bytes */
};
struct rcu_head {
	struct rcu_head *          next;                 /*     0     8 */
	RCUCBFunc *                func;                 /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct MemoryRegionOps {
	uint64_t                   (*read)(void *, hwaddr, unsigned int); /*     0     8 */
	void                       (*write)(void *, hwaddr, uint64_t, unsigned int); /*     8     8 */
	MemTxResult                (*read_with_attrs)(void *, hwaddr, uint64_t *, unsigned int, MemTxAttrs); /*    16     8 */
	MemTxResult                (*write_with_attrs)(void *, hwaddr, uint64_t, unsigned int, MemTxAttrs); /*    24     8 */
	enum device_endian         endianness;           /*    32     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		unsigned int       min_access_size;      /*    40     4 */
		unsigned int       max_access_size;      /*    44     4 */
		_Bool              unaligned;            /*    48     1 */

		/* XXX 7 bytes hole, try to pack */

		_Bool              (*accepts)(void *, hwaddr, unsigned int, _Bool); /*    56     8 */
	} valid;                                         /*    40    24 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	struct {
		unsigned int       min_access_size;      /*    64     4 */
		unsigned int       max_access_size;      /*    68     4 */
		_Bool              unaligned;            /*    72     1 */
	} impl;                                          /*    64    12 */

	/* XXX last struct has 3 bytes of padding */
	/* XXX 4 bytes hole, try to pack */

	const MemoryRegionMmio     old_mmio;             /*    80    48 */

	/* size: 128, cachelines: 2, members: 8 */
	/* sum members: 120, holes: 2, sum holes: 8 */
	/* paddings: 1, sum paddings: 3 */
};
struct MemoryRegionMmio {
	CPUReadMemoryFunc *        read[3];              /*     0    24 */
	CPUWriteMemoryFunc *       write[3];             /*    24    24 */

	/* size: 48, cachelines: 1, members: 2 */
	/* last cacheline: 48 bytes */
};
struct IOMMUTLBEntry {
	AddressSpace *             target_as;            /*     0     8 */
	hwaddr                     iova;                 /*     8     8 */
	hwaddr                     translated_addr;      /*    16     8 */
	hwaddr                     addr_mask;            /*    24     8 */
	IOMMUAccessFlags           perm;                 /*    32     4 */

	/* size: 40, cachelines: 1, members: 5 */
	/* padding: 4 */
	/* last cacheline: 40 bytes */
};
struct IOMMUNotifier {
	void                       (*notify)(struct IOMMUNotifier *, IOMMUTLBEntry *); /*     0     8 */
	IOMMUNotifierFlag          notifier_flags;       /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		struct IOMMUNotifier * le_next;          /*    16     8 */
		struct IOMMUNotifier * * le_prev;        /*    24     8 */
	} node;                                          /*    16    16 */

	/* size: 32, cachelines: 1, members: 3 */
	/* sum members: 28, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct MemoryRegionIOMMUOps {
	IOMMUTLBEntry              (*translate)(MemoryRegion *, hwaddr, _Bool); /*     0     8 */
	uint64_t                   (*get_min_page_size)(MemoryRegion *); /*     8     8 */
	void                       (*notify_flag_changed)(MemoryRegion *, IOMMUNotifierFlag, IOMMUNotifierFlag); /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct subregions {
	struct MemoryRegion *      tqh_first;            /*     0     8 */
	struct MemoryRegion * *    tqh_last;             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct coalesced_ranges {
	struct CoalescedMemoryRange * tqh_first;         /*     0     8 */
	struct CoalescedMemoryRange * * tqh_last;        /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct memory_listeners_as {
	struct MemoryListener *    tqh_first;            /*     0     8 */
	struct MemoryListener * *  tqh_last;             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct AddressSpaceDispatch {
	struct rcu_head            rcu;                  /*     0    16 */
	MemoryRegionSection *      mru_section;          /*    16     8 */
	PhysPageEntry              phys_map;             /*    24     4 */

	/* XXX 4 bytes hole, try to pack */

	PhysPageMap                map;                  /*    32    48 */
	/* --- cacheline 1 boundary (64 bytes) was 16 bytes ago --- */
	AddressSpace *             as;                   /*    80     8 */

	/* size: 88, cachelines: 2, members: 5 */
	/* sum members: 84, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct qht {
	struct qht_map *           map;                  /*     0     8 */
	QemuMutex                  lock;                 /*     8    40 */
	unsigned int               mode;                 /*    48     4 */

	/* size: 56, cachelines: 1, members: 3 */
	/* padding: 4 */
	/* last cacheline: 56 bytes */
};
struct TBContext {
	TranslationBlock *         tbs;                  /*     0     8 */
	struct qht                 htable;               /*     8    56 */

	/* XXX last struct has 4 bytes of padding */

	/* --- cacheline 1 boundary (64 bytes) --- */
	int                        nb_tbs;               /*    64     4 */

	/* XXX 4 bytes hole, try to pack */

	QemuMutex                  tb_lock;              /*    72    40 */
	unsigned int               tb_flush_count;       /*   112     4 */
	int                        tb_phys_invalidate_count; /*   116     4 */

	/* size: 120, cachelines: 2, members: 6 */
	/* sum members: 116, holes: 1, sum holes: 4 */
	/* paddings: 1, sum paddings: 4 */
	/* last cacheline: 56 bytes */
};
struct TCGPool {
	struct TCGPool *           next;                 /*     0     8 */
	int                        size;                 /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	uint8_t                    data[];               /*    16     0 */

	/* size: 16, cachelines: 1, members: 3 */
	/* sum members: 12, holes: 1, sum holes: 4 */
	/* last cacheline: 16 bytes */
};
struct TCGTemp {
	TCGReg                     reg:8;                /*     0: 0  4 */
	TCGTempVal                 val_type:8;           /*     0: 8  4 */
	TCGType                    base_type:8;          /*     0:16  4 */
	TCGType                    type:8;               /*     0:24  4 */
	unsigned int               fixed_reg:1;          /*     4: 0  4 */
	unsigned int               indirect_reg:1;       /*     4: 1  4 */
	unsigned int               indirect_base:1;      /*     4: 2  4 */
	unsigned int               mem_coherent:1;       /*     4: 3  4 */
	unsigned int               mem_allocated:1;      /*     4: 4  4 */
	unsigned int               temp_local:1;         /*     4: 5  4 */
	unsigned int               temp_allocated:1;     /*     4: 6  4 */

	/* XXX 25 bits hole, try to pack */

	tcg_target_long            val;                  /*     8     8 */
	struct TCGTemp *           mem_base;             /*    16     8 */
	intptr_t                   mem_offset;           /*    24     8 */
	const char  *              name;                 /*    32     8 */

	/* size: 40, cachelines: 1, members: 15 */
	/* sum members: 32 */
	/* sum bitfield members: 39 bits, bit holes: 1, sum bit holes: 25 bits */
	/* last cacheline: 40 bytes */
};
struct TCGContext {
	uint8_t *                  pool_cur;             /*     0     8 */
	uint8_t *                  pool_end;             /*     8     8 */
	TCGPool *                  pool_first;           /*    16     8 */
	TCGPool *                  pool_current;         /*    24     8 */
	TCGPool *                  pool_first_large;     /*    32     8 */
	int                        nb_labels;            /*    40     4 */
	int                        nb_globals;           /*    44     4 */
	int                        nb_temps;             /*    48     4 */
	int                        nb_indirects;         /*    52     4 */
	tcg_insn_unit *            code_buf;             /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	uint16_t *                 tb_jmp_reset_offset;  /*    64     8 */
	uint16_t *                 tb_jmp_insn_offset;   /*    72     8 */
	uintptr_t *                tb_jmp_target_addr;   /*    80     8 */
	TCGRegSet                  reserved_regs;        /*    88     4 */

	/* XXX 4 bytes hole, try to pack */

	intptr_t                   current_frame_offset; /*    96     8 */
	intptr_t                   frame_start;          /*   104     8 */
	intptr_t                   frame_end;            /*   112     8 */
	TCGTemp *                  frame_temp;           /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	tcg_insn_unit *            code_ptr;             /*   128     8 */
	GHashTable *               helpers;              /*   136     8 */
	int                        gen_next_op_idx;      /*   144     4 */
	int                        gen_next_parm_idx;    /*   148     4 */
	int                        code_gen_max_blocks;  /*   152     4 */

	/* XXX 4 bytes hole, try to pack */

	void *                     code_gen_prologue;    /*   160     8 */
	void *                     code_gen_buffer;      /*   168     8 */
	size_t                     code_gen_buffer_size; /*   176     8 */
	void *                     code_gen_ptr;         /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	void *                     code_gen_highwater;   /*   192     8 */
	TBContext                  tb_ctx;               /*   200   120 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	CPUState *                 cpu;                  /*   320     8 */
	TCGv_env                   tcg_env;              /*   328     8 */
	struct TCGBackendData *    be;                   /*   336     8 */
	TCGTempSet                 free_temps[4];        /*   344   256 */
	/* --- cacheline 9 boundary (576 bytes) was 24 bytes ago --- */
	TCGTemp                    temps[512];           /*   600 20480 */
	/* --- cacheline 329 boundary (21056 bytes) was 24 bytes ago --- */
	TCGTemp *                  reg_to_temp[16];      /* 21080   128 */
	/* --- cacheline 331 boundary (21184 bytes) was 24 bytes ago --- */
	TCGOp                      gen_op_buf[640];      /* 21208  5120 */
	/* --- cacheline 411 boundary (26304 bytes) was 24 bytes ago --- */
	TCGArg                     gen_opparam_buf[6400]; /* 26328 51200 */
	/* --- cacheline 1211 boundary (77504 bytes) was 24 bytes ago --- */
	uint16_t                   gen_insn_end_off[512]; /* 77528  1024 */
	/* --- cacheline 1227 boundary (78528 bytes) was 24 bytes ago --- */
	target_ulong               gen_insn_data[512][2]; /* 78552  8192 */

	/* size: 86744, cachelines: 1356, members: 39 */
	/* sum members: 86736, holes: 2, sum holes: 8 */
	/* last cacheline: 24 bytes */
};
struct TCGTempSet {
	long unsigned int          l[8];                 /*     0    64 */

	/* size: 64, cachelines: 1, members: 1 */
};
struct TCGOp {
	TCGOpcode                  opc:8;                /*     0: 0  4 */
	unsigned int               prev:10;              /*     0: 8  4 */
	unsigned int               next:10;              /*     0:18  4 */
	unsigned int               calli:4;              /*     0:28  4 */
	unsigned int               callo:2;              /*     4: 0  4 */
	unsigned int               args:14;              /*     4: 2  4 */
	unsigned int               life:16;              /*     4:16  4 */

	/* size: 8, cachelines: 1, members: 7 */
	/* last cacheline: 8 bytes */
};
struct AccelState {
	Object                     parent_obj;           /*     0    40 */

	/* size: 40, cachelines: 1, members: 1 */
	/* last cacheline: 40 bytes */
};
struct VMStateInfo {
	const char  *              name;                 /*     0     8 */
	int                        (*get)(QEMUFile *, void *, size_t); /*     8     8 */
	void                       (*put)(QEMUFile *, void *, size_t); /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct kvm_debug_exit_arch {
	__u32                      exception;            /*     0     4 */
	__u32                      pad;                  /*     4     4 */
	__u64                      pc;                   /*     8     8 */
	__u64                      dr6;                  /*    16     8 */
	__u64                      dr7;                  /*    24     8 */

	/* size: 32, cachelines: 1, members: 5 */
	/* last cacheline: 32 bytes */
};
struct kvm_sync_regs {

	/* size: 0, cachelines: 0, members: 0 */
};
struct kvm_hyperv_exit {
	__u32                      type;                 /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	union {
		struct {
			__u32      msr;                  /*     8     4 */

			/* XXX 4 bytes hole, try to pack */

			__u64      control;              /*    16     8 */
			__u64      evt_page;             /*    24     8 */
			__u64      msg_page;             /*    32     8 */
		} synic;                                 /*     8    32 */
		struct {
			__u64      input;                /*     8     8 */
			__u64      result;               /*    16     8 */
			__u64      params[2];            /*    24    16 */
		} hcall;                                 /*     8    32 */
	} u;                                             /*     8    32 */

	/* size: 40, cachelines: 1, members: 2 */
	/* sum members: 36, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct TraceEvent {
	uint32_t                   id;                   /*     0     4 */
	uint32_t                   vcpu_id;              /*     4     4 */
	const char  *              name;                 /*     8     8 */
	const _Bool                sstate;               /*    16     1 */

	/* XXX 7 bytes hole, try to pack */

	uint16_t *                 dstate;               /*    24     8 */

	/* size: 32, cachelines: 1, members: 5 */
	/* sum members: 25, holes: 1, sum holes: 7 */
	/* last cacheline: 32 bytes */
};
struct RAMList {
	QemuMutex                  mutex;                /*     0    40 */
	RAMBlock *                 mru_block;            /*    40     8 */
	struct {
		struct RAMBlock *  lh_first;             /*    48     8 */
	} blocks;                                        /*    48     8 */
	DirtyMemoryBlocks *        dirty_memory[3];      /*    56    24 */
	/* --- cacheline 1 boundary (64 bytes) was 16 bytes ago --- */
	uint32_t                   version;              /*    80     4 */

	/* size: 88, cachelines: 2, members: 5 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct PhysPageEntry {
	uint32_t                   skip:6;               /*     0: 0  4 */
	uint32_t                   ptr:26;               /*     0: 6  4 */

	/* size: 4, cachelines: 1, members: 2 */
	/* last cacheline: 4 bytes */
};
struct PhysPageMap {
	struct rcu_head            rcu;                  /*     0    16 */
	unsigned int               sections_nb;          /*    16     4 */
	unsigned int               sections_nb_alloc;    /*    20     4 */
	unsigned int               nodes_nb;             /*    24     4 */
	unsigned int               nodes_nb_alloc;       /*    28     4 */
	Node *                     nodes;                /*    32     8 */
	MemoryRegionSection *      sections;             /*    40     8 */

	/* size: 48, cachelines: 1, members: 7 */
	/* last cacheline: 48 bytes */
};
struct subpage_t {
	MemoryRegion               iomem;                /*     0   256 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	AddressSpace *             as;                   /*   256     8 */
	hwaddr                     base;                 /*   264     8 */
	uint16_t                   sub_section[];        /*   272     0 */

	/* size: 272, cachelines: 5, members: 4 */
	/* last cacheline: 16 bytes */
};
struct MapClient {
	QEMUBH *                   bh;                   /*     0     8 */
	struct {
		struct MapClient * le_next;              /*     8     8 */
		struct MapClient * * le_prev;            /*    16     8 */
	} link;                                          /*     8    16 */

	/* size: 24, cachelines: 1, members: 2 */
	/* last cacheline: 24 bytes */
};
struct map_client_list {
	struct MapClient *         lh_first;             /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct timeval {
	__time_t                   tv_sec;               /*     0     8 */
	__suseconds_t              tv_usec;              /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct timezone {
	int                        tz_minuteswest;       /*     0     4 */
	int                        tz_dsttime;           /*     4     4 */

	/* size: 8, cachelines: 1, members: 2 */
	/* last cacheline: 8 bytes */
};
struct X86CPU {
	CPUState                   parent_obj;           /*     0 33408 */
	/* --- cacheline 522 boundary (33408 bytes) --- */
	CPUX86State                env;                  /* 33408 42848 */
	/* --- cacheline 1191 boundary (76224 bytes) was 32 bytes ago --- */
	_Bool                      hyperv_vapic;         /* 76256     1 */
	_Bool                      hyperv_relaxed_timing; /* 76257     1 */

	/* XXX 2 bytes hole, try to pack */

	int                        hyperv_spinlock_attempts; /* 76260     4 */
	char *                     hyperv_vendor_id;     /* 76264     8 */
	_Bool                      hyperv_time;          /* 76272     1 */
	_Bool                      hyperv_crash;         /* 76273     1 */
	_Bool                      hyperv_reset;         /* 76274     1 */
	_Bool                      hyperv_vpindex;       /* 76275     1 */
	_Bool                      hyperv_runtime;       /* 76276     1 */
	_Bool                      hyperv_synic;         /* 76277     1 */
	_Bool                      hyperv_stimer;        /* 76278     1 */
	_Bool                      check_cpuid;          /* 76279     1 */
	_Bool                      enforce_cpuid;        /* 76280     1 */
	_Bool                      expose_kvm;           /* 76281     1 */
	_Bool                      migratable;           /* 76282     1 */
	_Bool                      host_features;        /* 76283     1 */
	uint32_t                   apic_id;              /* 76284     4 */
	/* --- cacheline 1192 boundary (76288 bytes) --- */
	_Bool                      cache_info_passthrough; /* 76288     1 */

	/* XXX 3 bytes hole, try to pack */

	uint32_t                   filtered_features[18]; /* 76292    72 */
	/* --- cacheline 1193 boundary (76352 bytes) was 12 bytes ago --- */
	_Bool                      enable_pmu;           /* 76364     1 */
	_Bool                      enable_lmce;          /* 76365     1 */
	_Bool                      enable_l3_cache;      /* 76366     1 */
	_Bool                      enable_cpuid_0xb;     /* 76367     1 */
	_Bool                      full_cpuid_auto_level; /* 76368     1 */
	_Bool                      fill_mtrr_mask;       /* 76369     1 */
	_Bool                      host_phys_bits;       /* 76370     1 */

	/* XXX 1 byte hole, try to pack */

	uint32_t                   phys_bits;            /* 76372     4 */
	struct DeviceState *       apic_state;           /* 76376     8 */
	struct MemoryRegion *      cpu_as_root;          /* 76384     8 */
	struct MemoryRegion *      cpu_as_mem;           /* 76392     8 */
	struct MemoryRegion *      smram;                /* 76400     8 */
	Notifier                   machine_done;         /* 76408    24 */
	/* --- cacheline 1194 boundary (76416 bytes) was 16 bytes ago --- */
	struct kvm_msrs *          kvm_msr_buf;          /* 76432     8 */
	int32_t                    socket_id;            /* 76440     4 */
	int32_t                    core_id;              /* 76444     4 */
	int32_t                    thread_id;            /* 76448     4 */

	/* Force padding: */
	int32_t                    :32;
	int32_t                    :32;
	int32_t                    :32;

	/* size: 76464, cachelines: 1195, members: 38 */
	/* sum members: 76446, holes: 3, sum holes: 6 */
	/* padding: 12 */
	/* last cacheline: 48 bytes */
};
struct qdist_entry {
	double                     x;                    /*     0     8 */
	long unsigned int          count;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct qdist {
	struct qdist_entry *       entries;              /*     0     8 */
	size_t                     n;                    /*     8     8 */
	size_t                     size;                 /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct qht_stats {
	size_t                     head_buckets;         /*     0     8 */
	size_t                     used_head_buckets;    /*     8     8 */
	size_t                     entries;              /*    16     8 */
	struct qdist               chain;                /*    24    24 */
	struct qdist               occupancy;            /*    48    24 */

	/* size: 72, cachelines: 2, members: 5 */
	/* last cacheline: 8 bytes */
};
struct PageDesc {
	TranslationBlock *         first_tb;             /*     0     8 */
	unsigned int               code_write_count;     /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	long unsigned int *        code_bitmap;          /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct timespec {
	__time_t                   tv_sec;               /*     0     8 */
	__syscall_slong_t          tv_nsec;              /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct SyncClocks {
	int64_t                    diff_clk;             /*     0     8 */
	int64_t                    last_cpu_icount;      /*     8     8 */
	int64_t                    realtime_clock;       /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct tb_desc {
	target_ulong               pc;                   /*     0     8 */
	target_ulong               cs_base;              /*     8     8 */
	struct CPUX86State *       env;                  /*    16     8 */
	tb_page_addr_t             phys_page1;           /*    24     8 */
	uint32_t                   flags;                /*    32     4 */

	/* size: 40, cachelines: 1, members: 5 */
	/* padding: 4 */
	/* last cacheline: 40 bytes */
};
struct TCGRelocation {
	struct TCGRelocation *     next;                 /*     0     8 */
	int                        type;                 /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	tcg_insn_unit *            ptr;                  /*    16     8 */
	intptr_t                   addend;               /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* sum members: 28, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct TCGLabel {
	unsigned int               has_value:1;          /*     0: 0  4 */
	unsigned int               id:31;                /*     0: 1  4 */

	/* XXX 4 bytes hole, try to pack */

	union {
		uintptr_t          value;                /*     8     8 */
		tcg_insn_unit *    value_ptr;            /*     8     8 */
		TCGRelocation *    first_reloc;          /*     8     8 */
	} u;                                             /*     8     8 */

	/* size: 16, cachelines: 1, members: 3 */
	/* sum members: 8, holes: 1, sum holes: 4 */
	/* sum bitfield members: 32 bits (4 bytes) */
	/* last cacheline: 16 bytes */
};
struct TCGBackendData {
	TCGLabelQemuLdst *         labels;               /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct TCGArgConstraint {
	uint16_t                   ct;                   /*     0     2 */
	uint8_t                    alias_index;          /*     2     1 */

	/* XXX 1 byte hole, try to pack */

	union {
		TCGRegSet          regs;                 /*     4     4 */
	} u;                                             /*     4     4 */

	/* size: 8, cachelines: 1, members: 3 */
	/* sum members: 7, holes: 1, sum holes: 1 */
	/* last cacheline: 8 bytes */
};
struct TCGOpDef {
	const char  *              name;                 /*     0     8 */
	uint8_t                    nb_oargs;             /*     8     1 */
	uint8_t                    nb_iargs;             /*     9     1 */
	uint8_t                    nb_cargs;             /*    10     1 */
	uint8_t                    nb_args;              /*    11     1 */
	uint8_t                    flags;                /*    12     1 */

	/* XXX 3 bytes hole, try to pack */

	TCGArgConstraint *         args_ct;              /*    16     8 */
	int *                      sorted_args;          /*    24     8 */

	/* size: 32, cachelines: 1, members: 8 */
	/* sum members: 29, holes: 1, sum holes: 3 */
	/* last cacheline: 32 bytes */
};
struct TCGTargetOpDef {
	TCGOpcode                  op;                   /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	const char  *              args_ct_str[16];      /*     8   128 */

	/* size: 136, cachelines: 3, members: 2 */
	/* sum members: 132, holes: 1, sum holes: 4 */
	/* last cacheline: 8 bytes */
};
struct elf64_sym {
	Elf64_Word                 st_name;              /*     0     4 */
	unsigned char              st_info;              /*     4     1 */
	unsigned char              st_other;             /*     5     1 */
	Elf64_Half                 st_shndx;             /*     6     2 */
	Elf64_Addr                 st_value;             /*     8     8 */
	Elf64_Xword                st_size;              /*    16     8 */

	/* size: 24, cachelines: 1, members: 6 */
	/* last cacheline: 24 bytes */
};
struct elf64_hdr {
	unsigned char              e_ident[16];          /*     0    16 */
	Elf64_Half                 e_type;               /*    16     2 */
	Elf64_Half                 e_machine;            /*    18     2 */
	Elf64_Word                 e_version;            /*    20     4 */
	Elf64_Addr                 e_entry;              /*    24     8 */
	Elf64_Off                  e_phoff;              /*    32     8 */
	Elf64_Off                  e_shoff;              /*    40     8 */
	Elf64_Word                 e_flags;              /*    48     4 */
	Elf64_Half                 e_ehsize;             /*    52     2 */
	Elf64_Half                 e_phentsize;          /*    54     2 */
	Elf64_Half                 e_phnum;              /*    56     2 */
	Elf64_Half                 e_shentsize;          /*    58     2 */
	Elf64_Half                 e_shnum;              /*    60     2 */
	Elf64_Half                 e_shstrndx;           /*    62     2 */

	/* size: 64, cachelines: 1, members: 14 */
};
struct elf64_phdr {
	Elf64_Word                 p_type;               /*     0     4 */
	Elf64_Word                 p_flags;              /*     4     4 */
	Elf64_Off                  p_offset;             /*     8     8 */
	Elf64_Addr                 p_vaddr;              /*    16     8 */
	Elf64_Addr                 p_paddr;              /*    24     8 */
	Elf64_Xword                p_filesz;             /*    32     8 */
	Elf64_Xword                p_memsz;              /*    40     8 */
	Elf64_Xword                p_align;              /*    48     8 */

	/* size: 56, cachelines: 1, members: 8 */
	/* last cacheline: 56 bytes */
};
struct elf64_shdr {
	Elf64_Word                 sh_name;              /*     0     4 */
	Elf64_Word                 sh_type;              /*     4     4 */
	Elf64_Xword                sh_flags;             /*     8     8 */
	Elf64_Addr                 sh_addr;              /*    16     8 */
	Elf64_Off                  sh_offset;            /*    24     8 */
	Elf64_Xword                sh_size;              /*    32     8 */
	Elf64_Word                 sh_link;              /*    40     4 */
	Elf64_Word                 sh_info;              /*    44     4 */
	Elf64_Xword                sh_addralign;         /*    48     8 */
	Elf64_Xword                sh_entsize;           /*    56     8 */

	/* size: 64, cachelines: 1, members: 10 */
};
struct TCGLabelQemuLdst {
	_Bool                      is_ld;                /*     0     1 */

	/* XXX 3 bytes hole, try to pack */

	TCGMemOpIdx                oi;                   /*     4     4 */
	TCGType                    type;                 /*     8     4 */
	TCGReg                     addrlo_reg;           /*    12     4 */
	TCGReg                     addrhi_reg;           /*    16     4 */
	TCGReg                     datalo_reg;           /*    20     4 */
	TCGReg                     datahi_reg;           /*    24     4 */

	/* XXX 4 bytes hole, try to pack */

	tcg_insn_unit *            raddr;                /*    32     8 */
	tcg_insn_unit *            label_ptr[2];         /*    40    16 */
	struct TCGLabelQemuLdst *  next;                 /*    56     8 */

	/* size: 64, cachelines: 1, members: 10 */
	/* sum members: 57, holes: 2, sum holes: 7 */
};
struct TCGHelperInfo {
	void *                     func;                 /*     0     8 */
	const char  *              name;                 /*     8     8 */
	unsigned int               flags;                /*    16     4 */
	unsigned int               sizemask;             /*    20     4 */

	/* size: 24, cachelines: 1, members: 4 */
	/* last cacheline: 24 bytes */
};
struct jit_code_entry {
	struct jit_code_entry *    next_entry;           /*     0     8 */
	struct jit_code_entry *    prev_entry;           /*     8     8 */
	const void  *              symfile_addr;         /*    16     8 */
	uint64_t                   symfile_size;         /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* last cacheline: 32 bytes */
};
struct jit_descriptor {
	uint32_t                   version;              /*     0     4 */
	uint32_t                   action_flag;          /*     4     4 */
	struct jit_code_entry *    relevant_entry;       /*     8     8 */
	struct jit_code_entry *    first_entry;          /*    16     8 */

	/* size: 24, cachelines: 1, members: 4 */
	/* last cacheline: 24 bytes */
};
struct tcg_temp_info {
	_Bool                      is_const;             /*     0     1 */

	/* XXX 1 byte hole, try to pack */

	uint16_t                   prev_copy;            /*     2     2 */
	uint16_t                   next_copy;            /*     4     2 */

	/* XXX 2 bytes hole, try to pack */

	tcg_target_ulong           val;                  /*     8     8 */
	tcg_target_ulong           mask;                 /*    16     8 */

	/* size: 24, cachelines: 1, members: 5 */
	/* sum members: 21, holes: 2, sum holes: 3 */
	/* last cacheline: 24 bytes */
};
struct elf32_sym {
	Elf32_Word                 st_name;              /*     0     4 */
	Elf32_Addr                 st_value;             /*     4     4 */
	Elf32_Word                 st_size;              /*     8     4 */
	unsigned char              st_info;              /*    12     1 */
	unsigned char              st_other;             /*    13     1 */
	Elf32_Half                 st_shndx;             /*    14     2 */

	/* size: 16, cachelines: 1, members: 6 */
	/* last cacheline: 16 bytes */
};
struct syminfo {
	lookup_symbol_t            lookup_symbol;        /*     0     8 */
	unsigned int               disas_num_syms;       /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	union {
		struct elf32_sym * elf32;                /*    16     8 */
		struct elf64_sym * elf64;                /*    16     8 */
	} disas_symtab;                                  /*    16     8 */
	const char  *              disas_strtab;         /*    24     8 */
	struct syminfo *           next;                 /*    32     8 */

	/* size: 40, cachelines: 1, members: 5 */
	/* sum members: 36, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct CPUDebug {
	struct disassemble_info    info;                 /*     0   184 */
	/* --- cacheline 2 boundary (128 bytes) was 56 bytes ago --- */
	CPUState *                 cpu;                  /*   184     8 */

	/* size: 192, cachelines: 3, members: 2 */
};
struct ISABus {
	BusState                   parent_obj;           /*     0   104 */
	/* --- cacheline 1 boundary (64 bytes) was 40 bytes ago --- */
	MemoryRegion *             address_space;        /*   104     8 */
	MemoryRegion *             address_space_io;     /*   112     8 */
	qemu_irq *                 irqs;                 /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	IsaDma *                   dma[2];               /*   128    16 */

	/* size: 144, cachelines: 3, members: 5 */
	/* last cacheline: 16 bytes */
};
struct IsaDma {
	Object                     parent;               /*     0    40 */

	/* size: 40, cachelines: 1, members: 1 */
	/* last cacheline: 40 bytes */
};
struct TargetInfo {
	char *                     arch;                 /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct defconfig_file {
	const char  *              filename;             /*     0     8 */
	_Bool                      userconfig;           /*     8     1 */

	/* size: 16, cachelines: 1, members: 2 */
	/* padding: 7 */
	/* last cacheline: 16 bytes */
};
struct soundhw {
	const char  *              name;                 /*     0     8 */
	const char  *              descr;                /*     8     8 */
	int                        enabled;              /*    16     4 */
	int                        isa;                  /*    20     4 */
	union {
		int                (*init_isa)(ISABus *); /*    24     8 */
		int                (*init_pci)(PCIBus *); /*    24     8 */
	} init;                                          /*    24     8 */

	/* size: 32, cachelines: 1, members: 5 */
	/* last cacheline: 32 bytes */
};
union sigval {
	int                        sival_int;          /*     0     4 */
	void *                     sival_ptr;          /*     0     8 */
};
struct sigaction {
	union {
		__sighandler_t     sa_handler;           /*     0     8 */
		void               (*sa_sigaction)(int, siginfo_t *, void *); /*     0     8 */
	} __sigaction_handler;                           /*     0     8 */
	__sigset_t                 sa_mask;              /*     8   128 */
	/* --- cacheline 2 boundary (128 bytes) was 8 bytes ago --- */
	int                        sa_flags;             /*   136     4 */

	/* XXX 4 bytes hole, try to pack */

	void                       (*sa_restorer)(void); /*   144     8 */

	/* size: 152, cachelines: 3, members: 4 */
	/* sum members: 148, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct _GSource {
	gpointer                   callback_data;        /*     0     8 */
	GSourceCallbackFuncs *     callback_funcs;       /*     8     8 */
	const GSourceFuncs  *      source_funcs;         /*    16     8 */
	guint                      ref_count;            /*    24     4 */

	/* XXX 4 bytes hole, try to pack */

	GMainContext *             context;              /*    32     8 */
	gint                       priority;             /*    40     4 */
	guint                      flags;                /*    44     4 */
	guint                      source_id;            /*    48     4 */

	/* XXX 4 bytes hole, try to pack */

	GSList *                   poll_fds;             /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	GSource *                  prev;                 /*    64     8 */
	GSource *                  next;                 /*    72     8 */
	char *                     name;                 /*    80     8 */
	GSourcePrivate *           priv;                 /*    88     8 */

	/* size: 96, cachelines: 2, members: 13 */
	/* sum members: 88, holes: 2, sum holes: 8 */
	/* last cacheline: 32 bytes */
};
struct _GSourceCallbackFuncs {
	void                       (*ref)(gpointer);     /*     0     8 */
	void                       (*unref)(gpointer);   /*     8     8 */
	void                       (*get)(gpointer, GSource *, GSourceFunc *, gpointer *); /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct _GSourceFuncs {
	gboolean                   (*prepare)(GSource *, gint *); /*     0     8 */
	gboolean                   (*check)(GSource *);  /*     8     8 */
	gboolean                   (*dispatch)(GSource *, GSourceFunc, gpointer); /*    16     8 */
	void                       (*finalize)(GSource *); /*    24     8 */
	GSourceFunc                closure_callback;     /*    32     8 */
	GSourceDummyMarshal        closure_marshal;      /*    40     8 */

	/* size: 48, cachelines: 1, members: 6 */
	/* last cacheline: 48 bytes */
};
struct AioContext {
	GSource                    source;               /*     0    96 */
	/* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */
	QemuRecMutex               lock;                 /*    96    40 */
	/* --- cacheline 2 boundary (128 bytes) was 8 bytes ago --- */
	struct {
		struct AioHandler * lh_first;            /*   136     8 */
	} aio_handlers;                                  /*   136     8 */
	int                        walking_handlers;     /*   144     4 */
	uint32_t                   notify_me;            /*   148     4 */
	QemuMutex                  bh_lock;              /*   152    40 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	struct QEMUBH *            first_bh;             /*   192     8 */
	int                        walking_bh;           /*   200     4 */
	_Bool                      notified;             /*   204     1 */

	/* XXX 3 bytes hole, try to pack */

	EventNotifier              notifier;             /*   208     8 */
	struct ThreadPool *        thread_pool;          /*   216     8 */
	QEMUTimerListGroup         tlg;                  /*   224    32 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	int                        external_disable_cnt; /*   256     4 */
	int                        epollfd;              /*   260     4 */
	_Bool                      epoll_enabled;        /*   264     1 */
	_Bool                      epoll_available;      /*   265     1 */

	/* size: 272, cachelines: 5, members: 16 */
	/* sum members: 263, holes: 1, sum holes: 3 */
	/* padding: 6 */
	/* last cacheline: 16 bytes */
};
struct QEMUTimer {
	int64_t                    expire_time;          /*     0     8 */
	QEMUTimerList *            timer_list;           /*     8     8 */
	QEMUTimerCB *              cb;                   /*    16     8 */
	void *                     opaque;               /*    24     8 */
	QEMUTimer *                next;                 /*    32     8 */
	int                        scale;                /*    40     4 */

	/* size: 48, cachelines: 1, members: 6 */
	/* padding: 4 */
	/* last cacheline: 48 bytes */
};
struct CpuInfo {
	int64_t                    CPU;                  /*     0     8 */
	_Bool                      current;              /*     8     1 */
	_Bool                      halted;               /*     9     1 */

	/* XXX 6 bytes hole, try to pack */

	char *                     qom_path;             /*    16     8 */
	int64_t                    thread_id;            /*    24     8 */
	CpuInfoArch                arch;                 /*    32     4 */

	/* XXX 4 bytes hole, try to pack */

	union {
		CpuInfoX86         x86;                  /*    40     8 */
		CpuInfoSPARC       q_sparc;              /*    40    16 */
		CpuInfoPPC         ppc;                  /*    40     8 */
		CpuInfoMIPS        q_mips;               /*    40     8 */
		CpuInfoTricore     tricore;              /*    40     8 */
		CpuInfoOther       other;                /*    40     1 */
	} u;                                             /*    40    16 */

	/* size: 56, cachelines: 1, members: 7 */
	/* sum members: 46, holes: 2, sum holes: 10 */
	/* last cacheline: 56 bytes */
};
struct CpuInfoList {
	CpuInfoList *              next;                 /*     0     8 */
	CpuInfo *                  value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct CpuInfoMIPS {
	int64_t                    PC;                   /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct CpuInfoOther {
	char                       qapi_dummy_for_empty_struct; /*     0     1 */

	/* size: 1, cachelines: 1, members: 1 */
	/* last cacheline: 1 bytes */
};
struct CpuInfoPPC {
	int64_t                    nip;                  /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct CpuInfoSPARC {
	int64_t                    pc;                   /*     0     8 */
	int64_t                    npc;                  /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct CpuInfoTricore {
	int64_t                    PC;                   /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct CpuInfoX86 {
	int64_t                    pc;                   /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct kvm_msrs {
	__u32                      nmsrs;                /*     0     4 */
	__u32                      pad;                  /*     4     4 */
	struct kvm_msr_entry       entries[];            /*     8     0 */

	/* size: 8, cachelines: 1, members: 3 */
	/* last cacheline: 8 bytes */
};
struct kvm_msr_entry {
	__u32                      index;                /*     0     4 */
	__u32                      reserved;             /*     4     4 */
	__u64                      data;                 /*     8     8 */

	/* size: 16, cachelines: 1, members: 3 */
	/* last cacheline: 16 bytes */
};
struct QemuSeqLock {
	unsigned int               sequence;             /*     0     4 */

	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
struct qemu_signalfd_siginfo {
	uint32_t                   ssi_signo;            /*     0     4 */
	int32_t                    ssi_errno;            /*     4     4 */
	int32_t                    ssi_code;             /*     8     4 */
	uint32_t                   ssi_pid;              /*    12     4 */
	uint32_t                   ssi_uid;              /*    16     4 */
	int32_t                    ssi_fd;               /*    20     4 */
	uint32_t                   ssi_tid;              /*    24     4 */
	uint32_t                   ssi_band;             /*    28     4 */
	uint32_t                   ssi_overrun;          /*    32     4 */
	uint32_t                   ssi_trapno;           /*    36     4 */
	int32_t                    ssi_status;           /*    40     4 */
	int32_t                    ssi_int;              /*    44     4 */
	uint64_t                   ssi_ptr;              /*    48     8 */
	uint64_t                   ssi_utime;            /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	uint64_t                   ssi_stime;            /*    64     8 */
	uint64_t                   ssi_addr;             /*    72     8 */
	uint8_t                    pad[48];              /*    80    48 */

	/* size: 128, cachelines: 2, members: 17 */
};
struct TimersState {
	int64_t                    cpu_ticks_prev;       /*     0     8 */
	int64_t                    cpu_ticks_offset;     /*     8     8 */
	QemuSeqLock                vm_clock_seqlock;     /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	int64_t                    cpu_clock_offset;     /*    24     8 */
	int32_t                    cpu_ticks_enabled;    /*    32     4 */

	/* XXX 4 bytes hole, try to pack */

	int64_t                    dummy;                /*    40     8 */
	int64_t                    qemu_icount_bias;     /*    48     8 */
	int64_t                    qemu_icount;          /*    56     8 */

	/* size: 64, cachelines: 1, members: 8 */
	/* sum members: 56, holes: 2, sum holes: 8 */
};
struct iovec {
	void *                     iov_base;             /*     0     8 */
	size_t                     iov_len;              /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct stat {
	__dev_t                    st_dev;               /*     0     8 */
	__ino_t                    st_ino;               /*     8     8 */
	__nlink_t                  st_nlink;             /*    16     8 */
	__mode_t                   st_mode;              /*    24     4 */
	__uid_t                    st_uid;               /*    28     4 */
	__gid_t                    st_gid;               /*    32     4 */
	int                        __pad0;               /*    36     4 */
	__dev_t                    st_rdev;              /*    40     8 */
	__off_t                    st_size;              /*    48     8 */
	__blksize_t                st_blksize;           /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	__blkcnt_t                 st_blocks;            /*    64     8 */
	struct timespec            st_atim;              /*    72    16 */
	struct timespec            st_mtim;              /*    88    16 */
	struct timespec            st_ctim;              /*   104    16 */
	__syscall_slong_t          __glibc_reserved[3];  /*   120    24 */

	/* size: 144, cachelines: 3, members: 15 */
	/* last cacheline: 16 bytes */
};
struct _GArray {
	gchar *                    data;                 /*     0     8 */
	guint                      len;                  /*     8     4 */

	/* size: 16, cachelines: 1, members: 2 */
	/* padding: 4 */
	/* last cacheline: 16 bytes */
};
struct _GError {
	GQuark                     domain;               /*     0     4 */
	gint                       code;                 /*     4     4 */
	gchar *                    message;              /*     8     8 */

	/* size: 16, cachelines: 1, members: 3 */
	/* last cacheline: 16 bytes */
};
struct dirent {
	__ino64_t                  d_ino;                /*     0     8 */
	__off64_t                  d_off;                /*     8     8 */
	short unsigned int         d_reclen;             /*    16     2 */
	unsigned char              d_type;               /*    18     1 */
	char                       d_name[256];          /*    19   256 */

	/* size: 280, cachelines: 5, members: 5 */
	/* padding: 5 */
	/* last cacheline: 24 bytes */
};
struct _GList {
	gpointer                   data;                 /*     0     8 */
	GList *                    next;                 /*     8     8 */
	GList *                    prev;                 /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct _GString {
	gchar *                    str;                  /*     0     8 */
	gsize                      len;                  /*     8     8 */
	gsize                      allocated_len;        /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct _GIOChannel {
	gint                       ref_count;            /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	GIOFuncs *                 funcs;                /*     8     8 */
	gchar *                    encoding;             /*    16     8 */
	GIConv                     read_cd;              /*    24     8 */
	GIConv                     write_cd;             /*    32     8 */
	gchar *                    line_term;            /*    40     8 */
	guint                      line_term_len;        /*    48     4 */

	/* XXX 4 bytes hole, try to pack */

	gsize                      buf_size;             /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	GString *                  read_buf;             /*    64     8 */
	GString *                  encoded_read_buf;     /*    72     8 */
	GString *                  write_buf;            /*    80     8 */
	gchar                      partial_write_buf[6]; /*    88     6 */

	/* Bitfield combined with next fields */

	guint                      use_buffer:1;         /*    92:16  4 */
	guint                      do_encode:1;          /*    92:17  4 */
	guint                      close_on_unref:1;     /*    92:18  4 */
	guint                      is_readable:1;        /*    92:19  4 */
	guint                      is_writeable:1;       /*    92:20  4 */
	guint                      is_seekable:1;        /*    92:21  4 */

	/* XXX 10 bits hole, try to pack */

	gpointer                   reserved1;            /*    96     8 */
	gpointer                   reserved2;            /*   104     8 */

	/* size: 112, cachelines: 2, members: 20 */
	/* sum members: 102, holes: 2, sum holes: 8 */
	/* sum bitfield members: 6 bits, bit holes: 1, sum bit holes: 10 bits */
	/* last cacheline: 48 bytes */
};
struct _GIOFuncs {
	GIOStatus                  (*io_read)(GIOChannel *, gchar *, gsize, gsize *, GError * *); /*     0     8 */
	GIOStatus                  (*io_write)(GIOChannel *, const gchar  *, gsize, gsize *, GError * *); /*     8     8 */
	GIOStatus                  (*io_seek)(GIOChannel *, gint64, GSeekType, GError * *); /*    16     8 */
	GIOStatus                  (*io_close)(GIOChannel *, GError * *); /*    24     8 */
	GSource *                  (*io_create_watch)(GIOChannel *, GIOCondition); /*    32     8 */
	void                       (*io_free)(GIOChannel *); /*    40     8 */
	GIOStatus                  (*io_set_flags)(GIOChannel *, GIOFlags, GError * *); /*    48     8 */
	GIOFlags                   (*io_get_flags)(GIOChannel *); /*    56     8 */

	/* size: 64, cachelines: 1, members: 8 */
};
struct _GQueue {
	GList *                    head;                 /*     0     8 */
	GList *                    tail;                 /*     8     8 */
	guint                      length;               /*    16     4 */

	/* size: 24, cachelines: 1, members: 3 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct BlockDriverState {
	int64_t                    total_sectors;        /*     0     8 */
	int                        open_flags;           /*     8     4 */
	_Bool                      read_only;            /*    12     1 */
	_Bool                      encrypted;            /*    13     1 */
	_Bool                      valid_key;            /*    14     1 */
	_Bool                      sg;                   /*    15     1 */
	_Bool                      probed;               /*    16     1 */

	/* XXX 3 bytes hole, try to pack */

	int                        copy_on_read;         /*    20     4 */
	CoQueue                    flush_queue;          /*    24    16 */
	_Bool                      active_flush_req;     /*    40     1 */

	/* XXX 3 bytes hole, try to pack */

	unsigned int               write_gen;            /*    44     4 */
	unsigned int               flushed_gen;          /*    48     4 */

	/* XXX 4 bytes hole, try to pack */

	BlockDriver *              drv;                  /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	void *                     opaque;               /*    64     8 */
	AioContext *               aio_context;          /*    72     8 */
	struct {
		struct BdrvAioNotifier * lh_first;       /*    80     8 */
	} aio_notifiers;                                 /*    80     8 */
	_Bool                      walking_aio_notifiers; /*    88     1 */
	char                       filename[4096];       /*    89  4096 */
	/* --- cacheline 65 boundary (4160 bytes) was 25 bytes ago --- */
	char                       backing_file[4096];   /*  4185  4096 */
	/* --- cacheline 129 boundary (8256 bytes) was 25 bytes ago --- */
	char                       backing_format[16];   /*  8281    16 */

	/* XXX 7 bytes hole, try to pack */

	QDict *                    full_open_options;    /*  8304     8 */
	char                       exact_filename[4096]; /*  8312  4096 */
	/* --- cacheline 193 boundary (12352 bytes) was 56 bytes ago --- */
	BdrvChild *                backing;              /* 12408     8 */
	/* --- cacheline 194 boundary (12416 bytes) --- */
	BdrvChild *                file;                 /* 12416     8 */
	NotifierWithReturnList     before_write_notifiers; /* 12424     8 */
	unsigned int               in_flight;            /* 12432     4 */
	unsigned int               serialising_in_flight; /* 12436     4 */
	_Bool                      wakeup;               /* 12440     1 */

	/* XXX 7 bytes hole, try to pack */

	uint64_t                   wr_highest_offset;    /* 12448     8 */
	BlockLimits                bl;                   /* 12456    56 */
	/* --- cacheline 195 boundary (12480 bytes) was 32 bytes ago --- */
	unsigned int               supported_write_flags; /* 12512     4 */
	unsigned int               supported_zero_flags; /* 12516     4 */
	char                       node_name[32];        /* 12520    32 */
	/* --- cacheline 196 boundary (12544 bytes) was 8 bytes ago --- */
	struct {
		struct BlockDriverState * tqe_next;      /* 12552     8 */
		struct BlockDriverState * * tqe_prev;    /* 12560     8 */
	} node_list;                                     /* 12552    16 */
	struct {
		struct BlockDriverState * tqe_next;      /* 12568     8 */
		struct BlockDriverState * * tqe_prev;    /* 12576     8 */
	} bs_list;                                       /* 12568    16 */
	struct {
		struct BlockDriverState * tqe_next;      /* 12584     8 */
		struct BlockDriverState * * tqe_prev;    /* 12592     8 */
	} monitor_list;                                  /* 12584    16 */
	struct {
		struct BdrvDirtyBitmap * lh_first;       /* 12600     8 */
	} dirty_bitmaps;                                 /* 12600     8 */
	/* --- cacheline 197 boundary (12608 bytes) --- */
	int                        refcnt;               /* 12608     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		struct BdrvTrackedRequest * lh_first;    /* 12616     8 */
	} tracked_requests;                              /* 12616     8 */
	struct {
		struct BdrvOpBlocker * lh_first;         /* 12624     8 */
	} op_blockers[16]; /* 12624   128 */
	/* --- cacheline 199 boundary (12736 bytes) was 16 bytes ago --- */
	BlockJob *                 job;                  /* 12752     8 */
	BlockDriverState *         inherits_from;        /* 12760     8 */
	struct {
		struct BdrvChild * lh_first;             /* 12768     8 */
	} children;                                      /* 12768     8 */
	struct {
		struct BdrvChild * lh_first;             /* 12776     8 */
	} parents;                                       /* 12776     8 */
	QDict *                    options;              /* 12784     8 */
	QDict *                    explicit_options;     /* 12792     8 */
	/* --- cacheline 200 boundary (12800 bytes) --- */
	BlockdevDetectZeroesOptions detect_zeroes;       /* 12800     4 */

	/* XXX 4 bytes hole, try to pack */

	Error *                    backing_blocker;      /* 12808     8 */
	uint64_t                   write_threshold_offset; /* 12816     8 */
	NotifierWithReturn         write_threshold_notifier; /* 12824    24 */
	unsigned int               io_plugged;           /* 12848     4 */
	unsigned int               io_plug_disabled;     /* 12852     4 */
	int                        quiesce_counter;      /* 12856     4 */

	/* size: 12864, cachelines: 201, members: 53 */
	/* sum members: 12828, holes: 7, sum holes: 32 */
	/* padding: 4 */
};
struct CharDriverState {
	QemuMutex                  chr_write_lock;       /*     0    40 */
	int                        (*chr_write)(struct CharDriverState *, const uint8_t  *, int); /*    40     8 */
	int                        (*chr_sync_read)(struct CharDriverState *, const uint8_t  *, int); /*    48     8 */
	GSource *                  (*chr_add_watch)(struct CharDriverState *, GIOCondition); /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	void                       (*chr_update_read_handler)(struct CharDriverState *, GMainContext *); /*    64     8 */
	int                        (*chr_ioctl)(struct CharDriverState *, int, void *); /*    72     8 */
	int                        (*get_msgfds)(struct CharDriverState *, int *, int); /*    80     8 */
	int                        (*set_msgfds)(struct CharDriverState *, int *, int); /*    88     8 */
	int                        (*chr_add_client)(struct CharDriverState *, int); /*    96     8 */
	int                        (*chr_wait_connected)(struct CharDriverState *, Error * *); /*   104     8 */
	void                       (*chr_free)(struct CharDriverState *); /*   112     8 */
	void                       (*chr_disconnect)(struct CharDriverState *); /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	void                       (*chr_accept_input)(struct CharDriverState *); /*   128     8 */
	void                       (*chr_set_echo)(struct CharDriverState *, _Bool); /*   136     8 */
	void                       (*chr_set_fe_open)(struct CharDriverState *, int); /*   144     8 */
	CharBackend *              be;                   /*   152     8 */
	void *                     opaque;               /*   160     8 */
	char *                     label;                /*   168     8 */
	char *                     filename;             /*   176     8 */
	int                        logfd;                /*   184     4 */
	int                        be_open;              /*   188     4 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	int                        is_mux;               /*   192     4 */
	guint                      fd_in_tag;            /*   196     4 */
	_Bool                      replay;               /*   200     1 */

	/* XXX 7 bytes hole, try to pack */

	long unsigned int          features[1];          /*   208     8 */
	struct {
		struct CharDriverState * tqe_next;       /*   216     8 */
		struct CharDriverState * * tqe_prev;     /*   224     8 */
	} next;                                          /*   216    16 */

	/* size: 232, cachelines: 4, members: 26 */
	/* sum members: 225, holes: 1, sum holes: 7 */
	/* last cacheline: 40 bytes */
};
struct MachineClass {
	ObjectClass                parent_class;         /*     0    96 */
	/* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */
	const char  *              family;               /*    96     8 */
	char *                     name;                 /*   104     8 */
	const char  *              alias;                /*   112     8 */
	const char  *              desc;                 /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	void                       (*init)(MachineState *); /*   128     8 */
	void                       (*reset)(void);       /*   136     8 */
	void                       (*hot_add_cpu)(const int64_t , Error * *); /*   144     8 */
	int                        (*kvm_type)(const char  *); /*   152     8 */
	BlockInterfaceType         block_default_type;   /*   160     4 */
	int                        units_per_default_bus; /*   164     4 */
	int                        max_cpus;             /*   168     4 */
	unsigned int               no_serial:1;          /*   172: 0  4 */
	unsigned int               no_parallel:1;        /*   172: 1  4 */
	unsigned int               use_virtcon:1;        /*   172: 2  4 */
	unsigned int               use_sclp:1;           /*   172: 3  4 */
	unsigned int               no_floppy:1;          /*   172: 4  4 */
	unsigned int               no_cdrom:1;           /*   172: 5  4 */
	unsigned int               no_sdcard:1;          /*   172: 6  4 */
	unsigned int               has_dynamic_sysbus:1; /*   172: 7  4 */
	unsigned int               pci_allow_0_address:1; /*   172: 8  4 */
	unsigned int               legacy_fw_cfg_order:1; /*   172: 9  4 */

	/* XXX 22 bits hole, try to pack */

	int                        is_default;           /*   176     4 */

	/* XXX 4 bytes hole, try to pack */

	const char  *              default_machine_opts; /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	const char  *              default_boot_order;   /*   192     8 */
	const char  *              default_display;      /*   200     8 */
	GArray *                   compat_props;         /*   208     8 */
	const char  *              hw_version;           /*   216     8 */
	ram_addr_t                 default_ram_size;     /*   224     8 */
	_Bool                      option_rom_has_mr;    /*   232     1 */
	_Bool                      rom_file_has_mr;      /*   233     1 */

	/* XXX 2 bytes hole, try to pack */

	int                        minimum_page_bits;    /*   236     4 */
	HotplugHandler *           (*get_hotplug_handler)(MachineState *, DeviceState *); /*   240     8 */
	unsigned int               (*cpu_index_to_socket_id)(unsigned int); /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	CPUArchIdList *            (*possible_cpu_arch_ids)(MachineState *); /*   256     8 */
	HotpluggableCPUList *      (*query_hotpluggable_cpus)(MachineState *); /*   264     8 */

	/* size: 272, cachelines: 5, members: 36 */
	/* sum members: 262, holes: 2, sum holes: 6 */
	/* sum bitfield members: 10 bits, bit holes: 1, sum bit holes: 22 bits */
	/* last cacheline: 16 bytes */
};
struct Monitor {
	CharBackend                chr;                  /*     0    48 */
	int                        reset_seen;           /*    48     4 */
	int                        flags;                /*    52     4 */
	int                        suspend_cnt;          /*    56     4 */
	_Bool                      skip_flush;           /*    60     1 */

	/* XXX 3 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) --- */
	QemuMutex                  out_lock;             /*    64    40 */
	QString *                  outbuf;               /*   104     8 */
	guint                      out_watch;            /*   112     4 */
	int                        mux_out;              /*   116     4 */
	ReadLineState *            rs;                   /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	MonitorQMP                 qmp;                  /*   128    72 */
	/* --- cacheline 3 boundary (192 bytes) was 8 bytes ago --- */
	CPUState *                 mon_cpu;              /*   200     8 */
	BlockCompletionFunc *      password_completion_cb; /*   208     8 */
	void *                     password_opaque;      /*   216     8 */
	mon_cmd_t *                cmd_table;            /*   224     8 */
	struct {
		struct mon_fd_t *  lh_first;             /*   232     8 */
	} fds;                                           /*   232     8 */
	struct {
		struct Monitor *   le_next;              /*   240     8 */
		struct Monitor * * le_prev;              /*   248     8 */
	} entry;                                         /*   240    16 */

	/* size: 256, cachelines: 4, members: 17 */
	/* sum members: 253, holes: 1, sum holes: 3 */
};
struct MonitorDef {
	const char  *              name;                 /*     0     8 */
	int                        offset;               /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	target_long                (*get_value)(const struct MonitorDef  *, int); /*    16     8 */
	int                        type;                 /*    24     4 */

	/* size: 32, cachelines: 1, members: 4 */
	/* sum members: 24, holes: 1, sum holes: 4 */
	/* padding: 4 */
	/* last cacheline: 32 bytes */
};
struct NetClientState {
	NetClientInfo *            info;                 /*     0     8 */
	int                        link_down;            /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		struct NetClientState * tqe_next;        /*    16     8 */
		struct NetClientState * * tqe_prev;      /*    24     8 */
	} next;                                          /*    16    16 */
	NetClientState *           peer;                 /*    32     8 */
	NetQueue *                 incoming_queue;       /*    40     8 */
	char *                     model;                /*    48     8 */
	char *                     name;                 /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	char                       info_str[256];        /*    64   256 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	unsigned int               receive_disabled:1;   /*   320: 0  4 */

	/* XXX 31 bits hole, try to pack */
	/* XXX 4 bytes hole, try to pack */

	NetClientDestructor *      destructor;           /*   328     8 */
	unsigned int               queue_index;          /*   336     4 */
	unsigned int               rxfilter_notify_enabled:1; /*   340: 0  4 */

	/* XXX 31 bits hole, try to pack */

	int                        vring_enable;         /*   344     4 */

	/* XXX 4 bytes hole, try to pack */

	struct NetFilterHead       filters;              /*   352    16 */

	/* size: 368, cachelines: 6, members: 14 */
	/* sum members: 348, holes: 3, sum holes: 12 */
	/* sum bitfield members: 2 bits, bit holes: 2, sum bit holes: 62 bits */
	/* last cacheline: 48 bytes */
};
struct QemuOptsList {
	const char  *              name;                 /*     0     8 */
	const char  *              implied_opt_name;     /*     8     8 */
	_Bool                      merge_lists;          /*    16     1 */

	/* XXX 7 bytes hole, try to pack */

	struct {
		struct QemuOpts *  tqh_first;            /*    24     8 */
		struct QemuOpts * * tqh_last;            /*    32     8 */
	} head;                                          /*    24    16 */
	QemuOptDesc                desc[];               /*    40     0 */

	/* size: 40, cachelines: 1, members: 5 */
	/* sum members: 33, holes: 1, sum holes: 7 */
	/* last cacheline: 40 bytes */
};
struct intList {
	intList *                  next;                 /*     0     8 */
	int64_t                    value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct strList {
	strList *                  next;                 /*     0     8 */
	char *                     value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct AddfdInfo {
	int64_t                    fdset_id;             /*     0     8 */
	int64_t                    fd;                   /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct ChardevBackendInfo {
	char *                     name;                 /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct ChardevBackendInfoList {
	ChardevBackendInfoList *   next;                 /*     0     8 */
	ChardevBackendInfo *       value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct ChardevInfo {
	char *                     label;                /*     0     8 */
	char *                     filename;             /*     8     8 */
	_Bool                      frontend_open;        /*    16     1 */

	/* size: 24, cachelines: 1, members: 3 */
	/* padding: 7 */
	/* last cacheline: 24 bytes */
};
struct ChardevInfoList {
	ChardevInfoList *          next;                 /*     0     8 */
	ChardevInfo *              value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct CommandInfo {
	char *                     name;                 /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct CommandInfoList {
	CommandInfoList *          next;                 /*     0     8 */
	CommandInfo *              value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct CpuInstanceProperties {
	_Bool                      has_node_id;          /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    node_id;              /*     8     8 */
	_Bool                      has_socket_id;        /*    16     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    socket_id;            /*    24     8 */
	_Bool                      has_core_id;          /*    32     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    core_id;              /*    40     8 */
	_Bool                      has_thread_id;        /*    48     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    thread_id;            /*    56     8 */

	/* size: 64, cachelines: 1, members: 8 */
	/* sum members: 36, holes: 4, sum holes: 28 */
};
struct EventInfo {
	char *                     name;                 /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct EventInfoList {
	EventInfoList *            next;                 /*     0     8 */
	EventInfo *                value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct FdsetFdInfo {
	int64_t                    fd;                   /*     0     8 */
	_Bool                      has_opaque;           /*     8     1 */

	/* XXX 7 bytes hole, try to pack */

	char *                     opaque;               /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* sum members: 17, holes: 1, sum holes: 7 */
	/* last cacheline: 24 bytes */
};
struct FdsetFdInfoList {
	FdsetFdInfoList *          next;                 /*     0     8 */
	FdsetFdInfo *              value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct FdsetInfo {
	int64_t                    fdset_id;             /*     0     8 */
	FdsetFdInfoList *          fds;                  /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct FdsetInfoList {
	FdsetInfoList *            next;                 /*     0     8 */
	FdsetInfo *                value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct GICCapability {
	int64_t                    version;              /*     0     8 */
	_Bool                      emulated;             /*     8     1 */
	_Bool                      kernel;               /*     9     1 */

	/* size: 16, cachelines: 1, members: 3 */
	/* padding: 6 */
	/* last cacheline: 16 bytes */
};
struct GICCapabilityList {
	GICCapabilityList *        next;                 /*     0     8 */
	GICCapability *            value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct HotpluggableCPU {
	char *                     type;                 /*     0     8 */
	int64_t                    vcpus_count;          /*     8     8 */
	CpuInstanceProperties *    props;                /*    16     8 */
	_Bool                      has_qom_path;         /*    24     1 */

	/* XXX 7 bytes hole, try to pack */

	char *                     qom_path;             /*    32     8 */

	/* size: 40, cachelines: 1, members: 5 */
	/* sum members: 33, holes: 1, sum holes: 7 */
	/* last cacheline: 40 bytes */
};
struct HotpluggableCPUList {
	HotpluggableCPUList *      next;                 /*     0     8 */
	HotpluggableCPU *          value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct ImageInfo {
	char *                     filename;             /*     0     8 */
	char *                     format;               /*     8     8 */
	_Bool                      has_dirty_flag;       /*    16     1 */
	_Bool                      dirty_flag;           /*    17     1 */
	_Bool                      has_actual_size;      /*    18     1 */

	/* XXX 5 bytes hole, try to pack */

	int64_t                    actual_size;          /*    24     8 */
	int64_t                    virtual_size;         /*    32     8 */
	_Bool                      has_cluster_size;     /*    40     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    cluster_size;         /*    48     8 */
	_Bool                      has_encrypted;        /*    56     1 */
	_Bool                      encrypted;            /*    57     1 */
	_Bool                      has_compressed;       /*    58     1 */
	_Bool                      compressed;           /*    59     1 */
	_Bool                      has_backing_filename; /*    60     1 */

	/* XXX 3 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) --- */
	char *                     backing_filename;     /*    64     8 */
	_Bool                      has_full_backing_filename; /*    72     1 */

	/* XXX 7 bytes hole, try to pack */

	char *                     full_backing_filename; /*    80     8 */
	_Bool                      has_backing_filename_format; /*    88     1 */

	/* XXX 7 bytes hole, try to pack */

	char *                     backing_filename_format; /*    96     8 */
	_Bool                      has_snapshots;        /*   104     1 */

	/* XXX 7 bytes hole, try to pack */

	SnapshotInfoList *         snapshots;            /*   112     8 */
	_Bool                      has_backing_image;    /*   120     1 */

	/* XXX 7 bytes hole, try to pack */

	/* --- cacheline 2 boundary (128 bytes) --- */
	ImageInfo *                backing_image;        /*   128     8 */
	_Bool                      has_format_specific;  /*   136     1 */

	/* XXX 7 bytes hole, try to pack */

	ImageInfoSpecific *        format_specific;      /*   144     8 */

	/* size: 152, cachelines: 3, members: 25 */
	/* sum members: 102, holes: 8, sum holes: 50 */
	/* last cacheline: 24 bytes */
};
struct ImageInfoList {
	ImageInfoList *            next;                 /*     0     8 */
	ImageInfo *                value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct ImageInfoSpecific {
	ImageInfoSpecificKind      type;                 /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	union {
		q_obj_ImageInfoSpecificQCow2_wrapper qcow2; /*     8     8 */
		q_obj_ImageInfoSpecificVmdk_wrapper vmdk; /*     8     8 */
		q_obj_QCryptoBlockInfoLUKS_wrapper luks; /*     8     8 */
	} u;                                             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* sum members: 12, holes: 1, sum holes: 4 */
	/* last cacheline: 16 bytes */
};
struct ImageInfoSpecificQCow2 {
	char *                     compat;               /*     0     8 */
	_Bool                      has_lazy_refcounts;   /*     8     1 */
	_Bool                      lazy_refcounts;       /*     9     1 */
	_Bool                      has_corrupt;          /*    10     1 */
	_Bool                      corrupt;              /*    11     1 */

	/* XXX 4 bytes hole, try to pack */

	int64_t                    refcount_bits;        /*    16     8 */

	/* size: 24, cachelines: 1, members: 6 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct ImageInfoSpecificVmdk {
	char *                     create_type;          /*     0     8 */
	int64_t                    cid;                  /*     8     8 */
	int64_t                    parent_cid;           /*    16     8 */
	ImageInfoList *            extents;              /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* last cacheline: 32 bytes */
};
struct ObjectPropertyInfo {
	char *                     name;                 /*     0     8 */
	char *                     type;                 /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct ObjectPropertyInfoList {
	ObjectPropertyInfoList *   next;                 /*     0     8 */
	ObjectPropertyInfo *       value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct QCryptoBlockInfoLUKS {
	QCryptoCipherAlgorithm     cipher_alg;           /*     0     4 */
	QCryptoCipherMode          cipher_mode;          /*     4     4 */
	QCryptoIVGenAlgorithm      ivgen_alg;            /*     8     4 */
	_Bool                      has_ivgen_hash_alg;   /*    12     1 */

	/* XXX 3 bytes hole, try to pack */

	QCryptoHashAlgorithm       ivgen_hash_alg;       /*    16     4 */
	QCryptoHashAlgorithm       hash_alg;             /*    20     4 */
	int64_t                    payload_offset;       /*    24     8 */
	int64_t                    master_key_iters;     /*    32     8 */
	char *                     uuid;                 /*    40     8 */
	QCryptoBlockInfoLUKSSlotList * slots;            /*    48     8 */

	/* size: 56, cachelines: 1, members: 10 */
	/* sum members: 53, holes: 1, sum holes: 3 */
	/* last cacheline: 56 bytes */
};
struct QCryptoBlockInfoLUKSSlot {
	_Bool                      active;               /*     0     1 */
	_Bool                      has_iters;            /*     1     1 */

	/* XXX 6 bytes hole, try to pack */

	int64_t                    iters;                /*     8     8 */
	_Bool                      has_stripes;          /*    16     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    stripes;              /*    24     8 */
	int64_t                    key_offset;           /*    32     8 */

	/* size: 40, cachelines: 1, members: 6 */
	/* sum members: 27, holes: 2, sum holes: 13 */
	/* last cacheline: 40 bytes */
};
struct QCryptoBlockInfoLUKSSlotList {
	QCryptoBlockInfoLUKSSlotList * next;             /*     0     8 */
	QCryptoBlockInfoLUKSSlot * value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct RxFilterInfo {
	char *                     name;                 /*     0     8 */
	_Bool                      promiscuous;          /*     8     1 */

	/* XXX 3 bytes hole, try to pack */

	RxState                    multicast;            /*    12     4 */
	RxState                    unicast;              /*    16     4 */
	RxState                    vlan;                 /*    20     4 */
	_Bool                      broadcast_allowed;    /*    24     1 */
	_Bool                      multicast_overflow;   /*    25     1 */
	_Bool                      unicast_overflow;     /*    26     1 */

	/* XXX 5 bytes hole, try to pack */

	char *                     main_mac;             /*    32     8 */
	intList *                  vlan_table;           /*    40     8 */
	strList *                  unicast_table;        /*    48     8 */
	strList *                  multicast_table;      /*    56     8 */

	/* size: 64, cachelines: 1, members: 12 */
	/* sum members: 56, holes: 2, sum holes: 8 */
};
struct SnapshotInfo {
	char *                     id;                   /*     0     8 */
	char *                     name;                 /*     8     8 */
	int64_t                    vm_state_size;        /*    16     8 */
	int64_t                    date_sec;             /*    24     8 */
	int64_t                    date_nsec;            /*    32     8 */
	int64_t                    vm_clock_sec;         /*    40     8 */
	int64_t                    vm_clock_nsec;        /*    48     8 */

	/* size: 56, cachelines: 1, members: 7 */
	/* last cacheline: 56 bytes */
};
struct SnapshotInfoList {
	SnapshotInfoList *         next;                 /*     0     8 */
	SnapshotInfo *             value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct TraceEventInfo {
	char *                     name;                 /*     0     8 */
	TraceEventState            state;                /*     8     4 */
	_Bool                      vcpu;                 /*    12     1 */

	/* size: 16, cachelines: 1, members: 3 */
	/* padding: 3 */
	/* last cacheline: 16 bytes */
};
struct TraceEventInfoList {
	TraceEventInfoList *       next;                 /*     0     8 */
	TraceEventInfo *           value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct q_obj_ImageInfoSpecificQCow2_wrapper {
	ImageInfoSpecificQCow2 *   data;                 /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct q_obj_ImageInfoSpecificVmdk_wrapper {
	ImageInfoSpecificVmdk *    data;                 /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct q_obj_QCryptoBlockInfoLUKS_wrapper {
	QCryptoBlockInfoLUKS *     data;                 /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct QDictEntry {
	char *                     key;                  /*     0     8 */
	QObject *                  value;                /*     8     8 */
	struct {
		struct QDictEntry * le_next;             /*    16     8 */
		struct QDictEntry * * le_prev;           /*    24     8 */
	} next;                                          /*    16    16 */

	/* size: 32, cachelines: 1, members: 3 */
	/* last cacheline: 32 bytes */
};
struct QDict {
	QObject                    base;                 /*     0    16 */
	size_t                     size;                 /*    16     8 */
	struct {
		struct QDictEntry * lh_first;            /*    24     8 */
	} table[512]; /*    24  4096 */

	/* size: 4120, cachelines: 65, members: 3 */
	/* last cacheline: 24 bytes */
};
struct QemuOptDesc {
	const char  *              name;                 /*     0     8 */
	enum QemuOptType           type;                 /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	const char  *              help;                 /*    16     8 */
	const char  *              def_value_str;        /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* sum members: 28, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct NotifierWithReturn {
	int                        (*notify)(NotifierWithReturn *, void *); /*     0     8 */
	struct {
		struct NotifierWithReturn * le_next;     /*     8     8 */
		struct NotifierWithReturn * * le_prev;   /*    16     8 */
	} node;                                          /*     8    16 */

	/* size: 24, cachelines: 1, members: 2 */
	/* last cacheline: 24 bytes */
};
struct NotifierWithReturnList {
	struct {
		struct NotifierWithReturn * lh_first;    /*     0     8 */
	} notifiers;                                     /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct QEMUIOVector {
	struct iovec *             iov;                  /*     0     8 */
	int                        niov;                 /*     8     4 */
	int                        nalloc;               /*    12     4 */
	size_t                     size;                 /*    16     8 */

	/* size: 24, cachelines: 1, members: 4 */
	/* last cacheline: 24 bytes */
};
struct BlockAIOCB {
	const AIOCBInfo  *         aiocb_info;           /*     0     8 */
	BlockDriverState *         bs;                   /*     8     8 */
	BlockCompletionFunc *      cb;                   /*    16     8 */
	void *                     opaque;               /*    24     8 */
	int                        refcnt;               /*    32     4 */

	/* size: 40, cachelines: 1, members: 5 */
	/* padding: 4 */
	/* last cacheline: 40 bytes */
};
struct AIOCBInfo {
	void                       (*cancel_async)(BlockAIOCB *); /*     0     8 */
	AioContext *               (*get_aio_context)(BlockAIOCB *); /*     8     8 */
	size_t                     aiocb_size;           /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct Coroutine {
	CoroutineEntry *           entry;                /*     0     8 */
	void *                     entry_arg;            /*     8     8 */
	Coroutine *                caller;               /*    16     8 */
	struct {
		struct Coroutine * sle_next;             /*    24     8 */
	} pool_next;                                     /*    24     8 */
	size_t                     locks_held;           /*    32     8 */
	struct {
		struct Coroutine * sqh_first;            /*    40     8 */
		struct Coroutine * * sqh_last;           /*    48     8 */
	} co_queue_wakeup;                               /*    40    16 */
	struct {
		struct Coroutine * sqe_next;             /*    56     8 */
	} co_queue_next;                                 /*    56     8 */

	/* size: 64, cachelines: 1, members: 7 */
};
struct CoQueue {
	struct {
		struct Coroutine * sqh_first;            /*     0     8 */
		struct Coroutine * * sqh_last;           /*     8     8 */
	} entries;                                       /*     0    16 */

	/* size: 16, cachelines: 1, members: 1 */
	/* last cacheline: 16 bytes */
};
struct BlockJob {
	const BlockJobDriver  *    driver;               /*     0     8 */
	BlockBackend *             blk;                  /*     8     8 */
	char *                     id;                   /*    16     8 */
	Coroutine *                co;                   /*    24     8 */
	_Bool                      cancelled;            /*    32     1 */

	/* XXX 3 bytes hole, try to pack */

	int                        pause_count;          /*    36     4 */
	_Bool                      user_paused;          /*    40     1 */
	_Bool                      busy;                 /*    41     1 */
	_Bool                      paused;               /*    42     1 */
	_Bool                      ready;                /*    43     1 */
	_Bool                      deferred_to_main_loop; /*    44     1 */

	/* XXX 3 bytes hole, try to pack */

	struct {
		struct BlockJob *  le_next;              /*    48     8 */
		struct BlockJob * * le_prev;             /*    56     8 */
	} job_list;                                      /*    48    16 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	BlockDeviceIoStatus        iostatus;             /*    64     4 */

	/* XXX 4 bytes hole, try to pack */

	int64_t                    offset;               /*    72     8 */
	int64_t                    len;                  /*    80     8 */
	int64_t                    speed;                /*    88     8 */
	BlockCompletionFunc *      cb;                   /*    96     8 */
	Error *                    blocker;              /*   104     8 */
	GSList *                   nodes;                /*   112     8 */
	void *                     opaque;               /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	int                        refcnt;               /*   128     4 */
	_Bool                      completed;            /*   132     1 */

	/* XXX 3 bytes hole, try to pack */

	int                        ret;                  /*   136     4 */

	/* XXX 4 bytes hole, try to pack */

	BlockJobTxn *              txn;                  /*   144     8 */
	struct {
		struct BlockJob *  le_next;              /*   152     8 */
		struct BlockJob * * le_prev;             /*   160     8 */
	} txn_list;                                      /*   152    16 */

	/* size: 168, cachelines: 3, members: 25 */
	/* sum members: 151, holes: 5, sum holes: 17 */
	/* last cacheline: 40 bytes */
};
struct BlockDriver {
	const char  *              format_name;          /*     0     8 */
	int                        instance_size;        /*     8     4 */
	_Bool                      is_filter;            /*    12     1 */

	/* XXX 3 bytes hole, try to pack */

	_Bool                      (*bdrv_recurse_is_first_non_filter)(BlockDriverState *, BlockDriverState *); /*    16     8 */
	int                        (*bdrv_probe)(const uint8_t  *, int, const char  *); /*    24     8 */
	int                        (*bdrv_probe_device)(const char  *); /*    32     8 */
	void                       (*bdrv_parse_filename)(const char  *, QDict *, Error * *); /*    40     8 */
	_Bool                      bdrv_needs_filename;  /*    48     1 */
	_Bool                      supports_backing;     /*    49     1 */

	/* XXX 6 bytes hole, try to pack */

	int                        (*bdrv_reopen_prepare)(BDRVReopenState *, BlockReopenQueue *, Error * *); /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	void                       (*bdrv_reopen_commit)(BDRVReopenState *); /*    64     8 */
	void                       (*bdrv_reopen_abort)(BDRVReopenState *); /*    72     8 */
	void                       (*bdrv_join_options)(QDict *, QDict *); /*    80     8 */
	int                        (*bdrv_open)(BlockDriverState *, QDict *, int, Error * *); /*    88     8 */
	int                        (*bdrv_file_open)(BlockDriverState *, QDict *, int, Error * *); /*    96     8 */
	void                       (*bdrv_close)(BlockDriverState *); /*   104     8 */
	int                        (*bdrv_create)(const char  *, QemuOpts *, Error * *); /*   112     8 */
	int                        (*bdrv_set_key)(BlockDriverState *, const char  *); /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	int                        (*bdrv_make_empty)(BlockDriverState *); /*   128     8 */
	void                       (*bdrv_refresh_filename)(BlockDriverState *, QDict *); /*   136     8 */
	BlockAIOCB *               (*bdrv_aio_readv)(BlockDriverState *, int64_t, QEMUIOVector *, int, BlockCompletionFunc *, void *); /*   144     8 */
	BlockAIOCB *               (*bdrv_aio_writev)(BlockDriverState *, int64_t, QEMUIOVector *, int, BlockCompletionFunc *, void *); /*   152     8 */
	BlockAIOCB *               (*bdrv_aio_flush)(BlockDriverState *, BlockCompletionFunc *, void *); /*   160     8 */
	BlockAIOCB *               (*bdrv_aio_pdiscard)(BlockDriverState *, int64_t, int, BlockCompletionFunc *, void *); /*   168     8 */
	int                        (*bdrv_co_readv)(BlockDriverState *, int64_t, int, QEMUIOVector *); /*   176     8 */
	int                        (*bdrv_co_preadv)(BlockDriverState *, uint64_t, uint64_t, QEMUIOVector *, int); /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	int                        (*bdrv_co_writev)(BlockDriverState *, int64_t, int, QEMUIOVector *); /*   192     8 */
	int                        (*bdrv_co_writev_flags)(BlockDriverState *, int64_t, int, QEMUIOVector *, int); /*   200     8 */
	int                        (*bdrv_co_pwritev)(BlockDriverState *, uint64_t, uint64_t, QEMUIOVector *, int); /*   208     8 */
	int                        (*bdrv_co_pwrite_zeroes)(BlockDriverState *, int64_t, int, BdrvRequestFlags); /*   216     8 */
	int                        (*bdrv_co_pdiscard)(BlockDriverState *, int64_t, int); /*   224     8 */
	int64_t                    (*bdrv_co_get_block_status)(BlockDriverState *, int64_t, int, int *, BlockDriverState * *); /*   232     8 */
	void                       (*bdrv_invalidate_cache)(BlockDriverState *, Error * *); /*   240     8 */
	int                        (*bdrv_inactivate)(BlockDriverState *); /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	int                        (*bdrv_co_flush)(BlockDriverState *); /*   256     8 */
	int                        (*bdrv_co_flush_to_disk)(BlockDriverState *); /*   264     8 */
	int                        (*bdrv_co_flush_to_os)(BlockDriverState *); /*   272     8 */
	const char  *              protocol_name;        /*   280     8 */
	int                        (*bdrv_truncate)(BlockDriverState *, int64_t); /*   288     8 */
	int64_t                    (*bdrv_getlength)(BlockDriverState *); /*   296     8 */
	_Bool                      has_variable_length;  /*   304     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    (*bdrv_get_allocated_file_size)(BlockDriverState *); /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	int                        (*bdrv_co_pwritev_compressed)(BlockDriverState *, uint64_t, uint64_t, QEMUIOVector *); /*   320     8 */
	int                        (*bdrv_snapshot_create)(BlockDriverState *, QEMUSnapshotInfo *); /*   328     8 */
	int                        (*bdrv_snapshot_goto)(BlockDriverState *, const char  *); /*   336     8 */
	int                        (*bdrv_snapshot_delete)(BlockDriverState *, const char  *, const char  *, Error * *); /*   344     8 */
	int                        (*bdrv_snapshot_list)(BlockDriverState *, QEMUSnapshotInfo * *); /*   352     8 */
	int                        (*bdrv_snapshot_load_tmp)(BlockDriverState *, const char  *, const char  *, Error * *); /*   360     8 */
	int                        (*bdrv_get_info)(BlockDriverState *, BlockDriverInfo *); /*   368     8 */
	ImageInfoSpecific *        (*bdrv_get_specific_info)(BlockDriverState *); /*   376     8 */
	/* --- cacheline 6 boundary (384 bytes) --- */
	int                        (*bdrv_save_vmstate)(BlockDriverState *, QEMUIOVector *, int64_t); /*   384     8 */
	int                        (*bdrv_load_vmstate)(BlockDriverState *, QEMUIOVector *, int64_t); /*   392     8 */
	int                        (*bdrv_change_backing_file)(BlockDriverState *, const char  *, const char  *); /*   400     8 */
	_Bool                      (*bdrv_is_inserted)(BlockDriverState *); /*   408     8 */
	int                        (*bdrv_media_changed)(BlockDriverState *); /*   416     8 */
	void                       (*bdrv_eject)(BlockDriverState *, _Bool); /*   424     8 */
	void                       (*bdrv_lock_medium)(BlockDriverState *, _Bool); /*   432     8 */
	BlockAIOCB *               (*bdrv_aio_ioctl)(BlockDriverState *, long unsigned int, void *, BlockCompletionFunc *, void *); /*   440     8 */
	/* --- cacheline 7 boundary (448 bytes) --- */
	int                        (*bdrv_co_ioctl)(BlockDriverState *, long unsigned int, void *); /*   448     8 */
	QemuOptsList *             create_opts;          /*   456     8 */
	int                        (*bdrv_check)(BlockDriverState *, BdrvCheckResult *, BdrvCheckMode); /*   464     8 */
	int                        (*bdrv_amend_options)(BlockDriverState *, QemuOpts *, BlockDriverAmendStatusCB *, void *); /*   472     8 */
	void                       (*bdrv_debug_event)(BlockDriverState *, BlkdebugEvent); /*   480     8 */
	int                        (*bdrv_debug_breakpoint)(BlockDriverState *, const char  *, const char  *); /*   488     8 */
	int                        (*bdrv_debug_remove_breakpoint)(BlockDriverState *, const char  *); /*   496     8 */
	int                        (*bdrv_debug_resume)(BlockDriverState *, const char  *); /*   504     8 */
	/* --- cacheline 8 boundary (512 bytes) --- */
	_Bool                      (*bdrv_debug_is_suspended)(BlockDriverState *, const char  *); /*   512     8 */
	void                       (*bdrv_refresh_limits)(BlockDriverState *, Error * *); /*   520     8 */
	int                        (*bdrv_has_zero_init)(BlockDriverState *); /*   528     8 */
	void                       (*bdrv_detach_aio_context)(BlockDriverState *); /*   536     8 */
	void                       (*bdrv_attach_aio_context)(BlockDriverState *, AioContext *); /*   544     8 */
	void                       (*bdrv_io_plug)(BlockDriverState *); /*   552     8 */
	void                       (*bdrv_io_unplug)(BlockDriverState *); /*   560     8 */
	int                        (*bdrv_probe_blocksizes)(BlockDriverState *, BlockSizes *); /*   568     8 */
	/* --- cacheline 9 boundary (576 bytes) --- */
	int                        (*bdrv_probe_geometry)(BlockDriverState *, HDGeometry *); /*   576     8 */
	void                       (*bdrv_drain)(BlockDriverState *); /*   584     8 */
	void                       (*bdrv_add_child)(BlockDriverState *, BlockDriverState *, Error * *); /*   592     8 */
	void                       (*bdrv_del_child)(BlockDriverState *, BdrvChild *, Error * *); /*   600     8 */
	struct {
		struct BlockDriver * le_next;            /*   608     8 */
		struct BlockDriver * * le_prev;          /*   616     8 */
	} list;                                          /*   608    16 */

	/* size: 624, cachelines: 10, members: 79 */
	/* sum members: 608, holes: 3, sum holes: 16 */
	/* last cacheline: 48 bytes */
};
struct BdrvChild {
	BlockDriverState *         bs;                   /*     0     8 */
	char *                     name;                 /*     8     8 */
	const BdrvChildRole  *     role;                 /*    16     8 */
	void *                     opaque;               /*    24     8 */
	struct {
		struct BdrvChild * le_next;              /*    32     8 */
		struct BdrvChild * * le_prev;            /*    40     8 */
	} next;                                          /*    32    16 */
	struct {
		struct BdrvChild * le_next;              /*    48     8 */
		struct BdrvChild * * le_prev;            /*    56     8 */
	} next_parent;                                   /*    48    16 */

	/* size: 64, cachelines: 1, members: 6 */
};
struct BdrvChildRole {
	void                       (*inherit_options)(int *, QDict *, int, QDict *); /*     0     8 */
	void                       (*change_media)(BdrvChild *, _Bool); /*     8     8 */
	void                       (*resize)(BdrvChild *); /*    16     8 */
	const char  *              (*get_name)(BdrvChild *); /*    24     8 */
	void                       (*drained_begin)(BdrvChild *); /*    32     8 */
	void                       (*drained_end)(BdrvChild *); /*    40     8 */

	/* size: 48, cachelines: 1, members: 6 */
	/* last cacheline: 48 bytes */
};
struct BlockDriverInfo {
	int                        cluster_size;         /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	int64_t                    vm_state_offset;      /*     8     8 */
	_Bool                      is_dirty;             /*    16     1 */
	_Bool                      unallocated_blocks_are_zero; /*    17     1 */
	_Bool                      can_write_zeroes_with_unmap; /*    18     1 */
	_Bool                      needs_compressed_writes; /*    19     1 */

	/* size: 24, cachelines: 1, members: 6 */
	/* sum members: 16, holes: 1, sum holes: 4 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct BlockFragInfo {
	uint64_t                   allocated_clusters;   /*     0     8 */
	uint64_t                   total_clusters;       /*     8     8 */
	uint64_t                   fragmented_clusters;  /*    16     8 */
	uint64_t                   compressed_clusters;  /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* last cacheline: 32 bytes */
};
struct BlockSizes {
	uint32_t                   phys;                 /*     0     4 */
	uint32_t                   log;                  /*     4     4 */

	/* size: 8, cachelines: 1, members: 2 */
	/* last cacheline: 8 bytes */
};
struct HDGeometry {
	uint32_t                   heads;                /*     0     4 */
	uint32_t                   sectors;              /*     4     4 */
	uint32_t                   cylinders;            /*     8     4 */

	/* size: 12, cachelines: 1, members: 3 */
	/* last cacheline: 12 bytes */
};
struct BlockReopenQueue {
	struct BlockReopenQueueEntry * sqh_first;        /*     0     8 */
	struct BlockReopenQueueEntry * * sqh_last;       /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct BDRVReopenState {
	BlockDriverState *         bs;                   /*     0     8 */
	int                        flags;                /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	QDict *                    options;              /*    16     8 */
	QDict *                    explicit_options;     /*    24     8 */
	void *                     opaque;               /*    32     8 */

	/* size: 40, cachelines: 1, members: 5 */
	/* sum members: 36, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct BdrvCheckResult {
	int                        corruptions;          /*     0     4 */
	int                        leaks;                /*     4     4 */
	int                        check_errors;         /*     8     4 */
	int                        corruptions_fixed;    /*    12     4 */
	int                        leaks_fixed;          /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	int64_t                    image_end_offset;     /*    24     8 */
	BlockFragInfo              bfi;                  /*    32    32 */

	/* size: 64, cachelines: 1, members: 7 */
	/* sum members: 60, holes: 1, sum holes: 4 */
};
struct BdrvNextIterator {
	enum {
		BDRV_NEXT_BACKEND_ROOTS = 0,
		BDRV_NEXT_MONITOR_OWNED = 1,
	} phase;                                         /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	BlockBackend *             blk;                  /*     8     8 */
	BlockDriverState *         bs;                   /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct NetClientInfo {
	NetClientDriver            type;                 /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	size_t                     size;                 /*     8     8 */
	NetReceive *               receive;              /*    16     8 */
	NetReceive *               receive_raw;          /*    24     8 */
	NetReceiveIOV *            receive_iov;          /*    32     8 */
	NetCanReceive *            can_receive;          /*    40     8 */
	NetCleanup *               cleanup;              /*    48     8 */
	LinkStatusChanged *        link_status_changed;  /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	QueryRxFilter *            query_rx_filter;      /*    64     8 */
	NetPoll *                  poll;                 /*    72     8 */
	HasUfo *                   has_ufo;              /*    80     8 */
	HasVnetHdr *               has_vnet_hdr;         /*    88     8 */
	HasVnetHdrLen *            has_vnet_hdr_len;     /*    96     8 */
	UsingVnetHdr *             using_vnet_hdr;       /*   104     8 */
	SetOffload *               set_offload;          /*   112     8 */
	SetVnetHdrLen *            set_vnet_hdr_len;     /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	SetVnetLE *                set_vnet_le;          /*   128     8 */
	SetVnetBE *                set_vnet_be;          /*   136     8 */

	/* size: 144, cachelines: 3, members: 18 */
	/* sum members: 140, holes: 1, sum holes: 4 */
	/* last cacheline: 16 bytes */
};
struct NetFilterHead {
	struct NetFilterState *    tqh_first;            /*     0     8 */
	struct NetFilterState * *  tqh_last;             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct QString {
	QObject                    base;                 /*     0    16 */
	char *                     string;               /*    16     8 */
	size_t                     length;               /*    24     8 */
	size_t                     capacity;             /*    32     8 */

	/* size: 40, cachelines: 1, members: 4 */
	/* last cacheline: 40 bytes */
};
struct CharBackend {
	CharDriverState *          chr;                  /*     0     8 */
	IOEventHandler *           chr_event;            /*     8     8 */
	IOCanReadHandler *         chr_can_read;         /*    16     8 */
	IOReadHandler *            chr_read;             /*    24     8 */
	void *                     opaque;               /*    32     8 */
	int                        tag;                  /*    40     4 */
	int                        fe_open;              /*    44     4 */

	/* size: 48, cachelines: 1, members: 7 */
	/* last cacheline: 48 bytes */
};
struct ReadLineState {
	char                       cmd_buf[4096];        /*     0  4096 */
	/* --- cacheline 64 boundary (4096 bytes) --- */
	int                        cmd_buf_index;        /*  4096     4 */
	int                        cmd_buf_size;         /*  4100     4 */
	char                       last_cmd_buf[4096];   /*  4104  4096 */
	/* --- cacheline 128 boundary (8192 bytes) was 8 bytes ago --- */
	int                        last_cmd_buf_index;   /*  8200     4 */
	int                        last_cmd_buf_size;    /*  8204     4 */
	int                        esc_state;            /*  8208     4 */
	int                        esc_param;            /*  8212     4 */
	char *                     history[64];          /*  8216   512 */
	/* --- cacheline 136 boundary (8704 bytes) was 24 bytes ago --- */
	int                        hist_entry;           /*  8728     4 */

	/* XXX 4 bytes hole, try to pack */

	ReadLineCompletionFunc *   completion_finder;    /*  8736     8 */
	char *                     completions[256];     /*  8744  2048 */
	/* --- cacheline 168 boundary (10752 bytes) was 40 bytes ago --- */
	int                        nb_completions;       /* 10792     4 */
	int                        completion_index;     /* 10796     4 */
	ReadLineFunc *             readline_func;        /* 10800     8 */
	void *                     readline_opaque;      /* 10808     8 */
	/* --- cacheline 169 boundary (10816 bytes) --- */
	int                        read_password;        /* 10816     4 */
	char                       prompt[256];          /* 10820   256 */

	/* XXX 4 bytes hole, try to pack */

	/* --- cacheline 173 boundary (11072 bytes) was 8 bytes ago --- */
	ReadLinePrintfFunc *       printf_func;          /* 11080     8 */
	ReadLineFlushFunc *        flush_func;           /* 11088     8 */
	void *                     opaque;               /* 11096     8 */

	/* size: 11104, cachelines: 174, members: 21 */
	/* sum members: 11096, holes: 2, sum holes: 8 */
	/* last cacheline: 32 bytes */
};
struct QEMUSnapshotInfo {
	char                       id_str[128];          /*     0   128 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	char                       name[256];            /*   128   256 */
	/* --- cacheline 6 boundary (384 bytes) --- */
	uint64_t                   vm_state_size;        /*   384     8 */
	uint32_t                   date_sec;             /*   392     4 */
	uint32_t                   date_nsec;            /*   396     4 */
	uint64_t                   vm_clock_nsec;        /*   400     8 */

	/* size: 408, cachelines: 7, members: 6 */
	/* last cacheline: 24 bytes */
};
struct BdrvTrackedRequest {
	BlockDriverState *         bs;                   /*     0     8 */
	int64_t                    offset;               /*     8     8 */
	unsigned int               bytes;                /*    16     4 */
	enum BdrvTrackedRequestType type;                /*    20     4 */
	_Bool                      serialising;          /*    24     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    overlap_offset;       /*    32     8 */
	unsigned int               overlap_bytes;        /*    40     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		struct BdrvTrackedRequest * le_next;     /*    48     8 */
		struct BdrvTrackedRequest * * le_prev;   /*    56     8 */
	} list;                                          /*    48    16 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	Coroutine *                co;                   /*    64     8 */
	CoQueue                    wait_queue;           /*    72    16 */
	struct BdrvTrackedRequest * waiting_for;         /*    88     8 */

	/* size: 96, cachelines: 2, members: 11 */
	/* sum members: 85, holes: 2, sum holes: 11 */
	/* last cacheline: 32 bytes */
};
struct BlockLimits {
	uint32_t                   request_alignment;    /*     0     4 */
	int32_t                    max_pdiscard;         /*     4     4 */
	uint32_t                   pdiscard_alignment;   /*     8     4 */
	int32_t                    max_pwrite_zeroes;    /*    12     4 */
	uint32_t                   pwrite_zeroes_alignment; /*    16     4 */
	uint32_t                   opt_transfer;         /*    20     4 */
	uint32_t                   max_transfer;         /*    24     4 */

	/* XXX 4 bytes hole, try to pack */

	size_t                     min_mem_alignment;    /*    32     8 */
	size_t                     opt_mem_alignment;    /*    40     8 */
	int                        max_iov;              /*    48     4 */

	/* size: 56, cachelines: 1, members: 10 */
	/* sum members: 48, holes: 1, sum holes: 4 */
	/* padding: 4 */
	/* last cacheline: 56 bytes */
};
struct BdrvAioNotifier {
	void                       (*attached_aio_context)(AioContext *, void *); /*     0     8 */
	void                       (*detach_aio_context)(void *); /*     8     8 */
	void *                     opaque;               /*    16     8 */
	_Bool                      deleted;              /*    24     1 */

	/* XXX 7 bytes hole, try to pack */

	struct {
		struct BdrvAioNotifier * le_next;        /*    32     8 */
		struct BdrvAioNotifier * * le_prev;      /*    40     8 */
	} list;                                          /*    32    16 */

	/* size: 48, cachelines: 1, members: 5 */
	/* sum members: 41, holes: 1, sum holes: 7 */
	/* last cacheline: 48 bytes */
};
struct capture_ops {
	void                       (*info)(void *);      /*     0     8 */
	void                       (*destroy)(void *);   /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct CaptureState {
	void *                     opaque;               /*     0     8 */
	struct capture_ops         ops;                  /*     8    16 */
	struct {
		struct CaptureState * le_next;           /*    24     8 */
		struct CaptureState * * le_prev;         /*    32     8 */
	} entries;                                       /*    24    16 */

	/* size: 40, cachelines: 1, members: 3 */
	/* last cacheline: 40 bytes */
};
struct qemu_acl_entry {
	char *                     match;                /*     0     8 */
	int                        deny;                 /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		struct qemu_acl_entry * tqe_next;        /*    16     8 */
		struct qemu_acl_entry * * tqe_prev;      /*    24     8 */
	} next;                                          /*    16    16 */

	/* size: 32, cachelines: 1, members: 3 */
	/* sum members: 28, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct qemu_acl {
	char *                     aclname;              /*     0     8 */
	unsigned int               nentries;             /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		struct qemu_acl_entry * tqh_first;       /*    16     8 */
		struct qemu_acl_entry * * tqh_last;      /*    24     8 */
	} entries;                                       /*    16    16 */
	int                        defaultDeny;          /*    32     4 */

	/* size: 40, cachelines: 1, members: 4 */
	/* sum members: 32, holes: 1, sum holes: 4 */
	/* padding: 4 */
	/* last cacheline: 40 bytes */
};
struct QInt {
	QObject                    base;                 /*     0    16 */
	int64_t                    value;                /*    16     8 */

	/* size: 24, cachelines: 1, members: 2 */
	/* last cacheline: 24 bytes */
};
struct QFloat {
	QObject                    base;                 /*     0    16 */
	double                     value;                /*    16     8 */

	/* size: 24, cachelines: 1, members: 2 */
	/* last cacheline: 24 bytes */
};
struct QBool {
	QObject                    base;                 /*     0    16 */
	_Bool                      value;                /*    16     1 */

	/* size: 24, cachelines: 1, members: 2 */
	/* padding: 7 */
	/* last cacheline: 24 bytes */
};
struct JSONLexer {
	JSONLexerEmitter *         emit;                 /*     0     8 */
	int                        state;                /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	GString *                  token;                /*    16     8 */
	int                        x;                    /*    24     4 */
	int                        y;                    /*    28     4 */

	/* size: 32, cachelines: 1, members: 5 */
	/* sum members: 28, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct JSONMessageParser {
	void                       (*emit)(struct JSONMessageParser *, GQueue *); /*     0     8 */
	JSONLexer                  lexer;                /*     8    32 */
	int                        brace_count;          /*    40     4 */
	int                        bracket_count;        /*    44     4 */
	GQueue *                   tokens;               /*    48     8 */
	uint64_t                   token_size;           /*    56     8 */

	/* size: 64, cachelines: 1, members: 6 */
};
struct TraceEventIter {
	size_t                     event;                /*     0     8 */
	size_t                     group;                /*     8     8 */
	const char  *              pattern;              /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct QEMULogItem {
	int                        mask;                 /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	const char  *              name;                 /*     8     8 */
	const char  *              help;                 /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct QmpCommand {
	const char  *              name;                 /*     0     8 */
	QmpCommandFunc *           fn;                   /*     8     8 */
	QmpCommandOptions          options;              /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		struct QmpCommand * tqe_next;            /*    24     8 */
		struct QmpCommand * * tqe_prev;          /*    32     8 */
	} node;                                          /*    24    16 */
	_Bool                      enabled;              /*    40     1 */

	/* size: 48, cachelines: 1, members: 5 */
	/* sum members: 37, holes: 1, sum holes: 4 */
	/* padding: 7 */
	/* last cacheline: 48 bytes */
};
struct mon_cmd_t {
	const char  *              name;                 /*     0     8 */
	const char  *              args_type;            /*     8     8 */
	const char  *              params;               /*    16     8 */
	const char  *              help;                 /*    24     8 */
	void                       (*cmd)(Monitor *, const QDict  *); /*    32     8 */
	struct mon_cmd_t *         sub_table;            /*    40     8 */
	void                       (*command_completion)(ReadLineState *, int, const char  *); /*    48     8 */

	/* size: 56, cachelines: 1, members: 7 */
	/* last cacheline: 56 bytes */
};
struct mon_fd_t {
	char *                     name;                 /*     0     8 */
	int                        fd;                   /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		struct mon_fd_t *  le_next;              /*    16     8 */
		struct mon_fd_t * * le_prev;             /*    24     8 */
	} next;                                          /*    16    16 */

	/* size: 32, cachelines: 1, members: 3 */
	/* sum members: 28, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct MonFdsetFd {
	int                        fd;                   /*     0     4 */
	_Bool                      removed;              /*     4     1 */

	/* XXX 3 bytes hole, try to pack */

	char *                     opaque;               /*     8     8 */
	struct {
		struct MonFdsetFd * le_next;             /*    16     8 */
		struct MonFdsetFd * * le_prev;           /*    24     8 */
	} next;                                          /*    16    16 */

	/* size: 32, cachelines: 1, members: 4 */
	/* sum members: 29, holes: 1, sum holes: 3 */
	/* last cacheline: 32 bytes */
};
struct MonFdset {
	int64_t                    id;                   /*     0     8 */
	struct {
		struct MonFdsetFd * lh_first;            /*     8     8 */
	} fds;                                           /*     8     8 */
	struct {
		struct MonFdsetFd * lh_first;            /*    16     8 */
	} dup_fds;                                       /*    16     8 */
	struct {
		struct MonFdset *  le_next;              /*    24     8 */
		struct MonFdset * * le_prev;             /*    32     8 */
	} next;                                          /*    24    16 */

	/* size: 40, cachelines: 1, members: 4 */
	/* last cacheline: 40 bytes */
};
struct MonitorQAPIEventState {
	QAPIEvent                  event;                /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	QDict *                    data;                 /*     8     8 */
	QEMUTimer *                timer;                /*    16     8 */
	QDict *                    qdict;                /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* sum members: 28, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct mon_list {
	struct Monitor *           lh_first;             /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct mon_fdsets {
	struct MonFdset *          lh_first;             /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct capture_list_head {
	struct CaptureState *      lh_first;             /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct ChardevCommon {
	_Bool                      has_logfile;          /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	char *                     logfile;              /*     8     8 */
	_Bool                      has_logappend;        /*    16     1 */
	_Bool                      logappend;            /*    17     1 */

	/* size: 24, cachelines: 1, members: 4 */
	/* sum members: 11, holes: 1, sum holes: 7 */
	/* padding: 6 */
	/* last cacheline: 24 bytes */
};
struct GDBRegisterState {
	int                        base_reg;             /*     0     4 */
	int                        num_regs;             /*     4     4 */
	gdb_reg_cb                 get_reg;              /*     8     8 */
	gdb_reg_cb                 set_reg;              /*    16     8 */
	const char  *              xml;                  /*    24     8 */
	struct GDBRegisterState *  next;                 /*    32     8 */

	/* size: 40, cachelines: 1, members: 6 */
	/* last cacheline: 40 bytes */
};
struct GDBState {
	CPUState *                 c_cpu;                /*     0     8 */
	CPUState *                 g_cpu;                /*     8     8 */
	CPUState *                 query_cpu;            /*    16     8 */
	enum RSState               state;                /*    24     4 */
	char                       line_buf[4096];       /*    28  4096 */
	/* --- cacheline 64 boundary (4096 bytes) was 28 bytes ago --- */
	int                        line_buf_index;       /*  4124     4 */
	int                        line_csum;            /*  4128     4 */
	uint8_t                    last_packet[4100];    /*  4132  4100 */
	/* --- cacheline 128 boundary (8192 bytes) was 40 bytes ago --- */
	int                        last_packet_len;      /*  8232     4 */
	int                        signal;               /*  8236     4 */
	CharBackend                chr;                  /*  8240    48 */
	/* --- cacheline 129 boundary (8256 bytes) was 32 bytes ago --- */
	CharDriverState *          mon_chr;              /*  8288     8 */
	char                       syscall_buf[256];     /*  8296   256 */
	/* --- cacheline 133 boundary (8512 bytes) was 40 bytes ago --- */
	gdb_syscall_complete_cb    current_syscall_cb;   /*  8552     8 */

	/* size: 8560, cachelines: 134, members: 14 */
	/* last cacheline: 48 bytes */
};
struct BalloonInfo {
	int64_t                    actual;               /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct MemoryRegionPortio {
	uint32_t                   offset;               /*     0     4 */
	uint32_t                   len;                  /*     4     4 */
	unsigned int               size;                 /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	uint32_t                   (*read)(void *, uint32_t); /*    16     8 */
	void                       (*write)(void *, uint32_t, uint32_t); /*    24     8 */
	uint32_t                   base;                 /*    32     4 */

	/* size: 40, cachelines: 1, members: 6 */
	/* sum members: 32, holes: 1, sum holes: 4 */
	/* padding: 4 */
	/* last cacheline: 40 bytes */
};
struct PortioList {
	const struct MemoryRegionPortio  * ports;        /*     0     8 */
	Object *                   owner;                /*     8     8 */
	struct MemoryRegion *      address_space;        /*    16     8 */
	unsigned int               nr;                   /*    24     4 */

	/* XXX 4 bytes hole, try to pack */

	struct MemoryRegion * *    regions;              /*    32     8 */
	void *                     opaque;               /*    40     8 */
	const char  *              name;                 /*    48     8 */
	_Bool                      flush_coalesced_mmio; /*    56     1 */

	/* size: 64, cachelines: 1, members: 8 */
	/* sum members: 53, holes: 1, sum holes: 4 */
	/* padding: 7 */
};
struct MemoryRegionPortioList {
	MemoryRegion               mr;                   /*     0   256 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	void *                     portio_opaque;        /*   256     8 */
	MemoryRegionPortio         ports[];              /*   264     0 */

	/* size: 272, cachelines: 5, members: 3 */
	/* padding: 8 */
	/* last cacheline: 16 bytes */
};
struct uint16List {
	uint16List *               next;                 /*     0     8 */
	uint16_t                   value;                /*     8     2 */

	/* size: 16, cachelines: 1, members: 2 */
	/* padding: 6 */
	/* last cacheline: 16 bytes */
};
struct Memdev {
	uint64_t                   size;                 /*     0     8 */
	_Bool                      merge;                /*     8     1 */
	_Bool                      dump;                 /*     9     1 */
	_Bool                      prealloc;             /*    10     1 */

	/* XXX 5 bytes hole, try to pack */

	uint16List *               host_nodes;           /*    16     8 */
	HostMemPolicy              policy;               /*    24     4 */

	/* size: 32, cachelines: 1, members: 6 */
	/* sum members: 23, holes: 1, sum holes: 5 */
	/* padding: 4 */
	/* last cacheline: 32 bytes */
};
struct MemdevList {
	MemdevList *               next;                 /*     0     8 */
	Memdev *                   value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct MemoryDeviceInfo {
	MemoryDeviceInfoKind       type;                 /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	union {
		q_obj_PCDIMMDeviceInfo_wrapper dimm;     /*     8     8 */
	} u;                                             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* sum members: 12, holes: 1, sum holes: 4 */
	/* last cacheline: 16 bytes */
};
struct MemoryDeviceInfoList {
	MemoryDeviceInfoList *     next;                 /*     0     8 */
	MemoryDeviceInfo *         value;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct NumaNodeOptions {
	_Bool                      has_nodeid;           /*     0     1 */

	/* XXX 1 byte hole, try to pack */

	uint16_t                   nodeid;               /*     2     2 */
	_Bool                      has_cpus;             /*     4     1 */

	/* XXX 3 bytes hole, try to pack */

	uint16List *               cpus;                 /*     8     8 */
	_Bool                      has_mem;              /*    16     1 */

	/* XXX 7 bytes hole, try to pack */

	uint64_t                   mem;                  /*    24     8 */
	_Bool                      has_memdev;           /*    32     1 */

	/* XXX 7 bytes hole, try to pack */

	char *                     memdev;               /*    40     8 */

	/* size: 48, cachelines: 1, members: 8 */
	/* sum members: 30, holes: 4, sum holes: 18 */
	/* last cacheline: 48 bytes */
};
struct NumaOptions {
	NumaOptionsKind            type;                 /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	union {
		q_obj_NumaNodeOptions_wrapper node;      /*     8     8 */
	} u;                                             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* sum members: 12, holes: 1, sum holes: 4 */
	/* last cacheline: 16 bytes */
};
struct PCDIMMDeviceInfo {
	_Bool                      has_id;               /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	char *                     id;                   /*     8     8 */
	int64_t                    addr;                 /*    16     8 */
	int64_t                    size;                 /*    24     8 */
	int64_t                    slot;                 /*    32     8 */
	int64_t                    node;                 /*    40     8 */
	char *                     memdev;               /*    48     8 */
	_Bool                      hotplugged;           /*    56     1 */
	_Bool                      hotpluggable;         /*    57     1 */

	/* size: 64, cachelines: 1, members: 9 */
	/* sum members: 51, holes: 1, sum holes: 7 */
	/* padding: 6 */
};
struct q_obj_NumaNodeOptions_wrapper {
	NumaNodeOptions *          data;                 /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct q_obj_PCDIMMDeviceInfo_wrapper {
	PCDIMMDeviceInfo *         data;                 /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct HostMemoryBackend {
	Object                     parent;               /*     0    40 */
	uint64_t                   size;                 /*    40     8 */
	_Bool                      merge;                /*    48     1 */
	_Bool                      dump;                 /*    49     1 */
	_Bool                      prealloc;             /*    50     1 */
	_Bool                      force_prealloc;       /*    51     1 */
	_Bool                      is_mapped;            /*    52     1 */

	/* XXX 3 bytes hole, try to pack */

	long unsigned int          host_nodes[3];        /*    56    24 */
	/* --- cacheline 1 boundary (64 bytes) was 16 bytes ago --- */
	HostMemPolicy              policy;               /*    80     4 */

	/* XXX 12 bytes hole, try to pack */

	MemoryRegion               mr;                   /*    96   256 */

	/* size: 352, cachelines: 6, members: 10 */
	/* sum members: 337, holes: 2, sum holes: 15 */
	/* last cacheline: 32 bytes */
};
struct numa_addr_range {
	ram_addr_t                 mem_start;            /*     0     8 */
	ram_addr_t                 mem_end;              /*     8     8 */
	struct {
		struct numa_addr_range * le_next;        /*    16     8 */
		struct numa_addr_range * * le_prev;      /*    24     8 */
	} entry;                                         /*    16    16 */

	/* size: 32, cachelines: 1, members: 3 */
	/* last cacheline: 32 bytes */
};
struct node_info {
	uint64_t                   node_mem;             /*     0     8 */
	long unsigned int          node_cpu[5];          /*     8    40 */
	struct HostMemoryBackend * node_memdev;          /*    48     8 */
	_Bool                      present;              /*    56     1 */

	/* XXX 7 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) --- */
	struct {
		struct numa_addr_range * lh_first;       /*    64     8 */
	} addr;                                          /*    64     8 */

	/* size: 72, cachelines: 2, members: 5 */
	/* sum members: 65, holes: 1, sum holes: 7 */
	/* last cacheline: 8 bytes */
};
struct TypeInfo {
	const char  *              name;                 /*     0     8 */
	const char  *              parent;               /*     8     8 */
	size_t                     instance_size;        /*    16     8 */
	void                       (*instance_init)(Object *); /*    24     8 */
	void                       (*instance_post_init)(Object *); /*    32     8 */
	void                       (*instance_finalize)(Object *); /*    40     8 */
	_Bool                      abstract;             /*    48     1 */

	/* XXX 7 bytes hole, try to pack */

	size_t                     class_size;           /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	void                       (*class_init)(ObjectClass *, void *); /*    64     8 */
	void                       (*class_base_init)(ObjectClass *, void *); /*    72     8 */
	void                       (*class_finalize)(ObjectClass *, void *); /*    80     8 */
	void *                     class_data;           /*    88     8 */
	InterfaceInfo *            interfaces;           /*    96     8 */

	/* size: 104, cachelines: 2, members: 13 */
	/* sum members: 97, holes: 1, sum holes: 7 */
	/* last cacheline: 40 bytes */
};
struct InterfaceInfo {
	const char  *              type;                 /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct AccelClass {
	ObjectClass                parent_class;         /*     0    96 */
	/* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */
	const char  *              opt_name;             /*    96     8 */
	const char  *              name;                 /*   104     8 */
	int                        (*available)(void);   /*   112     8 */
	int                        (*init_machine)(MachineState *); /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	_Bool *                    allowed;              /*   128     8 */

	/* size: 136, cachelines: 3, members: 6 */
	/* last cacheline: 8 bytes */
};
struct ObjectProperty {
	gchar *                    name;                 /*     0     8 */
	gchar *                    type;                 /*     8     8 */
	gchar *                    description;          /*    16     8 */
	ObjectPropertyAccessor *   get;                  /*    24     8 */
	ObjectPropertyAccessor *   set;                  /*    32     8 */
	ObjectPropertyResolve *    resolve;              /*    40     8 */
	ObjectPropertyRelease *    release;              /*    48     8 */
	void *                     opaque;               /*    56     8 */

	/* size: 64, cachelines: 1, members: 8 */
};
struct FWBootEntry {
	struct {
		struct FWBootEntry * tqe_next;           /*     0     8 */
		struct FWBootEntry * * tqe_prev;         /*     8     8 */
	} link;                                          /*     0    16 */
	int32_t                    bootindex;            /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	DeviceState *              dev;                  /*    24     8 */
	char *                     suffix;               /*    32     8 */

	/* size: 40, cachelines: 1, members: 4 */
	/* sum members: 36, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct AdapterInfo {
	uint64_t                   ind_addr;             /*     0     8 */
	uint64_t                   summary_addr;         /*     8     8 */
	uint64_t                   ind_offset;           /*    16     8 */
	uint32_t                   summary_offset;       /*    24     4 */
	uint32_t                   adapter_id;           /*    28     4 */

	/* size: 32, cachelines: 1, members: 5 */
	/* last cacheline: 32 bytes */
};
struct MSIMessage {
	uint64_t                   address;              /*     0     8 */
	uint32_t                   data;                 /*     8     4 */

	/* size: 16, cachelines: 1, members: 2 */
	/* padding: 4 */
	/* last cacheline: 16 bytes */
};
struct PCIDevice {
	DeviceState                qdev;                 /*     0   112 */
	/* --- cacheline 1 boundary (64 bytes) was 48 bytes ago --- */
	uint8_t *                  config;               /*   112     8 */
	uint8_t *                  cmask;                /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	uint8_t *                  wmask;                /*   128     8 */
	uint8_t *                  w1cmask;              /*   136     8 */
	uint8_t *                  used;                 /*   144     8 */
	PCIBus *                   bus;                  /*   152     8 */
	int32_t                    devfn;                /*   160     4 */

	/* XXX 4 bytes hole, try to pack */

	PCIReqIDCache              requester_id_cache;   /*   168    16 */
	char                       name[64];             /*   184    64 */
	/* --- cacheline 3 boundary (192 bytes) was 56 bytes ago --- */
	PCIIORegion                io_regions[7];        /*   248   280 */
	/* --- cacheline 8 boundary (512 bytes) was 16 bytes ago --- */
	AddressSpace               bus_master_as;        /*   528   272 */
	/* --- cacheline 12 boundary (768 bytes) was 32 bytes ago --- */
	MemoryRegion               bus_master_enable_region; /*   800   256 */
	/* --- cacheline 16 boundary (1024 bytes) was 32 bytes ago --- */
	PCIConfigReadFunc *        config_read;          /*  1056     8 */
	PCIConfigWriteFunc *       config_write;         /*  1064     8 */
	MemoryRegion *             vga_regions[3];       /*  1072    24 */
	/* --- cacheline 17 boundary (1088 bytes) was 8 bytes ago --- */
	_Bool                      has_vga;              /*  1096     1 */
	uint8_t                    irq_state;            /*  1097     1 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   cap_present;          /*  1100     4 */
	uint8_t                    msix_cap;             /*  1104     1 */

	/* XXX 3 bytes hole, try to pack */

	int                        msix_entries_nr;      /*  1108     4 */
	uint8_t *                  msix_table;           /*  1112     8 */
	uint8_t *                  msix_pba;             /*  1120     8 */

	/* XXX 8 bytes hole, try to pack */

	MemoryRegion               msix_exclusive_bar;   /*  1136   256 */
	/* --- cacheline 21 boundary (1344 bytes) was 48 bytes ago --- */
	MemoryRegion               msix_table_mmio;      /*  1392   256 */
	/* --- cacheline 25 boundary (1600 bytes) was 48 bytes ago --- */
	MemoryRegion               msix_pba_mmio;        /*  1648   256 */
	/* --- cacheline 29 boundary (1856 bytes) was 48 bytes ago --- */
	unsigned int *             msix_entry_used;      /*  1904     8 */
	_Bool                      msix_function_masked; /*  1912     1 */

	/* XXX 3 bytes hole, try to pack */

	int32_t                    version_id;           /*  1916     4 */
	/* --- cacheline 30 boundary (1920 bytes) --- */
	uint8_t                    msi_cap;              /*  1920     1 */

	/* XXX 7 bytes hole, try to pack */

	PCIExpressDevice           exp;                  /*  1928    24 */
	SHPCDevice *               shpc;                 /*  1952     8 */
	char *                     romfile;              /*  1960     8 */
	_Bool                      has_rom;              /*  1968     1 */

	/* XXX 15 bytes hole, try to pack */

	/* --- cacheline 31 boundary (1984 bytes) --- */
	MemoryRegion               rom;                  /*  1984   256 */
	/* --- cacheline 35 boundary (2240 bytes) --- */
	uint32_t                   rom_bar;              /*  2240     4 */

	/* XXX 4 bytes hole, try to pack */

	PCIINTxRoutingNotifier     intx_routing_notifier; /*  2248     8 */
	MSIVectorUseNotifier       msix_vector_use_notifier; /*  2256     8 */
	MSIVectorReleaseNotifier   msix_vector_release_notifier; /*  2264     8 */
	MSIVectorPollNotifier      msix_vector_poll_notifier; /*  2272     8 */

	/* size: 2288, cachelines: 36, members: 40 */
	/* sum members: 2234, holes: 8, sum holes: 46 */
	/* padding: 8 */
	/* last cacheline: 48 bytes */
};
struct PCIEAERErr {
	uint32_t                   status;               /*     0     4 */
	uint16_t                   source_id;            /*     4     2 */
	uint16_t                   flags;                /*     6     2 */
	uint32_t                   header[4];            /*     8    16 */
	uint32_t                   prefix[4];            /*    24    16 */

	/* size: 40, cachelines: 1, members: 5 */
	/* last cacheline: 40 bytes */
};
struct PCIEAERLog {
	uint16_t                   log_num;              /*     0     2 */
	uint16_t                   log_max;              /*     2     2 */

	/* XXX 4 bytes hole, try to pack */

	PCIEAERErr *               log;                  /*     8     8 */

	/* size: 16, cachelines: 1, members: 3 */
	/* sum members: 12, holes: 1, sum holes: 4 */
	/* last cacheline: 16 bytes */
};
struct PCIExpressDevice {
	uint8_t                    exp_cap;              /*     0     1 */
	_Bool                      hpev_notified;        /*     1     1 */
	uint16_t                   aer_cap;              /*     2     2 */

	/* XXX 4 bytes hole, try to pack */

	PCIEAERLog                 aer_log;              /*     8    16 */

	/* size: 24, cachelines: 1, members: 4 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct kvm_guest_debug_arch {
	__u64                      debugreg[8];          /*     0    64 */

	/* size: 64, cachelines: 1, members: 1 */
};
struct kvm_userspace_memory_region {
	__u32                      slot;                 /*     0     4 */
	__u32                      flags;                /*     4     4 */
	__u64                      guest_phys_addr;      /*     8     8 */
	__u64                      memory_size;          /*    16     8 */
	__u64                      userspace_addr;       /*    24     8 */

	/* size: 32, cachelines: 1, members: 5 */
	/* last cacheline: 32 bytes */
};
struct kvm_irq_level {
	union {
		__u32              irq;                  /*     0     4 */
		__s32              status;               /*     0     4 */
	};                                               /*     0     4 */
	__u32                      level;                /*     4     4 */

	/* size: 8, cachelines: 1, members: 2 */
	/* last cacheline: 8 bytes */
};
struct kvm_coalesced_mmio_zone {
	__u64                      addr;                 /*     0     8 */
	__u32                      size;                 /*     8     4 */
	__u32                      pad;                  /*    12     4 */

	/* size: 16, cachelines: 1, members: 3 */
	/* last cacheline: 16 bytes */
};
struct kvm_coalesced_mmio {
	__u64                      phys_addr;            /*     0     8 */
	__u32                      len;                  /*     8     4 */
	__u32                      pad;                  /*    12     4 */
	__u8                       data[8];              /*    16     8 */

	/* size: 24, cachelines: 1, members: 4 */
	/* last cacheline: 24 bytes */
};
struct kvm_coalesced_mmio_ring {
	__u32                      first;                /*     0     4 */
	__u32                      last;                 /*     4     4 */
	struct kvm_coalesced_mmio  coalesced_mmio[];     /*     8     0 */

	/* size: 8, cachelines: 1, members: 3 */
	/* last cacheline: 8 bytes */
};
struct kvm_dirty_log {
	__u32                      slot;                 /*     0     4 */
	__u32                      padding1;             /*     4     4 */
	union {
		void *             dirty_bitmap;         /*     8     8 */
		__u64              padding2;             /*     8     8 */
	};                                               /*     8     8 */

	/* size: 16, cachelines: 1, members: 3 */
	/* last cacheline: 16 bytes */
};
struct kvm_signal_mask {
	__u32                      len;                  /*     0     4 */
	__u8                       sigset[];             /*     4     0 */

	/* size: 4, cachelines: 1, members: 2 */
	/* last cacheline: 4 bytes */
};
struct kvm_guest_debug {
	__u32                      control;              /*     0     4 */
	__u32                      pad;                  /*     4     4 */
	struct kvm_guest_debug_arch arch;                /*     8    64 */

	/* size: 72, cachelines: 2, members: 3 */
	/* last cacheline: 8 bytes */
};
struct kvm_ioeventfd {
	__u64                      datamatch;            /*     0     8 */
	__u64                      addr;                 /*     8     8 */
	__u32                      len;                  /*    16     4 */
	__s32                      fd;                   /*    20     4 */
	__u32                      flags;                /*    24     4 */
	__u8                       pad[36];              /*    28    36 */

	/* size: 64, cachelines: 1, members: 6 */
};
struct kvm_enable_cap {
	__u32                      cap;                  /*     0     4 */
	__u32                      flags;                /*     4     4 */
	__u64                      args[4];              /*     8    32 */
	__u8                       pad[64];              /*    40    64 */

	/* size: 104, cachelines: 2, members: 4 */
	/* last cacheline: 40 bytes */
};
struct kvm_irq_routing_irqchip {
	__u32                      irqchip;              /*     0     4 */
	__u32                      pin;                  /*     4     4 */

	/* size: 8, cachelines: 1, members: 2 */
	/* last cacheline: 8 bytes */
};
struct kvm_irq_routing_msi {
	__u32                      address_lo;           /*     0     4 */
	__u32                      address_hi;           /*     4     4 */
	__u32                      data;                 /*     8     4 */
	union {
		__u32              pad;                  /*    12     4 */
		__u32              devid;                /*    12     4 */
	};                                               /*    12     4 */

	/* size: 16, cachelines: 1, members: 4 */
	/* last cacheline: 16 bytes */
};
struct kvm_irq_routing_s390_adapter {
	__u64                      ind_addr;             /*     0     8 */
	__u64                      summary_addr;         /*     8     8 */
	__u64                      ind_offset;           /*    16     8 */
	__u32                      summary_offset;       /*    24     4 */
	__u32                      adapter_id;           /*    28     4 */

	/* size: 32, cachelines: 1, members: 5 */
	/* last cacheline: 32 bytes */
};
struct kvm_irq_routing_hv_sint {
	__u32                      vcpu;                 /*     0     4 */
	__u32                      sint;                 /*     4     4 */

	/* size: 8, cachelines: 1, members: 2 */
	/* last cacheline: 8 bytes */
};
struct kvm_irq_routing_entry {
	__u32                      gsi;                  /*     0     4 */
	__u32                      type;                 /*     4     4 */
	__u32                      flags;                /*     8     4 */
	__u32                      pad;                  /*    12     4 */
	union {
		struct kvm_irq_routing_irqchip irqchip;  /*    16     8 */
		struct kvm_irq_routing_msi msi;          /*    16    16 */
		struct kvm_irq_routing_s390_adapter adapter; /*    16    32 */
		struct kvm_irq_routing_hv_sint hv_sint;  /*    16     8 */
		__u32              pad[8];               /*    16    32 */
	} u;                                             /*    16    32 */

	/* size: 48, cachelines: 1, members: 5 */
	/* last cacheline: 48 bytes */
};
struct kvm_irq_routing {
	__u32                      nr;                   /*     0     4 */
	__u32                      flags;                /*     4     4 */
	struct kvm_irq_routing_entry entries[];          /*     8     0 */

	/* size: 8, cachelines: 1, members: 3 */
	/* last cacheline: 8 bytes */
};
struct kvm_irqfd {
	__u32                      fd;                   /*     0     4 */
	__u32                      gsi;                  /*     4     4 */
	__u32                      flags;                /*     8     4 */
	__u32                      resamplefd;           /*    12     4 */
	__u8                       pad[16];              /*    16    16 */

	/* size: 32, cachelines: 1, members: 5 */
	/* last cacheline: 32 bytes */
};
struct kvm_one_reg {
	__u64                      id;                   /*     0     8 */
	__u64                      addr;                 /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct kvm_msi {
	__u32                      address_lo;           /*     0     4 */
	__u32                      address_hi;           /*     4     4 */
	__u32                      data;                 /*     8     4 */
	__u32                      flags;                /*    12     4 */
	__u32                      devid;                /*    16     4 */
	__u8                       pad[12];              /*    20    12 */

	/* size: 32, cachelines: 1, members: 6 */
	/* last cacheline: 32 bytes */
};
struct kvm_create_device {
	__u32                      type;                 /*     0     4 */
	__u32                      fd;                   /*     4     4 */
	__u32                      flags;                /*     8     4 */

	/* size: 12, cachelines: 1, members: 3 */
	/* last cacheline: 12 bytes */
};
struct kvm_device_attr {
	__u32                      flags;                /*     0     4 */
	__u32                      group;                /*     4     4 */
	__u64                      attr;                 /*     8     8 */
	__u64                      addr;                 /*    16     8 */

	/* size: 24, cachelines: 1, members: 4 */
	/* last cacheline: 24 bytes */
};
struct PCIIORegion {
	pcibus_t                   addr;                 /*     0     8 */
	pcibus_t                   size;                 /*     8     8 */
	uint8_t                    type;                 /*    16     1 */

	/* XXX 7 bytes hole, try to pack */

	MemoryRegion *             memory;               /*    24     8 */
	MemoryRegion *             address_space;        /*    32     8 */

	/* size: 40, cachelines: 1, members: 5 */
	/* sum members: 33, holes: 1, sum holes: 7 */
	/* last cacheline: 40 bytes */
};
struct PCIReqIDCache {
	PCIDevice *                dev;                  /*     0     8 */
	PCIReqIDType               type;                 /*     8     4 */

	/* size: 16, cachelines: 1, members: 2 */
	/* padding: 4 */
	/* last cacheline: 16 bytes */
};
struct KVMState {
	AccelState                 parent_obj;           /*     0    40 */
	int                        nr_slots;             /*    40     4 */
	int                        fd;                   /*    44     4 */
	int                        vmfd;                 /*    48     4 */
	int                        coalesced_mmio;       /*    52     4 */
	struct kvm_coalesced_mmio_ring * coalesced_mmio_ring; /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	_Bool                      coalesced_flush_in_progress; /*    64     1 */

	/* XXX 3 bytes hole, try to pack */

	int                        broken_set_mem_region; /*    68     4 */
	int                        vcpu_events;          /*    72     4 */
	int                        robust_singlestep;    /*    76     4 */
	int                        debugregs;            /*    80     4 */

	/* XXX 4 bytes hole, try to pack */

	struct kvm_sw_breakpoint_head kvm_sw_breakpoints; /*    88    16 */
	int                        many_ioeventfds;      /*   104     4 */
	int                        intx_set_mask;        /*   108     4 */
	unsigned int               irq_set_ioctl;        /*   112     4 */
	unsigned int               sigmask_len;          /*   116     4 */
	GHashTable *               gsimap;               /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	struct kvm_irq_routing *   irq_routes;           /*   128     8 */
	int                        nr_allocated_irq_routes; /*   136     4 */

	/* XXX 4 bytes hole, try to pack */

	long unsigned int *        used_gsi_bitmap;      /*   144     8 */
	unsigned int               gsi_count;            /*   152     4 */

	/* XXX 4 bytes hole, try to pack */

	struct msi_hashtab         msi_hashtab[256];     /*   160  4096 */
	/* --- cacheline 66 boundary (4224 bytes) was 32 bytes ago --- */
	KVMMemoryListener          memory_listener;      /*  4256   176 */
	/* --- cacheline 69 boundary (4416 bytes) was 16 bytes ago --- */
	struct {
		struct KVMParkedVcpu * lh_first;         /*  4432     8 */
	} kvm_parked_vcpus;                              /*  4432     8 */

	/* size: 4440, cachelines: 70, members: 24 */
	/* sum members: 4425, holes: 4, sum holes: 15 */
	/* last cacheline: 24 bytes */
};
struct KVMCapabilityInfo {
	const char  *              name;                 /*     0     8 */
	int                        value;                /*     8     4 */

	/* size: 16, cachelines: 1, members: 2 */
	/* padding: 4 */
	/* last cacheline: 16 bytes */
};
struct kvm_sw_breakpoint {
	target_ulong               pc;                   /*     0     8 */
	target_ulong               saved_insn;           /*     8     8 */
	int                        use_count;            /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		struct kvm_sw_breakpoint * tqe_next;     /*    24     8 */
		struct kvm_sw_breakpoint * * tqe_prev;   /*    32     8 */
	} entry;                                         /*    24    16 */

	/* size: 40, cachelines: 1, members: 4 */
	/* sum members: 36, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct kvm_sw_breakpoint_head {
	struct kvm_sw_breakpoint * tqh_first;            /*     0     8 */
	struct kvm_sw_breakpoint * * tqh_last;           /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct KVMSlot {
	hwaddr                     start_addr;           /*     0     8 */
	ram_addr_t                 memory_size;          /*     8     8 */
	void *                     ram;                  /*    16     8 */
	int                        slot;                 /*    24     4 */
	int                        flags;                /*    28     4 */

	/* size: 32, cachelines: 1, members: 5 */
	/* last cacheline: 32 bytes */
};
struct KVMMemoryListener {
	MemoryListener             listener;             /*     0   160 */
	/* --- cacheline 2 boundary (128 bytes) was 32 bytes ago --- */
	KVMSlot *                  slots;                /*   160     8 */
	int                        as_id;                /*   168     4 */

	/* size: 176, cachelines: 3, members: 3 */
	/* padding: 4 */
	/* last cacheline: 48 bytes */
};
struct KVMParkedVcpu {
	long unsigned int          vcpu_id;              /*     0     8 */
	int                        kvm_fd;               /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		struct KVMParkedVcpu * le_next;          /*    16     8 */
		struct KVMParkedVcpu * * le_prev;        /*    24     8 */
	} node;                                          /*    16    16 */

	/* size: 32, cachelines: 1, members: 3 */
	/* sum members: 28, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct msi_hashtab {
	struct KVMMSIRoute *       tqh_first;            /*     0     8 */
	struct KVMMSIRoute * *     tqh_last;             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct KVMMSIRoute {
	struct kvm_irq_routing_entry kroute;             /*     0    48 */
	struct {
		struct KVMMSIRoute * tqe_next;           /*    48     8 */
		struct KVMMSIRoute * * tqe_prev;         /*    56     8 */
	} entry;                                         /*    48    16 */

	/* size: 64, cachelines: 1, members: 2 */
};
struct kvm_set_guest_debug_data {
	struct kvm_guest_debug     dbg;                  /*     0    72 */
	/* --- cacheline 1 boundary (64 bytes) was 8 bytes ago --- */
	int                        err;                  /*    72     4 */

	/* size: 80, cachelines: 2, members: 2 */
	/* padding: 4 */
	/* last cacheline: 16 bytes */
};
struct CoalescedMemoryRange {
	AddrRange                  addr;                 /*     0    32 */
	struct {
		struct CoalescedMemoryRange * tqe_next;  /*    32     8 */
		struct CoalescedMemoryRange * * tqe_prev; /*    40     8 */
	} link;                                          /*    32    16 */

	/* size: 48, cachelines: 1, members: 2 */
	/* last cacheline: 48 bytes */
};
struct MemoryRegionIoeventfd {
	AddrRange                  addr;                 /*     0    32 */
	_Bool                      match_data;           /*    32     1 */

	/* XXX 7 bytes hole, try to pack */

	uint64_t                   data;                 /*    40     8 */
	EventNotifier *            e;                    /*    48     8 */

	/* size: 64, cachelines: 1, members: 4 */
	/* sum members: 49, holes: 1, sum holes: 7 */
	/* padding: 8 */
};
struct FlatView {
	struct rcu_head            rcu;                  /*     0    16 */
	unsigned int               ref;                  /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	FlatRange *                ranges;               /*    24     8 */
	unsigned int               nr;                   /*    32     4 */
	unsigned int               nr_allocated;         /*    36     4 */

	/* size: 40, cachelines: 1, members: 5 */
	/* sum members: 36, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct memory_listeners {
	struct MemoryListener *    tqh_first;            /*     0     8 */
	struct MemoryListener * *  tqh_last;             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct AddrRange {
	Int128                     start;                /*     0    16 */
	Int128                     size;                 /*    16    16 */

	/* size: 32, cachelines: 1, members: 2 */
	/* last cacheline: 32 bytes */
};
struct FlatRange {
	MemoryRegion *             mr;                   /*     0     8 */
	hwaddr                     offset_in_region;     /*     8     8 */
	AddrRange                  addr;                 /*    16    32 */
	uint8_t                    dirty_log_mask;       /*    48     1 */
	_Bool                      romd_mode;            /*    49     1 */
	_Bool                      readonly;             /*    50     1 */

	/* Force padding: */
	_Bool                      :8;
	_Bool                      :8;
	_Bool                      :8;
	_Bool                      :8;
	_Bool                      :8;
	_Bool                      :8;
	_Bool                      :8;
	_Bool                      :8;
	_Bool                      :8;
	_Bool                      :8;
	_Bool                      :8;
	_Bool                      :8;
	_Bool                      :8;

	/* size: 64, cachelines: 1, members: 6 */
	/* padding: 13 */
};
struct MemoryRegionList {
	const MemoryRegion  *      mr;                   /*     0     8 */
	struct {
		struct MemoryRegionList * tqe_next;      /*     8     8 */
		struct MemoryRegionList * * tqe_prev;    /*    16     8 */
	} queue;                                         /*     8    16 */

	/* size: 24, cachelines: 1, members: 2 */
	/* last cacheline: 24 bytes */
};
struct queue {
	struct MemoryRegionList *  tqh_first;            /*     0     8 */
	struct MemoryRegionList * * tqh_last;            /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct MemoryMappingList {
	unsigned int               num;                  /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	MemoryMapping *            last_mapping;         /*     8     8 */
	struct {
		struct MemoryMapping * tqh_first;        /*    16     8 */
		struct MemoryMapping * * tqh_last;       /*    24     8 */
	} head;                                          /*    16    16 */

	/* size: 32, cachelines: 1, members: 3 */
	/* sum members: 28, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct GuestPhysBlock {
	hwaddr                     target_start;         /*     0     8 */
	hwaddr                     target_end;           /*     8     8 */
	uint8_t *                  host_addr;            /*    16     8 */
	MemoryRegion *             mr;                   /*    24     8 */
	struct {
		struct GuestPhysBlock * tqe_next;        /*    32     8 */
		struct GuestPhysBlock * * tqe_prev;      /*    40     8 */
	} next;                                          /*    32    16 */

	/* size: 48, cachelines: 1, members: 5 */
	/* last cacheline: 48 bytes */
};
struct GuestPhysBlockHead {
	struct GuestPhysBlock *    tqh_first;            /*     0     8 */
	struct GuestPhysBlock * *  tqh_last;             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct GuestPhysBlockList {
	unsigned int               num;                  /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	struct GuestPhysBlockHead  head;                 /*     8    16 */

	/* size: 24, cachelines: 1, members: 2 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct MemoryMapping {
	hwaddr                     phys_addr;            /*     0     8 */
	target_ulong               virt_addr;            /*     8     8 */
	ram_addr_t                 length;               /*    16     8 */
	struct {
		struct MemoryMapping * tqe_next;         /*    24     8 */
		struct MemoryMapping * * tqe_prev;       /*    32     8 */
	} next;                                          /*    24    16 */

	/* size: 40, cachelines: 1, members: 4 */
	/* last cacheline: 40 bytes */
};
struct GuestPhysListener {
	GuestPhysBlockList *       list;                 /*     0     8 */
	MemoryListener             listener;             /*     8   160 */

	/* size: 168, cachelines: 3, members: 2 */
	/* last cacheline: 40 bytes */
};
struct elf32_hdr {
	unsigned char              e_ident[16];          /*     0    16 */
	Elf32_Half                 e_type;               /*    16     2 */
	Elf32_Half                 e_machine;            /*    18     2 */
	Elf32_Word                 e_version;            /*    20     4 */
	Elf32_Addr                 e_entry;              /*    24     4 */
	Elf32_Off                  e_phoff;              /*    28     4 */
	Elf32_Off                  e_shoff;              /*    32     4 */
	Elf32_Word                 e_flags;              /*    36     4 */
	Elf32_Half                 e_ehsize;             /*    40     2 */
	Elf32_Half                 e_phentsize;          /*    42     2 */
	Elf32_Half                 e_phnum;              /*    44     2 */
	Elf32_Half                 e_shentsize;          /*    46     2 */
	Elf32_Half                 e_shnum;              /*    48     2 */
	Elf32_Half                 e_shstrndx;           /*    50     2 */

	/* size: 52, cachelines: 1, members: 14 */
	/* last cacheline: 52 bytes */
};
struct elf32_phdr {
	Elf32_Word                 p_type;               /*     0     4 */
	Elf32_Off                  p_offset;             /*     4     4 */
	Elf32_Addr                 p_vaddr;              /*     8     4 */
	Elf32_Addr                 p_paddr;              /*    12     4 */
	Elf32_Word                 p_filesz;             /*    16     4 */
	Elf32_Word                 p_memsz;              /*    20     4 */
	Elf32_Word                 p_flags;              /*    24     4 */
	Elf32_Word                 p_align;              /*    28     4 */

	/* size: 32, cachelines: 1, members: 8 */
	/* last cacheline: 32 bytes */
};
struct elf32_shdr {
	Elf32_Word                 sh_name;              /*     0     4 */
	Elf32_Word                 sh_type;              /*     4     4 */
	Elf32_Word                 sh_flags;             /*     8     4 */
	Elf32_Addr                 sh_addr;              /*    12     4 */
	Elf32_Off                  sh_offset;            /*    16     4 */
	Elf32_Word                 sh_size;              /*    20     4 */
	Elf32_Word                 sh_link;              /*    24     4 */
	Elf32_Word                 sh_info;              /*    28     4 */
	Elf32_Word                 sh_addralign;         /*    32     4 */
	Elf32_Word                 sh_entsize;           /*    36     4 */

	/* size: 40, cachelines: 1, members: 10 */
	/* last cacheline: 40 bytes */
};
struct DumpGuestMemoryCapability {
	DumpGuestMemoryFormatList * formats;             /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct DumpGuestMemoryFormatList {
	DumpGuestMemoryFormatList * next;                /*     0     8 */
	DumpGuestMemoryFormat      value;                /*     8     4 */

	/* size: 16, cachelines: 1, members: 2 */
	/* padding: 4 */
	/* last cacheline: 16 bytes */
};
struct DumpQueryResult {
	DumpStatus                 status;               /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	int64_t                    completed;            /*     8     8 */
	int64_t                    total;                /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct ArchDumpInfo {
	int                        d_machine;            /*     0     4 */
	int                        d_endian;             /*     4     4 */
	int                        d_class;              /*     8     4 */
	uint32_t                   page_size;            /*    12     4 */
	uint64_t                   phys_base;            /*    16     8 */

	/* size: 24, cachelines: 1, members: 5 */
	/* last cacheline: 24 bytes */
};
struct MakedumpfileHeader {
	char                       signature[16];        /*     0    16 */
	int64_t                    type;                 /*    16     8 */
	int64_t                    version;              /*    24     8 */

	/* size: 32, cachelines: 1, members: 3 */
	/* last cacheline: 32 bytes */
};
struct MakedumpfileDataHeader {
	int64_t                    offset;               /*     0     8 */
	int64_t                    buf_size;             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct NewUtsname {
	char                       sysname[65];          /*     0    65 */
	/* --- cacheline 1 boundary (64 bytes) was 1 bytes ago --- */
	char                       nodename[65];         /*    65    65 */
	/* --- cacheline 2 boundary (128 bytes) was 2 bytes ago --- */
	char                       release[65];          /*   130    65 */
	/* --- cacheline 3 boundary (192 bytes) was 3 bytes ago --- */
	char                       version[65];          /*   195    65 */
	/* --- cacheline 4 boundary (256 bytes) was 4 bytes ago --- */
	char                       machine[65];          /*   260    65 */
	/* --- cacheline 5 boundary (320 bytes) was 5 bytes ago --- */
	char                       domainname[65];       /*   325    65 */

	/* size: 390, cachelines: 7, members: 6 */
	/* last cacheline: 6 bytes */
};
struct DiskDumpHeader32 {
	char                       signature[8];         /*     0     8 */
	uint32_t                   header_version;       /*     8     4 */
	NewUtsname                 utsname;              /*    12   390 */
	/* --- cacheline 6 boundary (384 bytes) was 18 bytes ago --- */
	char                       timestamp[10];        /*   402    10 */
	uint32_t                   status;               /*   412     4 */
	uint32_t                   block_size;           /*   416     4 */
	uint32_t                   sub_hdr_size;         /*   420     4 */
	uint32_t                   bitmap_blocks;        /*   424     4 */
	uint32_t                   max_mapnr;            /*   428     4 */
	uint32_t                   total_ram_blocks;     /*   432     4 */
	uint32_t                   device_blocks;        /*   436     4 */
	uint32_t                   written_blocks;       /*   440     4 */
	uint32_t                   current_cpu;          /*   444     4 */
	/* --- cacheline 7 boundary (448 bytes) --- */
	uint32_t                   nr_cpus;              /*   448     4 */

	/* size: 452, cachelines: 8, members: 14 */
	/* last cacheline: 4 bytes */
};
struct DiskDumpHeader64 {
	char                       signature[8];         /*     0     8 */
	uint32_t                   header_version;       /*     8     4 */
	NewUtsname                 utsname;              /*    12   390 */
	/* --- cacheline 6 boundary (384 bytes) was 18 bytes ago --- */
	char                       timestamp[22];        /*   402    22 */
	uint32_t                   status;               /*   424     4 */
	uint32_t                   block_size;           /*   428     4 */
	uint32_t                   sub_hdr_size;         /*   432     4 */
	uint32_t                   bitmap_blocks;        /*   436     4 */
	uint32_t                   max_mapnr;            /*   440     4 */
	uint32_t                   total_ram_blocks;     /*   444     4 */
	/* --- cacheline 7 boundary (448 bytes) --- */
	uint32_t                   device_blocks;        /*   448     4 */
	uint32_t                   written_blocks;       /*   452     4 */
	uint32_t                   current_cpu;          /*   456     4 */
	uint32_t                   nr_cpus;              /*   460     4 */

	/* size: 464, cachelines: 8, members: 14 */
	/* last cacheline: 16 bytes */
};
struct KdumpSubHeader32 {
	uint32_t                   phys_base;            /*     0     4 */
	uint32_t                   dump_level;           /*     4     4 */
	uint32_t                   split;                /*     8     4 */
	uint32_t                   start_pfn;            /*    12     4 */
	uint32_t                   end_pfn;              /*    16     4 */
	uint64_t                   offset_vmcoreinfo;    /*    20     8 */
	uint32_t                   size_vmcoreinfo;      /*    28     4 */
	uint64_t                   offset_note;          /*    32     8 */
	uint32_t                   note_size;            /*    40     4 */
	uint64_t                   offset_eraseinfo;     /*    44     8 */
	uint32_t                   size_eraseinfo;       /*    52     4 */
	uint64_t                   start_pfn_64;         /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	uint64_t                   end_pfn_64;           /*    64     8 */
	uint64_t                   max_mapnr_64;         /*    72     8 */

	/* size: 80, cachelines: 2, members: 14 */
	/* last cacheline: 16 bytes */
} __attribute__((__packed__));
struct KdumpSubHeader64 {
	uint64_t                   phys_base;            /*     0     8 */
	uint32_t                   dump_level;           /*     8     4 */
	uint32_t                   split;                /*    12     4 */
	uint64_t                   start_pfn;            /*    16     8 */
	uint64_t                   end_pfn;              /*    24     8 */
	uint64_t                   offset_vmcoreinfo;    /*    32     8 */
	uint64_t                   size_vmcoreinfo;      /*    40     8 */
	uint64_t                   offset_note;          /*    48     8 */
	uint64_t                   note_size;            /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	uint64_t                   offset_eraseinfo;     /*    64     8 */
	uint64_t                   size_eraseinfo;       /*    72     8 */
	uint64_t                   start_pfn_64;         /*    80     8 */
	uint64_t                   end_pfn_64;           /*    88     8 */
	uint64_t                   max_mapnr_64;         /*    96     8 */

	/* size: 104, cachelines: 2, members: 14 */
	/* last cacheline: 40 bytes */
};
struct DataCache {
	int                        fd;                   /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	uint8_t *                  buf;                  /*     8     8 */
	size_t                     buf_size;             /*    16     8 */
	size_t                     data_size;            /*    24     8 */
	off_t                      offset;               /*    32     8 */

	/* size: 40, cachelines: 1, members: 5 */
	/* sum members: 36, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct PageDescriptor {
	uint64_t                   offset;               /*     0     8 */
	uint32_t                   size;                 /*     8     4 */
	uint32_t                   flags;                /*    12     4 */
	uint64_t                   page_flags;           /*    16     8 */

	/* size: 24, cachelines: 1, members: 4 */
	/* last cacheline: 24 bytes */
};
struct DumpState {
	GuestPhysBlockList         guest_phys_blocks;    /*     0    24 */
	ArchDumpInfo               dump_info;            /*    24    24 */
	MemoryMappingList          list;                 /*    48    32 */
	/* --- cacheline 1 boundary (64 bytes) was 16 bytes ago --- */
	uint16_t                   phdr_num;             /*    80     2 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   sh_info;              /*    84     4 */
	_Bool                      have_section;         /*    88     1 */
	_Bool                      resume;               /*    89     1 */

	/* XXX 6 bytes hole, try to pack */

	ssize_t                    note_size;            /*    96     8 */
	hwaddr                     memory_offset;        /*   104     8 */
	int                        fd;                   /*   112     4 */

	/* XXX 4 bytes hole, try to pack */

	GuestPhysBlock *           next_block;           /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	ram_addr_t                 start;                /*   128     8 */
	_Bool                      has_filter;           /*   136     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    begin;                /*   144     8 */
	int64_t                    length;               /*   152     8 */
	uint8_t *                  note_buf;             /*   160     8 */
	size_t                     note_buf_offset;      /*   168     8 */
	uint32_t                   nr_cpus;              /*   176     4 */

	/* XXX 4 bytes hole, try to pack */

	uint64_t                   max_mapnr;            /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	size_t                     len_dump_bitmap;      /*   192     8 */
	off_t                      offset_dump_bitmap;   /*   200     8 */
	off_t                      offset_page;          /*   208     8 */
	size_t                     num_dumpable;         /*   216     8 */
	uint32_t                   flag_compress;        /*   224     4 */
	DumpStatus                 status;               /*   228     4 */
	_Bool                      has_format;           /*   232     1 */

	/* XXX 3 bytes hole, try to pack */

	DumpGuestMemoryFormat      format;               /*   236     4 */
	QemuThread                 dump_thread;          /*   240     8 */
	int64_t                    total_size;           /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	int64_t                    written_size;         /*   256     8 */

	/* size: 264, cachelines: 5, members: 30 */
	/* sum members: 238, holes: 6, sum holes: 26 */
	/* last cacheline: 8 bytes */
};
struct MigrationIncomingState {
	QEMUFile *                 from_src_file;        /*     0     8 */
	QemuEvent                  main_thread_load_event; /*     8     4 */
	_Bool                      have_fault_thread;    /*    12     1 */

	/* XXX 3 bytes hole, try to pack */

	QemuThread                 fault_thread;         /*    16     8 */
	QemuSemaphore              fault_thread_sem;     /*    24    32 */
	_Bool                      have_listen_thread;   /*    56     1 */

	/* XXX 7 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) --- */
	QemuThread                 listen_thread;        /*    64     8 */
	QemuSemaphore              listen_thread_sem;    /*    72    32 */
	int                        userfault_fd;         /*   104     4 */
	int                        userfault_quit_fd;    /*   108     4 */
	QEMUFile *                 to_src_file;          /*   112     8 */
	QemuMutex                  rp_mutex;             /*   120    40 */
	/* --- cacheline 2 boundary (128 bytes) was 32 bytes ago --- */
	void *                     postcopy_tmp_page;    /*   160     8 */
	QEMUBH *                   bh;                   /*   168     8 */
	int                        state;                /*   176     4 */
	_Bool                      have_colo_incoming_thread; /*   180     1 */

	/* XXX 3 bytes hole, try to pack */

	QemuThread                 colo_incoming_thread; /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	Coroutine *                migration_incoming_co; /*   192     8 */
	LoadStateEntry_Head        loadvm_handlers;      /*   200     8 */

	/* size: 208, cachelines: 4, members: 19 */
	/* sum members: 195, holes: 3, sum holes: 13 */
	/* last cacheline: 16 bytes */
};
struct MigrationParams {
	_Bool                      blk;                  /*     0     1 */
	_Bool                      shared;               /*     1     1 */

	/* size: 2, cachelines: 1, members: 2 */
	/* last cacheline: 2 bytes */
};
struct MigrationState {
	size_t                     bytes_xfer;           /*     0     8 */
	size_t                     xfer_limit;           /*     8     8 */
	QemuThread                 thread;               /*    16     8 */
	QEMUBH *                   cleanup_bh;           /*    24     8 */
	QEMUFile *                 to_dst_file;          /*    32     8 */
	MigrationParameters        parameters;           /*    40   160 */
	/* --- cacheline 3 boundary (192 bytes) was 8 bytes ago --- */
	int                        state;                /*   200     4 */
	MigrationParams            params;               /*   204     2 */

	/* XXX 2 bytes hole, try to pack */

	struct {
		QEMUFile *         from_dst_file;        /*   208     8 */
		QemuThread         rp_thread;            /*   216     8 */
		_Bool              error;                /*   224     1 */
	} rp_state;                                      /*   208    24 */

	/* XXX last struct has 7 bytes of padding */

	double                     mbps;                 /*   232     8 */
	int64_t                    total_time;           /*   240     8 */
	int64_t                    downtime;             /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	int64_t                    expected_downtime;    /*   256     8 */
	int64_t                    dirty_pages_rate;     /*   264     8 */
	int64_t                    dirty_bytes_rate;     /*   272     8 */
	_Bool                      enabled_capabilities[8]; /*   280     8 */
	int64_t                    xbzrle_cache_size;    /*   288     8 */
	int64_t                    setup_time;           /*   296     8 */
	int64_t                    dirty_sync_count;     /*   304     8 */
	int64_t                    postcopy_requests;    /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	_Bool                      start_postcopy;       /*   320     1 */
	_Bool                      postcopy_after_devices; /*   321     1 */
	_Bool                      migration_thread_running; /*   322     1 */

	/* XXX 5 bytes hole, try to pack */

	QemuMutex                  src_page_req_mutex;   /*   328    40 */
	struct src_page_requests   src_page_requests;    /*   368    16 */
	/* --- cacheline 6 boundary (384 bytes) --- */
	RAMBlock *                 last_req_rb;          /*   384     8 */
	Error *                    error;                /*   392     8 */

	/* size: 400, cachelines: 7, members: 27 */
	/* sum members: 393, holes: 2, sum holes: 7 */
	/* paddings: 1, sum paddings: 7 */
	/* last cacheline: 16 bytes */
};
struct MigrationParameters {
	_Bool                      has_compress_level;   /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    compress_level;       /*     8     8 */
	_Bool                      has_compress_threads; /*    16     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    compress_threads;     /*    24     8 */
	_Bool                      has_decompress_threads; /*    32     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    decompress_threads;   /*    40     8 */
	_Bool                      has_cpu_throttle_initial; /*    48     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    cpu_throttle_initial; /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	_Bool                      has_cpu_throttle_increment; /*    64     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    cpu_throttle_increment; /*    72     8 */
	_Bool                      has_tls_creds;        /*    80     1 */

	/* XXX 7 bytes hole, try to pack */

	char *                     tls_creds;            /*    88     8 */
	_Bool                      has_tls_hostname;     /*    96     1 */

	/* XXX 7 bytes hole, try to pack */

	char *                     tls_hostname;         /*   104     8 */
	_Bool                      has_max_bandwidth;    /*   112     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    max_bandwidth;        /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	_Bool                      has_downtime_limit;   /*   128     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    downtime_limit;       /*   136     8 */
	_Bool                      has_x_checkpoint_delay; /*   144     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    x_checkpoint_delay;   /*   152     8 */

	/* size: 160, cachelines: 3, members: 20 */
	/* sum members: 90, holes: 10, sum holes: 70 */
	/* last cacheline: 32 bytes */
};
struct QemuSemaphore {
	sem_t                      sem;                  /*     0    32 */

	/* size: 32, cachelines: 1, members: 1 */
	/* last cacheline: 32 bytes */
};
struct QEMUFileOps {
	QEMUFileGetBufferFunc *    get_buffer;           /*     0     8 */
	QEMUFileCloseFunc *        close;                /*     8     8 */
	QEMUFileSetBlocking *      set_blocking;         /*    16     8 */
	QEMUFileWritevBufferFunc * writev_buffer;        /*    24     8 */
	QEMURetPathFunc *          get_return_path;      /*    32     8 */
	QEMUFileShutdownFunc *     shut_down;            /*    40     8 */

	/* size: 48, cachelines: 1, members: 6 */
	/* last cacheline: 48 bytes */
};
struct SaveVMHandlers {
	void                       (*set_params)(const MigrationParams  *, void *); /*     0     8 */
	SaveStateHandler *         save_state;           /*     8     8 */
	void                       (*cleanup)(void *);   /*    16     8 */
	int                        (*save_live_complete_postcopy)(QEMUFile *, void *); /*    24     8 */
	int                        (*save_live_complete_precopy)(QEMUFile *, void *); /*    32     8 */
	_Bool                      (*is_active)(void *); /*    40     8 */
	int                        (*save_live_iterate)(QEMUFile *, void *); /*    48     8 */
	int                        (*save_live_setup)(QEMUFile *, void *); /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	void                       (*save_live_pending)(QEMUFile *, void *, uint64_t, uint64_t *, uint64_t *); /*    64     8 */
	LoadStateHandler *         load_state;           /*    72     8 */

	/* size: 80, cachelines: 2, members: 10 */
	/* last cacheline: 16 bytes */
};
struct MigrationSrcPageRequest {
	RAMBlock *                 rb;                   /*     0     8 */
	hwaddr                     offset;               /*     8     8 */
	hwaddr                     len;                  /*    16     8 */
	struct {
		struct MigrationSrcPageRequest * sqe_next; /*    24     8 */
	} next_req;                                      /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* last cacheline: 32 bytes */
};
struct src_page_requests {
	struct MigrationSrcPageRequest * sqh_first;      /*     0     8 */
	struct MigrationSrcPageRequest * * sqh_last;     /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct AccountingInfo {
	uint64_t                   dup_pages;            /*     0     8 */
	uint64_t                   skipped_pages;        /*     8     8 */
	uint64_t                   norm_pages;           /*    16     8 */
	uint64_t                   iterations;           /*    24     8 */
	uint64_t                   xbzrle_bytes;         /*    32     8 */
	uint64_t                   xbzrle_pages;         /*    40     8 */
	uint64_t                   xbzrle_cache_miss;    /*    48     8 */
	double                     xbzrle_cache_miss_rate; /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	uint64_t                   xbzrle_overflows;     /*    64     8 */

	/* size: 72, cachelines: 2, members: 9 */
	/* last cacheline: 8 bytes */
};
struct PageSearchStatus {
	RAMBlock *                 block;                /*     0     8 */
	ram_addr_t                 offset;               /*     8     8 */
	_Bool                      complete_round;       /*    16     1 */

	/* size: 24, cachelines: 1, members: 3 */
	/* padding: 7 */
	/* last cacheline: 24 bytes */
};
struct BitmapRcu {
	struct rcu_head            rcu;                  /*     0    16 */
	long unsigned int *        bmap;                 /*    16     8 */
	long unsigned int *        unsentmap;            /*    24     8 */

	/* size: 32, cachelines: 1, members: 3 */
	/* last cacheline: 32 bytes */
};
struct CompressParam {
	_Bool                      done;                 /*     0     1 */
	_Bool                      quit;                 /*     1     1 */

	/* XXX 6 bytes hole, try to pack */

	QEMUFile *                 file;                 /*     8     8 */
	QemuMutex                  mutex;                /*    16    40 */
	QemuCond                   cond;                 /*    56    48 */
	/* --- cacheline 1 boundary (64 bytes) was 40 bytes ago --- */
	RAMBlock *                 block;                /*   104     8 */
	ram_addr_t                 offset;               /*   112     8 */

	/* size: 120, cachelines: 2, members: 7 */
	/* sum members: 114, holes: 1, sum holes: 6 */
	/* last cacheline: 56 bytes */
};
struct DecompressParam {
	_Bool                      done;                 /*     0     1 */
	_Bool                      quit;                 /*     1     1 */

	/* XXX 6 bytes hole, try to pack */

	QemuMutex                  mutex;                /*     8    40 */
	QemuCond                   cond;                 /*    48    48 */
	/* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */
	void *                     des;                  /*    96     8 */
	uint8_t *                  compbuf;              /*   104     8 */
	int                        len;                  /*   112     4 */

	/* size: 120, cachelines: 2, members: 7 */
	/* sum members: 110, holes: 1, sum holes: 6 */
	/* padding: 4 */
	/* last cacheline: 56 bytes */
};
struct tm {
	int                        tm_sec;               /*     0     4 */
	int                        tm_min;               /*     4     4 */
	int                        tm_hour;              /*     8     4 */
	int                        tm_mday;              /*    12     4 */
	int                        tm_mon;               /*    16     4 */
	int                        tm_year;              /*    20     4 */
	int                        tm_wday;              /*    24     4 */
	int                        tm_yday;              /*    28     4 */
	int                        tm_isdst;             /*    32     4 */

	/* XXX 4 bytes hole, try to pack */

	long int                   tm_gmtoff;            /*    40     8 */
	const char  *              tm_zone;              /*    48     8 */

	/* size: 56, cachelines: 1, members: 11 */
	/* sum members: 52, holes: 1, sum holes: 4 */
	/* last cacheline: 56 bytes */
};
struct LoadStateEntry {
	struct {
		struct LoadStateEntry * le_next;         /*     0     8 */
		struct LoadStateEntry * * le_prev;       /*     8     8 */
	} entry;                                         /*     0    16 */
	SaveStateEntry *           se;                   /*    16     8 */
	int                        section_id;           /*    24     4 */
	int                        version_id;           /*    28     4 */

	/* size: 32, cachelines: 1, members: 4 */
	/* last cacheline: 32 bytes */
};
struct MACAddr {
	uint8_t                    a[6];                 /*     0     6 */

	/* size: 6, cachelines: 1, members: 1 */
	/* last cacheline: 6 bytes */
};
struct QIOChannel {
	Object                     parent;               /*     0    40 */
	unsigned int               features;             /*    40     4 */

	/* XXX 4 bytes hole, try to pack */

	char *                     name;                 /*    48     8 */

	/* size: 56, cachelines: 1, members: 3 */
	/* sum members: 52, holes: 1, sum holes: 4 */
	/* last cacheline: 56 bytes */
};
struct NICPeers {
	NetClientState *           ncs[1024];            /*     0  8192 */
	/* --- cacheline 128 boundary (8192 bytes) --- */
	int32_t                    queues;               /*  8192     4 */

	/* size: 8200, cachelines: 129, members: 2 */
	/* padding: 4 */
	/* last cacheline: 8 bytes */
};
struct NICConf {
	MACAddr                    macaddr;              /*     0     6 */

	/* XXX 2 bytes hole, try to pack */

	NICPeers                   peers;                /*     8  8200 */
	/* --- cacheline 128 boundary (8192 bytes) was 16 bytes ago --- */
	int32_t                    bootindex;            /*  8208     4 */

	/* size: 8216, cachelines: 129, members: 3 */
	/* sum members: 8210, holes: 1, sum holes: 2 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct NICState {
	NetClientState *           ncs;                  /*     0     8 */
	NICConf *                  conf;                 /*     8     8 */
	void *                     opaque;               /*    16     8 */
	_Bool                      peer_deleted;         /*    24     1 */

	/* size: 32, cachelines: 1, members: 4 */
	/* padding: 7 */
	/* last cacheline: 32 bytes */
};
struct QIOChannelBuffer {
	QIOChannel                 parent;               /*     0    56 */
	size_t                     capacity;             /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	size_t                     usage;                /*    64     8 */
	size_t                     offset;               /*    72     8 */
	uint8_t *                  data;                 /*    80     8 */

	/* size: 88, cachelines: 2, members: 5 */
	/* last cacheline: 24 bytes */
};
struct QIOChannelFile {
	QIOChannel                 parent;               /*     0    56 */
	int                        fd;                   /*    56     4 */

	/* size: 64, cachelines: 1, members: 2 */
	/* padding: 4 */
};
struct mig_cmd_args {
	ssize_t                    len;                  /*     0     8 */
	const char  *              name;                 /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct CompatEntry {
	char                       idstr[256];           /*     0   256 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	int                        instance_id;          /*   256     4 */

	/* size: 260, cachelines: 5, members: 2 */
	/* last cacheline: 4 bytes */
};
struct SaveStateEntry {
	struct {
		struct SaveStateEntry * tqe_next;        /*     0     8 */
		struct SaveStateEntry * * tqe_prev;      /*     8     8 */
	} entry;                                         /*     0    16 */
	char                       idstr[256];           /*    16   256 */
	/* --- cacheline 4 boundary (256 bytes) was 16 bytes ago --- */
	int                        instance_id;          /*   272     4 */
	int                        alias_id;             /*   276     4 */
	int                        version_id;           /*   280     4 */
	int                        section_id;           /*   284     4 */
	SaveVMHandlers *           ops;                  /*   288     8 */
	const VMStateDescription  * vmsd;                /*   296     8 */
	void *                     opaque;               /*   304     8 */
	CompatEntry *              compat;               /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	int                        is_ram;               /*   320     4 */

	/* size: 328, cachelines: 6, members: 11 */
	/* padding: 4 */
	/* last cacheline: 8 bytes */
};
struct SaveState {
	struct {
		struct SaveStateEntry * tqh_first;       /*     0     8 */
		struct SaveStateEntry * * tqh_last;      /*     8     8 */
	} handlers;                                      /*     0    16 */
	int                        global_section_id;    /*    16     4 */
	_Bool                      skip_configuration;   /*    20     1 */

	/* XXX 3 bytes hole, try to pack */

	uint32_t                   len;                  /*    24     4 */

	/* XXX 4 bytes hole, try to pack */

	const char  *              name;                 /*    32     8 */
	uint32_t                   target_page_bits;     /*    40     4 */

	/* size: 48, cachelines: 1, members: 6 */
	/* sum members: 37, holes: 2, sum holes: 7 */
	/* padding: 4 */
	/* last cacheline: 48 bytes */
};
struct VirtIODevice {
	DeviceState                parent_obj;           /*     0   112 */
	/* --- cacheline 1 boundary (64 bytes) was 48 bytes ago --- */
	const char  *              name;                 /*   112     8 */
	uint8_t                    status;               /*   120     1 */
	uint8_t                    isr;                  /*   121     1 */
	uint16_t                   queue_sel;            /*   122     2 */

	/* XXX 4 bytes hole, try to pack */

	/* --- cacheline 2 boundary (128 bytes) --- */
	uint64_t                   guest_features;       /*   128     8 */
	uint64_t                   host_features;        /*   136     8 */
	size_t                     config_len;           /*   144     8 */
	void *                     config;               /*   152     8 */
	uint16_t                   config_vector;        /*   160     2 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   generation;           /*   164     4 */
	int                        nvectors;             /*   168     4 */

	/* XXX 4 bytes hole, try to pack */

	VirtQueue *                vq;                   /*   176     8 */
	uint16_t                   device_id;            /*   184     2 */
	_Bool                      vm_running;           /*   186     1 */
	_Bool                      broken;               /*   187     1 */

	/* XXX 4 bytes hole, try to pack */

	/* --- cacheline 3 boundary (192 bytes) --- */
	VMChangeStateEntry *       vmstate;              /*   192     8 */
	char *                     bus_name;             /*   200     8 */
	uint8_t                    device_endian;        /*   208     1 */
	_Bool                      use_guest_notifier_mask; /*   209     1 */

	/* XXX 6 bytes hole, try to pack */

	struct {
		struct VirtQueue * lh_first;     /*     0     8 */
	} * vector_queues; /*   216     8 */

	/* size: 224, cachelines: 4, members: 21 */
	/* sum members: 204, holes: 5, sum holes: 20 */
	/* last cacheline: 32 bytes */
};
struct BlockConf {
	BlockBackend *             blk;                  /*     0     8 */
	uint16_t                   physical_block_size;  /*     8     2 */
	uint16_t                   logical_block_size;   /*    10     2 */
	uint16_t                   min_io_size;          /*    12     2 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   opt_io_size;          /*    16     4 */
	int32_t                    bootindex;            /*    20     4 */
	uint32_t                   discard_granularity;  /*    24     4 */
	uint32_t                   cyls;                 /*    28     4 */
	uint32_t                   heads;                /*    32     4 */
	uint32_t                   secs;                 /*    36     4 */
	OnOffAuto                  wce;                  /*    40     4 */
	BlockdevOnError            rerror;               /*    44     4 */
	BlockdevOnError            werror;               /*    48     4 */

	/* size: 56, cachelines: 1, members: 13 */
	/* sum members: 50, holes: 1, sum holes: 2 */
	/* padding: 4 */
	/* last cacheline: 56 bytes */
};
struct TimedAverageWindow {
	uint64_t                   min;                  /*     0     8 */
	uint64_t                   max;                  /*     8     8 */
	uint64_t                   sum;                  /*    16     8 */
	uint64_t                   count;                /*    24     8 */
	int64_t                    expiration;           /*    32     8 */

	/* size: 40, cachelines: 1, members: 5 */
	/* last cacheline: 40 bytes */
};
struct TimedAverage {
	uint64_t                   period;               /*     0     8 */
	TimedAverageWindow         windows[2];           /*     8    80 */
	/* --- cacheline 1 boundary (64 bytes) was 24 bytes ago --- */
	unsigned int               current;              /*    88     4 */
	QEMUClockType              clock_type;           /*    92     4 */

	/* size: 96, cachelines: 2, members: 4 */
	/* last cacheline: 32 bytes */
};
struct BlockAcctTimedStats {
	TimedAverage               latency[3];           /*     0   288 */
	/* --- cacheline 4 boundary (256 bytes) was 32 bytes ago --- */
	unsigned int               interval_length;      /*   288     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		struct BlockAcctTimedStats * sle_next;   /*   296     8 */
	} entries;                                       /*   296     8 */

	/* size: 304, cachelines: 5, members: 3 */
	/* sum members: 300, holes: 1, sum holes: 4 */
	/* last cacheline: 48 bytes */
};
struct BlockAcctStats {
	uint64_t                   nr_bytes[3];          /*     0    24 */
	uint64_t                   nr_ops[3];            /*    24    24 */
	uint64_t                   invalid_ops[3];       /*    48    24 */
	/* --- cacheline 1 boundary (64 bytes) was 8 bytes ago --- */
	uint64_t                   failed_ops[3];        /*    72    24 */
	uint64_t                   total_time_ns[3];     /*    96    24 */
	uint64_t                   merged[3];            /*   120    24 */
	/* --- cacheline 2 boundary (128 bytes) was 16 bytes ago --- */
	int64_t                    last_access_time_ns;  /*   144     8 */
	struct {
		struct BlockAcctTimedStats * slh_first;  /*   152     8 */
	} intervals;                                     /*   152     8 */
	_Bool                      account_invalid;      /*   160     1 */
	_Bool                      account_failed;       /*   161     1 */

	/* size: 168, cachelines: 3, members: 10 */
	/* padding: 6 */
	/* last cacheline: 40 bytes */
};
struct BlockAcctCookie {
	int64_t                    bytes;                /*     0     8 */
	int64_t                    start_time_ns;        /*     8     8 */
	enum BlockAcctType         type;                 /*    16     4 */

	/* size: 24, cachelines: 1, members: 3 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct BlockDevOps {
	void                       (*change_media_cb)(void *, _Bool); /*     0     8 */
	void                       (*eject_request_cb)(void *, _Bool); /*     8     8 */
	_Bool                      (*is_tray_open)(void *); /*    16     8 */
	_Bool                      (*is_medium_locked)(void *); /*    24     8 */
	void                       (*resize_cb)(void *); /*    32     8 */

	/* size: 40, cachelines: 1, members: 5 */
	/* last cacheline: 40 bytes */
};
struct virtio_blk_geometry {
	uint16_t                   cylinders;            /*     0     2 */
	uint8_t                    heads;                /*     2     1 */
	uint8_t                    sectors;              /*     3     1 */

	/* size: 4, cachelines: 1, members: 3 */
	/* last cacheline: 4 bytes */
};
struct virtio_blk_config {
	uint64_t                   capacity;             /*     0     8 */
	uint32_t                   size_max;             /*     8     4 */
	uint32_t                   seg_max;              /*    12     4 */
	struct virtio_blk_geometry geometry;             /*    16     4 */
	uint32_t                   blk_size;             /*    20     4 */
	uint8_t                    physical_block_exp;   /*    24     1 */
	uint8_t                    alignment_offset;     /*    25     1 */
	uint16_t                   min_io_size;          /*    26     2 */
	uint32_t                   opt_io_size;          /*    28     4 */
	uint8_t                    wce;                  /*    32     1 */
	uint8_t                    unused;               /*    33     1 */
	uint16_t                   num_queues;           /*    34     2 */

	/* size: 36, cachelines: 1, members: 12 */
	/* last cacheline: 36 bytes */
} __attribute__((__packed__));
struct virtio_blk_outhdr {
	__virtio32                 type;                 /*     0     4 */
	__virtio32                 ioprio;               /*     4     4 */
	__virtio64                 sector;               /*     8     8 */

	/* size: 16, cachelines: 1, members: 3 */
	/* last cacheline: 16 bytes */
};
struct virtio_scsi_inhdr {
	__virtio32                 errors;               /*     0     4 */
	__virtio32                 data_len;             /*     4     4 */
	__virtio32                 sense_len;            /*     8     4 */
	__virtio32                 residual;             /*    12     4 */

	/* size: 16, cachelines: 1, members: 4 */
	/* last cacheline: 16 bytes */
};
struct VirtQueueElement {
	unsigned int               index;                /*     0     4 */
	unsigned int               out_num;              /*     4     4 */
	unsigned int               in_num;               /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	hwaddr *                   in_addr;              /*    16     8 */
	hwaddr *                   out_addr;             /*    24     8 */
	struct iovec *             in_sg;                /*    32     8 */
	struct iovec *             out_sg;               /*    40     8 */

	/* size: 48, cachelines: 1, members: 7 */
	/* sum members: 44, holes: 1, sum holes: 4 */
	/* last cacheline: 48 bytes */
};
struct VirtioDeviceClass {
	DeviceClass                parent;               /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	DeviceRealize              realize;              /*   192     8 */
	DeviceUnrealize            unrealize;            /*   200     8 */
	uint64_t                   (*get_features)(VirtIODevice *, uint64_t, Error * *); /*   208     8 */
	uint64_t                   (*bad_features)(VirtIODevice *); /*   216     8 */
	void                       (*set_features)(VirtIODevice *, uint64_t); /*   224     8 */
	int                        (*validate_features)(VirtIODevice *); /*   232     8 */
	void                       (*get_config)(VirtIODevice *, uint8_t *); /*   240     8 */
	void                       (*set_config)(VirtIODevice *, const uint8_t  *); /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	void                       (*reset)(VirtIODevice *); /*   256     8 */
	void                       (*set_status)(VirtIODevice *, uint8_t); /*   264     8 */
	uint64_t                   legacy_features;      /*   272     8 */
	_Bool                      (*guest_notifier_pending)(VirtIODevice *, int); /*   280     8 */
	void                       (*guest_notifier_mask)(VirtIODevice *, int, _Bool); /*   288     8 */
	int                        (*start_ioeventfd)(VirtIODevice *); /*   296     8 */
	void                       (*stop_ioeventfd)(VirtIODevice *); /*   304     8 */
	void                       (*save)(VirtIODevice *, QEMUFile *); /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	int                        (*load)(VirtIODevice *, QEMUFile *, int); /*   320     8 */
	const VMStateDescription  * vmsd;                /*   328     8 */

	/* size: 336, cachelines: 6, members: 19 */
	/* last cacheline: 16 bytes */
};
struct VirtIOBlkConf {
	BlockConf                  conf;                 /*     0    56 */
	IOThread *                 iothread;             /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	char *                     serial;               /*    64     8 */
	uint32_t                   scsi;                 /*    72     4 */
	uint32_t                   config_wce;           /*    76     4 */
	uint32_t                   request_merging;      /*    80     4 */
	uint16_t                   num_queues;           /*    84     2 */

	/* size: 88, cachelines: 2, members: 7 */
	/* padding: 2 */
	/* last cacheline: 24 bytes */
};
struct virtio_blk_inhdr {
	unsigned char              status;               /*     0     1 */

	/* size: 1, cachelines: 1, members: 1 */
	/* last cacheline: 1 bytes */
};
struct VirtIOBlock {
	VirtIODevice               parent_obj;           /*     0   224 */
	/* --- cacheline 3 boundary (192 bytes) was 32 bytes ago --- */
	BlockBackend *             blk;                  /*   224     8 */
	void *                     rq;                   /*   232     8 */
	QEMUBH *                   bh;                   /*   240     8 */
	VirtIOBlkConf              conf;                 /*   248    88 */
	/* --- cacheline 5 boundary (320 bytes) was 16 bytes ago --- */
	short unsigned int         sector_mask;          /*   336     2 */
	_Bool                      original_wce;         /*   338     1 */

	/* XXX 5 bytes hole, try to pack */

	VMChangeStateEntry *       change;               /*   344     8 */
	_Bool                      dataplane_disabled;   /*   352     1 */
	_Bool                      dataplane_started;    /*   353     1 */

	/* XXX 6 bytes hole, try to pack */

	struct VirtIOBlockDataPlane * dataplane;         /*   360     8 */

	/* size: 368, cachelines: 6, members: 11 */
	/* sum members: 357, holes: 2, sum holes: 11 */
	/* last cacheline: 48 bytes */
};
struct VirtIOBlockReq {
	VirtQueueElement           elem;                 /*     0    48 */
	int64_t                    sector_num;           /*    48     8 */
	VirtIOBlock *              dev;                  /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	VirtQueue *                vq;                   /*    64     8 */
	struct virtio_blk_inhdr *  in;                   /*    72     8 */
	struct virtio_blk_outhdr   out;                  /*    80    16 */
	QEMUIOVector               qiov;                 /*    96    24 */
	size_t                     in_len;               /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	struct VirtIOBlockReq *    next;                 /*   128     8 */
	struct VirtIOBlockReq *    mr_next;              /*   136     8 */
	BlockAcctCookie            acct;                 /*   144    24 */

	/* size: 168, cachelines: 3, members: 11 */
	/* last cacheline: 40 bytes */
};
struct MultiReqBuffer {
	VirtIOBlockReq *           reqs[32];             /*     0   256 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	unsigned int               num_reqs;             /*   256     4 */
	_Bool                      is_write;             /*   260     1 */

	/* size: 264, cachelines: 5, members: 3 */
	/* padding: 3 */
	/* last cacheline: 8 bytes */
};
struct sg_io_hdr {
	int                        interface_id;         /*     0     4 */
	int                        dxfer_direction;      /*     4     4 */
	unsigned char              cmd_len;              /*     8     1 */
	unsigned char              mx_sb_len;            /*     9     1 */
	short unsigned int         iovec_count;          /*    10     2 */
	unsigned int               dxfer_len;            /*    12     4 */
	void *                     dxferp;               /*    16     8 */
	unsigned char *            cmdp;                 /*    24     8 */
	unsigned char *            sbp;                  /*    32     8 */
	unsigned int               timeout;              /*    40     4 */
	unsigned int               flags;                /*    44     4 */
	int                        pack_id;              /*    48     4 */

	/* XXX 4 bytes hole, try to pack */

	void *                     usr_ptr;              /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	unsigned char              status;               /*    64     1 */
	unsigned char              masked_status;        /*    65     1 */
	unsigned char              msg_status;           /*    66     1 */
	unsigned char              sb_len_wr;            /*    67     1 */
	short unsigned int         host_status;          /*    68     2 */
	short unsigned int         driver_status;        /*    70     2 */
	int                        resid;                /*    72     4 */
	unsigned int               duration;             /*    76     4 */
	unsigned int               info;                 /*    80     4 */

	/* size: 88, cachelines: 2, members: 22 */
	/* sum members: 80, holes: 1, sum holes: 4 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct BusClass {
	ObjectClass                parent_class;         /*     0    96 */
	/* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */
	void                       (*print_dev)(Monitor *, DeviceState *, int); /*    96     8 */
	char *                     (*get_dev_path)(DeviceState *); /*   104     8 */
	char *                     (*get_fw_dev_path)(DeviceState *); /*   112     8 */
	void                       (*reset)(BusState *); /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	BusRealize                 realize;              /*   128     8 */
	BusUnrealize               unrealize;            /*   136     8 */
	int                        max_dev;              /*   144     4 */
	int                        automatic_ids;        /*   148     4 */

	/* size: 152, cachelines: 3, members: 9 */
	/* last cacheline: 24 bytes */
};
struct VirtIOBlockDataPlane {
	_Bool                      starting;             /*     0     1 */
	_Bool                      stopping;             /*     1     1 */

	/* XXX 6 bytes hole, try to pack */

	VirtIOBlkConf *            conf;                 /*     8     8 */
	VirtIODevice *             vdev;                 /*    16     8 */
	QEMUBH *                   bh;                   /*    24     8 */
	long unsigned int *        batch_notify_vqs;     /*    32     8 */
	IOThread *                 iothread;             /*    40     8 */
	AioContext *               ctx;                  /*    48     8 */

	/* size: 56, cachelines: 1, members: 8 */
	/* sum members: 50, holes: 1, sum holes: 6 */
	/* last cacheline: 56 bytes */
};
struct VirtioBusState {
	BusState                   parent_obj;           /*     0   104 */
	/* --- cacheline 1 boundary (64 bytes) was 40 bytes ago --- */
	_Bool                      ioeventfd_started;    /*   104     1 */

	/* XXX 3 bytes hole, try to pack */

	int                        ioeventfd_grabbed;    /*   108     4 */

	/* size: 112, cachelines: 2, members: 3 */
	/* sum members: 109, holes: 1, sum holes: 3 */
	/* last cacheline: 48 bytes */
};
struct VirtioBusClass {
	BusClass                   parent;               /*     0   152 */
	/* --- cacheline 2 boundary (128 bytes) was 24 bytes ago --- */
	void                       (*notify)(DeviceState *, uint16_t); /*   152     8 */
	void                       (*save_config)(DeviceState *, QEMUFile *); /*   160     8 */
	void                       (*save_queue)(DeviceState *, int, QEMUFile *); /*   168     8 */
	void                       (*save_extra_state)(DeviceState *, QEMUFile *); /*   176     8 */
	int                        (*load_config)(DeviceState *, QEMUFile *); /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	int                        (*load_queue)(DeviceState *, int, QEMUFile *); /*   192     8 */
	int                        (*load_done)(DeviceState *, QEMUFile *); /*   200     8 */
	int                        (*load_extra_state)(DeviceState *, QEMUFile *); /*   208     8 */
	_Bool                      (*has_extra_state)(DeviceState *); /*   216     8 */
	_Bool                      (*query_guest_notifiers)(DeviceState *); /*   224     8 */
	int                        (*set_guest_notifiers)(DeviceState *, int, _Bool); /*   232     8 */
	void                       (*vmstate_change)(DeviceState *, _Bool); /*   240     8 */
	void                       (*pre_plugged)(DeviceState *, Error * *); /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	void                       (*device_plugged)(DeviceState *, Error * *); /*   256     8 */
	void                       (*device_unplugged)(DeviceState *); /*   264     8 */
	int                        (*query_nvectors)(DeviceState *); /*   272     8 */
	_Bool                      (*ioeventfd_enabled)(DeviceState *); /*   280     8 */
	int                        (*ioeventfd_assign)(DeviceState *, EventNotifier *, int, _Bool); /*   288     8 */
	_Bool                      has_variable_vring_alignment; /*   296     1 */

	/* size: 304, cachelines: 5, members: 20 */
	/* padding: 7 */
	/* last cacheline: 48 bytes */
};
struct InterfaceClass {
	ObjectClass                parent_class;         /*     0    96 */
	/* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */
	ObjectClass *              concrete_class;       /*    96     8 */
	Type                       interface_type;       /*   104     8 */

	/* size: 112, cachelines: 2, members: 3 */
	/* last cacheline: 48 bytes */
};
struct HotplugHandlerClass {
	InterfaceClass             parent;               /*     0   112 */
	/* --- cacheline 1 boundary (64 bytes) was 48 bytes ago --- */
	hotplug_fn                 pre_plug;             /*   112     8 */
	hotplug_fn                 plug;                 /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	hotplug_fn                 unplug_request;       /*   128     8 */
	hotplug_fn                 unplug;               /*   136     8 */

	/* size: 144, cachelines: 3, members: 5 */
	/* last cacheline: 16 bytes */
};
struct virtio_console_config {
	uint16_t                   cols;                 /*     0     2 */
	uint16_t                   rows;                 /*     2     2 */
	uint32_t                   max_nr_ports;         /*     4     4 */
	uint32_t                   emerg_wr;             /*     8     4 */

	/* size: 12, cachelines: 1, members: 4 */
	/* last cacheline: 12 bytes */
};
struct virtio_console_control {
	__virtio32                 id;                   /*     0     4 */
	__virtio16                 event;                /*     4     2 */
	__virtio16                 value;                /*     6     2 */

	/* size: 8, cachelines: 1, members: 3 */
	/* last cacheline: 8 bytes */
};
struct virtio_serial_conf {
	uint32_t                   max_virtserial_ports; /*     0     4 */

	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
struct VirtIOSerial {
	VirtIODevice               parent_obj;           /*     0   224 */
	/* --- cacheline 3 boundary (192 bytes) was 32 bytes ago --- */
	VirtQueue *                c_ivq;                /*   224     8 */
	VirtQueue *                c_ovq;                /*   232     8 */
	VirtQueue * *              ivqs;                 /*   240     8 */
	VirtQueue * *              ovqs;                 /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	VirtIOSerialBus            bus;                  /*   256   120 */
	/* --- cacheline 5 boundary (320 bytes) was 56 bytes ago --- */
	struct {
		struct VirtIOSerialPort * tqh_first;     /*   376     8 */
		/* --- cacheline 6 boundary (384 bytes) --- */
		struct VirtIOSerialPort * * tqh_last;    /*   384     8 */
	} ports;                                         /*   376    16 */
	struct {
		struct VirtIOSerial * le_next;           /*   392     8 */
		struct VirtIOSerial * * le_prev;         /*   400     8 */
	} next;                                          /*   392    16 */
	uint32_t *                 ports_map;            /*   408     8 */
	struct VirtIOSerialPostLoad * post_load;         /*   416     8 */
	virtio_serial_conf         serial;               /*   424     4 */

	/* XXX 4 bytes hole, try to pack */

	uint64_t                   host_features;        /*   432     8 */

	/* size: 440, cachelines: 7, members: 12 */
	/* sum members: 436, holes: 1, sum holes: 4 */
	/* last cacheline: 56 bytes */
};
struct VirtIOSerialBus {
	BusState                   qbus;                 /*     0   104 */
	/* --- cacheline 1 boundary (64 bytes) was 40 bytes ago --- */
	VirtIOSerial *             vser;                 /*   104     8 */
	uint32_t                   max_nr_ports;         /*   112     4 */

	/* size: 120, cachelines: 2, members: 3 */
	/* padding: 4 */
	/* last cacheline: 56 bytes */
};
struct VirtIOSerialPort {
	DeviceState                dev;                  /*     0   112 */
	/* --- cacheline 1 boundary (64 bytes) was 48 bytes ago --- */
	struct {
		struct VirtIOSerialPort * tqe_next;      /*   112     8 */
		struct VirtIOSerialPort * * tqe_prev;    /*   120     8 */
	} next;                                          /*   112    16 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	VirtIOSerial *             vser;                 /*   128     8 */
	VirtQueue *                ivq;                  /*   136     8 */
	VirtQueue *                ovq;                  /*   144     8 */
	char *                     name;                 /*   152     8 */
	uint32_t                   id;                   /*   160     4 */

	/* XXX 4 bytes hole, try to pack */

	VirtQueueElement *         elem;                 /*   168     8 */
	uint32_t                   iov_idx;              /*   176     4 */

	/* XXX 4 bytes hole, try to pack */

	uint64_t                   iov_offset;           /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	QEMUBH *                   bh;                   /*   192     8 */
	_Bool                      guest_connected;      /*   200     1 */
	_Bool                      host_connected;       /*   201     1 */
	_Bool                      throttled;            /*   202     1 */

	/* size: 208, cachelines: 4, members: 14 */
	/* sum members: 195, holes: 2, sum holes: 8 */
	/* padding: 5 */
	/* last cacheline: 16 bytes */
};
struct VirtIOSerialPortClass {
	DeviceClass                parent_class;         /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	_Bool                      is_console;           /*   192     1 */

	/* XXX 7 bytes hole, try to pack */

	DeviceRealize              realize;              /*   200     8 */
	DeviceUnrealize            unrealize;            /*   208     8 */
	void                       (*set_guest_connected)(VirtIOSerialPort *, int); /*   216     8 */
	void                       (*guest_ready)(VirtIOSerialPort *); /*   224     8 */
	void                       (*guest_writable)(VirtIOSerialPort *); /*   232     8 */
	ssize_t                    (*have_data)(VirtIOSerialPort *, const uint8_t  *, ssize_t); /*   240     8 */

	/* size: 248, cachelines: 4, members: 8 */
	/* sum members: 241, holes: 1, sum holes: 7 */
	/* last cacheline: 56 bytes */
};
struct VirtIOSerialPostLoad {
	QEMUTimer *                timer;                /*     0     8 */
	uint32_t                   nr_active_ports;      /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		VirtIOSerialPort * port;         /*     0     8 */
		uint8_t    host_connected;       /*     8     1 */
	} * connected; /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct VirtIOSerialDevices {
	struct {
		struct VirtIOSerial * lh_first;          /*     0     8 */
	} devices;                                       /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct NMIState {
	Object                     parent_obj;           /*     0    40 */

	/* size: 40, cachelines: 1, members: 1 */
	/* last cacheline: 40 bytes */
};
struct NMIClass {
	InterfaceClass             parent_class;         /*     0   112 */
	/* --- cacheline 1 boundary (64 bytes) was 48 bytes ago --- */
	void                       (*nmi_monitor_handler)(NMIState *, int, Error * *); /*   112     8 */

	/* size: 120, cachelines: 2, members: 2 */
	/* last cacheline: 56 bytes */
};
struct do_nmi_s {
	int                        cpu_index;            /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	Error *                    err;                  /*     8     8 */
	_Bool                      handled;              /*    16     1 */

	/* size: 24, cachelines: 1, members: 3 */
	/* sum members: 13, holes: 1, sum holes: 4 */
	/* padding: 7 */
	/* last cacheline: 24 bytes */
};
struct GenericLoaderState {
	DeviceState                parent_obj;           /*     0   112 */
	/* --- cacheline 1 boundary (64 bytes) was 48 bytes ago --- */
	CPUState *                 cpu;                  /*   112     8 */
	uint64_t                   addr;                 /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	uint64_t                   data;                 /*   128     8 */
	uint8_t                    data_len;             /*   136     1 */

	/* XXX 3 bytes hole, try to pack */

	uint32_t                   cpu_num;              /*   140     4 */
	char *                     file;                 /*   144     8 */
	_Bool                      force_raw;            /*   152     1 */
	_Bool                      data_be;              /*   153     1 */
	_Bool                      set_pc;               /*   154     1 */

	/* size: 160, cachelines: 3, members: 10 */
	/* sum members: 152, holes: 1, sum holes: 3 */
	/* padding: 5 */
	/* last cacheline: 32 bytes */
};
struct CPUCore {
	DeviceState                parent_obj;           /*     0   112 */
	/* --- cacheline 1 boundary (64 bytes) was 48 bytes ago --- */
	int                        core_id;              /*   112     4 */
	int                        nr_threads;           /*   116     4 */

	/* size: 120, cachelines: 2, members: 3 */
	/* last cacheline: 56 bytes */
};
struct DisplaySurface {
	pixman_format_code_t       format;               /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	pixman_image_t *           image;                /*     8     8 */
	uint8_t                    flags;                /*    16     1 */

	/* size: 24, cachelines: 1, members: 3 */
	/* sum members: 13, holes: 1, sum holes: 4 */
	/* padding: 7 */
	/* last cacheline: 24 bytes */
};
struct QemuUIInfo {
	int                        xoff;                 /*     0     4 */
	int                        yoff;                 /*     4     4 */
	uint32_t                   width;                /*     8     4 */
	uint32_t                   height;               /*    12     4 */

	/* size: 16, cachelines: 1, members: 4 */
	/* last cacheline: 16 bytes */
};
struct GraphicHwOps {
	void                       (*invalidate)(void *); /*     0     8 */
	void                       (*gfx_update)(void *); /*     8     8 */
	void                       (*text_update)(void *, console_ch_t *); /*    16     8 */
	void                       (*update_interval)(void *, uint64_t); /*    24     8 */
	int                        (*ui_info)(void *, uint32_t, QemuUIInfo *); /*    32     8 */
	void                       (*gl_block)(void *, _Bool); /*    40     8 */

	/* size: 48, cachelines: 1, members: 6 */
	/* last cacheline: 48 bytes */
};
struct vga_precise_retrace {
	int64_t                    ticks_per_char;       /*     0     8 */
	int64_t                    total_chars;          /*     8     8 */
	int                        htotal;               /*    16     4 */
	int                        hstart;               /*    20     4 */
	int                        hend;                 /*    24     4 */
	int                        vstart;               /*    28     4 */
	int                        vend;                 /*    32     4 */
	int                        freq;                 /*    36     4 */

	/* size: 40, cachelines: 1, members: 8 */
	/* last cacheline: 40 bytes */
};
union vga_retrace {
	struct vga_precise_retrace precise;            /*     0    40 */
};
struct VGACommonState {
	MemoryRegion *             legacy_address_space; /*     0     8 */
	uint8_t *                  vram_ptr;             /*     8     8 */
	MemoryRegion               vram;                 /*    16   256 */
	/* --- cacheline 4 boundary (256 bytes) was 16 bytes ago --- */
	MemoryRegion               vram_vbe;             /*   272   256 */
	/* --- cacheline 8 boundary (512 bytes) was 16 bytes ago --- */
	uint32_t                   vram_size;            /*   528     4 */
	uint32_t                   vram_size_mb;         /*   532     4 */
	uint32_t                   vbe_size;             /*   536     4 */
	uint32_t                   latch;                /*   540     4 */
	_Bool                      has_chain4_alias;     /*   544     1 */

	/* XXX 15 bytes hole, try to pack */

	MemoryRegion               chain4_alias;         /*   560   256 */
	/* --- cacheline 12 boundary (768 bytes) was 48 bytes ago --- */
	uint8_t                    sr_index;             /*   816     1 */
	uint8_t                    sr[256];              /*   817   256 */
	/* --- cacheline 16 boundary (1024 bytes) was 49 bytes ago --- */
	uint8_t                    sr_vbe[256];          /*  1073   256 */
	/* --- cacheline 20 boundary (1280 bytes) was 49 bytes ago --- */
	uint8_t                    gr_index;             /*  1329     1 */
	uint8_t                    gr[256];              /*  1330   256 */
	/* --- cacheline 24 boundary (1536 bytes) was 50 bytes ago --- */
	uint8_t                    ar_index;             /*  1586     1 */
	uint8_t                    ar[21];               /*  1587    21 */
	/* --- cacheline 25 boundary (1600 bytes) was 8 bytes ago --- */
	int                        ar_flip_flop;         /*  1608     4 */
	uint8_t                    cr_index;             /*  1612     1 */
	uint8_t                    cr[256];              /*  1613   256 */
	/* --- cacheline 29 boundary (1856 bytes) was 13 bytes ago --- */
	uint8_t                    msr;                  /*  1869     1 */
	uint8_t                    fcr;                  /*  1870     1 */
	uint8_t                    st00;                 /*  1871     1 */
	uint8_t                    st01;                 /*  1872     1 */
	uint8_t                    dac_state;            /*  1873     1 */
	uint8_t                    dac_sub_index;        /*  1874     1 */
	uint8_t                    dac_read_index;       /*  1875     1 */
	uint8_t                    dac_write_index;      /*  1876     1 */
	uint8_t                    dac_cache[3];         /*  1877     3 */
	int                        dac_8bit;             /*  1880     4 */
	uint8_t                    palette[768];         /*  1884   768 */
	/* --- cacheline 41 boundary (2624 bytes) was 28 bytes ago --- */
	int32_t                    bank_offset;          /*  2652     4 */
	int                        (*get_bpp)(struct VGACommonState *); /*  2656     8 */
	void                       (*get_offsets)(struct VGACommonState *, uint32_t *, uint32_t *, uint32_t *); /*  2664     8 */
	void                       (*get_resolution)(struct VGACommonState *, int *, int *); /*  2672     8 */
	PortioList                 vga_port_list;        /*  2680    64 */
	/* --- cacheline 42 boundary (2688 bytes) was 56 bytes ago --- */
	PortioList                 vbe_port_list;        /*  2744    64 */
	/* --- cacheline 43 boundary (2752 bytes) was 56 bytes ago --- */
	uint16_t                   vbe_index;            /*  2808     2 */
	uint16_t                   vbe_regs[10];         /*  2810    20 */

	/* XXX 2 bytes hole, try to pack */

	/* --- cacheline 44 boundary (2816 bytes) was 16 bytes ago --- */
	uint32_t                   vbe_start_addr;       /*  2832     4 */
	uint32_t                   vbe_line_offset;      /*  2836     4 */
	uint32_t                   vbe_bank_mask;        /*  2840     4 */
	int                        vbe_mapped;           /*  2844     4 */
	QemuConsole *              con;                  /*  2848     8 */
	uint32_t                   font_offsets[2];      /*  2856     8 */
	int                        graphic_mode;         /*  2864     4 */
	uint8_t                    shift_control;        /*  2868     1 */
	uint8_t                    double_scan;          /*  2869     1 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   line_offset;          /*  2872     4 */
	uint32_t                   line_compare;         /*  2876     4 */
	/* --- cacheline 45 boundary (2880 bytes) --- */
	uint32_t                   start_addr;           /*  2880     4 */
	uint32_t                   plane_updated;        /*  2884     4 */
	uint32_t                   last_line_offset;     /*  2888     4 */
	uint8_t                    last_cw;              /*  2892     1 */
	uint8_t                    last_ch;              /*  2893     1 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   last_width;           /*  2896     4 */
	uint32_t                   last_height;          /*  2900     4 */
	uint32_t                   last_scr_width;       /*  2904     4 */
	uint32_t                   last_scr_height;      /*  2908     4 */
	uint32_t                   last_depth;           /*  2912     4 */
	_Bool                      last_byteswap;        /*  2916     1 */
	_Bool                      force_shadow;         /*  2917     1 */
	uint8_t                    cursor_start;         /*  2918     1 */
	uint8_t                    cursor_end;           /*  2919     1 */
	_Bool                      cursor_visible_phase; /*  2920     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t                    cursor_blink_time;    /*  2928     8 */
	uint32_t                   cursor_offset;        /*  2936     4 */

	/* XXX 4 bytes hole, try to pack */

	/* --- cacheline 46 boundary (2944 bytes) --- */
	const GraphicHwOps  *      hw_ops;               /*  2944     8 */
	_Bool                      full_update_text;     /*  2952     1 */
	_Bool                      full_update_gfx;      /*  2953     1 */
	_Bool                      big_endian_fb;        /*  2954     1 */
	_Bool                      default_endian_fb;    /*  2955     1 */
	uint32_t                   invalidated_y_table[64]; /*  2956   256 */
	/* --- cacheline 50 boundary (3200 bytes) was 12 bytes ago --- */
	uint32_t                   hw_cursor_x;          /*  3212     4 */
	uint32_t                   hw_cursor_y;          /*  3216     4 */

	/* XXX 4 bytes hole, try to pack */

	void                       (*cursor_invalidate)(struct VGACommonState *); /*  3224     8 */
	void                       (*cursor_draw_line)(struct VGACommonState *, uint8_t *, int); /*  3232     8 */
	uint32_t                   last_palette[256];    /*  3240  1024 */
	/* --- cacheline 66 boundary (4224 bytes) was 40 bytes ago --- */
	uint32_t                   last_ch_attr[16000];  /*  4264 64000 */
	/* --- cacheline 1066 boundary (68224 bytes) was 40 bytes ago --- */
	vga_retrace_fn             retrace;              /* 68264     8 */
	vga_update_retrace_info_fn update_retrace_info;  /* 68272     8 */
	union vga_retrace          retrace_info;         /* 68280    40 */
	/* --- cacheline 1067 boundary (68288 bytes) was 32 bytes ago --- */
	uint8_t                    is_vbe_vmstate;       /* 68320     1 */

	/* Force padding: */
	uint8_t                    :8;
	uint8_t                    :8;
	uint8_t                    :8;
	uint8_t                    :8;
	uint8_t                    :8;
	uint8_t                    :8;
	uint8_t                    :8;
	uint8_t                    :8;
	uint8_t                    :8;
	uint8_t                    :8;
	uint8_t                    :8;
	uint8_t                    :8;
	uint8_t                    :8;
	uint8_t                    :8;
	uint8_t                    :8;

	/* size: 68336, cachelines: 1068, members: 83 */
	/* sum members: 68285, holes: 7, sum holes: 36 */
	/* padding: 15 */
	/* last cacheline: 48 bytes */
};
struct pixman_region16_data {
	long int                   size;                 /*     0     8 */
	long int                   numRects;             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct pixman_box16 {
	int16_t                    x1;                   /*     0     2 */
	int16_t                    y1;                   /*     2     2 */
	int16_t                    x2;                   /*     4     2 */
	int16_t                    y2;                   /*     6     2 */

	/* size: 8, cachelines: 1, members: 4 */
	/* last cacheline: 8 bytes */
};
struct pixman_region16 {
	pixman_box16_t             extents;              /*     0     8 */
	pixman_region16_data_t *   data;                 /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct QEMUCursor {
	int                        width;                /*     0     4 */
	int                        height;               /*     4     4 */
	int                        hot_x;                /*     8     4 */
	int                        hot_y;                /*    12     4 */
	int                        refcount;             /*    16     4 */
	uint32_t                   data[];               /*    20     0 */

	/* size: 20, cachelines: 1, members: 6 */
	/* last cacheline: 20 bytes */
};
struct virtio_gpu_ctrl_hdr {
	uint32_t                   type;                 /*     0     4 */
	uint32_t                   flags;                /*     4     4 */
	uint64_t                   fence_id;             /*     8     8 */
	uint32_t                   ctx_id;               /*    16     4 */
	uint32_t                   padding;              /*    20     4 */

	/* size: 24, cachelines: 1, members: 5 */
	/* last cacheline: 24 bytes */
};
struct virtio_gpu_cursor_pos {
	uint32_t                   scanout_id;           /*     0     4 */
	uint32_t                   x;                    /*     4     4 */
	uint32_t                   y;                    /*     8     4 */
	uint32_t                   padding;              /*    12     4 */

	/* size: 16, cachelines: 1, members: 4 */
	/* last cacheline: 16 bytes */
};
struct virtio_gpu_update_cursor {
	struct virtio_gpu_ctrl_hdr hdr;                  /*     0    24 */
	struct virtio_gpu_cursor_pos pos;                /*    24    16 */
	uint32_t                   resource_id;          /*    40     4 */
	uint32_t                   hot_x;                /*    44     4 */
	uint32_t                   hot_y;                /*    48     4 */
	uint32_t                   padding;              /*    52     4 */

	/* size: 56, cachelines: 1, members: 6 */
	/* last cacheline: 56 bytes */
};
struct virtio_gpu_rect {
	uint32_t                   x;                    /*     0     4 */
	uint32_t                   y;                    /*     4     4 */
	uint32_t                   width;                /*     8     4 */
	uint32_t                   height;               /*    12     4 */

	/* size: 16, cachelines: 1, members: 4 */
	/* last cacheline: 16 bytes */
};
struct virtio_gpu_resource_unref {
	struct virtio_gpu_ctrl_hdr hdr;                  /*     0    24 */
	uint32_t                   resource_id;          /*    24     4 */
	uint32_t                   padding;              /*    28     4 */

	/* size: 32, cachelines: 1, members: 3 */
	/* last cacheline: 32 bytes */
};
struct virtio_gpu_resource_create_2d {
	struct virtio_gpu_ctrl_hdr hdr;                  /*     0    24 */
	uint32_t                   resource_id;          /*    24     4 */
	uint32_t                   format;               /*    28     4 */
	uint32_t                   width;                /*    32     4 */
	uint32_t                   height;               /*    36     4 */

	/* size: 40, cachelines: 1, members: 5 */
	/* last cacheline: 40 bytes */
};
struct virtio_gpu_set_scanout {
	struct virtio_gpu_ctrl_hdr hdr;                  /*     0    24 */
	struct virtio_gpu_rect     r;                    /*    24    16 */
	uint32_t                   scanout_id;           /*    40     4 */
	uint32_t                   resource_id;          /*    44     4 */

	/* size: 48, cachelines: 1, members: 4 */
	/* last cacheline: 48 bytes */
};
struct virtio_gpu_resource_flush {
	struct virtio_gpu_ctrl_hdr hdr;                  /*     0    24 */
	struct virtio_gpu_rect     r;                    /*    24    16 */
	uint32_t                   resource_id;          /*    40     4 */
	uint32_t                   padding;              /*    44     4 */

	/* size: 48, cachelines: 1, members: 4 */
	/* last cacheline: 48 bytes */
};
struct virtio_gpu_transfer_to_host_2d {
	struct virtio_gpu_ctrl_hdr hdr;                  /*     0    24 */
	struct virtio_gpu_rect     r;                    /*    24    16 */
	uint64_t                   offset;               /*    40     8 */
	uint32_t                   resource_id;          /*    48     4 */
	uint32_t                   padding;              /*    52     4 */

	/* size: 56, cachelines: 1, members: 5 */
	/* last cacheline: 56 bytes */
};
struct virtio_gpu_mem_entry {
	uint64_t                   addr;                 /*     0     8 */
	uint32_t                   length;               /*     8     4 */
	uint32_t                   padding;              /*    12     4 */

	/* size: 16, cachelines: 1, members: 3 */
	/* last cacheline: 16 bytes */
};
struct virtio_gpu_resource_attach_backing {
	struct virtio_gpu_ctrl_hdr hdr;                  /*     0    24 */
	uint32_t                   resource_id;          /*    24     4 */
	uint32_t                   nr_entries;           /*    28     4 */

	/* size: 32, cachelines: 1, members: 3 */
	/* last cacheline: 32 bytes */
};
struct virtio_gpu_resource_detach_backing {
	struct virtio_gpu_ctrl_hdr hdr;                  /*     0    24 */
	uint32_t                   resource_id;          /*    24     4 */
	uint32_t                   padding;              /*    28     4 */

	/* size: 32, cachelines: 1, members: 3 */
	/* last cacheline: 32 bytes */
};
struct virtio_gpu_display_one {
	struct virtio_gpu_rect     r;                    /*     0    16 */
	uint32_t                   enabled;              /*    16     4 */
	uint32_t                   flags;                /*    20     4 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct virtio_gpu_resp_display_info {
	struct virtio_gpu_ctrl_hdr hdr;                  /*     0    24 */
	struct virtio_gpu_display_one pmodes[16];        /*    24   384 */

	/* size: 408, cachelines: 7, members: 2 */
	/* last cacheline: 24 bytes */
};
struct virtio_gpu_config {
	uint32_t                   events_read;          /*     0     4 */
	uint32_t                   events_clear;         /*     4     4 */
	uint32_t                   num_scanouts;         /*     8     4 */
	uint32_t                   num_capsets;          /*    12     4 */

	/* size: 16, cachelines: 1, members: 4 */
	/* last cacheline: 16 bytes */
};
struct virtio_gpu_simple_resource {
	uint32_t                   resource_id;          /*     0     4 */
	uint32_t                   width;                /*     4     4 */
	uint32_t                   height;               /*     8     4 */
	uint32_t                   format;               /*    12     4 */
	uint64_t *                 addrs;                /*    16     8 */
	struct iovec *             iov;                  /*    24     8 */
	unsigned int               iov_cnt;              /*    32     4 */
	uint32_t                   scanout_bitmask;      /*    36     4 */
	pixman_image_t *           image;                /*    40     8 */
	struct {
		struct virtio_gpu_simple_resource * tqe_next; /*    48     8 */
		struct virtio_gpu_simple_resource * * tqe_prev; /*    56     8 */
	} next;                                          /*    48    16 */

	/* size: 64, cachelines: 1, members: 10 */
};
struct virtio_gpu_scanout {
	QemuConsole *              con;                  /*     0     8 */
	DisplaySurface *           ds;                   /*     8     8 */
	uint32_t                   width;                /*    16     4 */
	uint32_t                   height;               /*    20     4 */
